{"intents": [
                {"tag": "Cuts",
                "patterns": ["What to do if Cuts?", "How to cure Cuts?", "Which medicine to apply for Cuts?", "what to apply on cuts?", "Cuts"],
                "responses": ["Wash the cut properly to prevent infection and stop the bleeding by applying pressure for 1-2minutes until bleeding stops. Apply Petroleum Jelly to make sure that the wound is moist for quick healing. Finally cover the cut with a sterile bandage. Pain relievers such as acetaminophen can be applied."],
                "context_set": ""
                },

                {"tag": "Abrasions",
                "patterns": ["how do you treat abrasions?", "Do Abrasions cause scars?", "Abrasions", "what to do if abrasions?", "Which medicine to apply for abrasions?", "How to cure abrasions?"],
                "responses": ["Begin with washed hands.Gently clean the area with cool to lukewarm water and mild soap. Remove dirt or other particles from the wound using sterilized tweezers.For a mild scrape that’s not bleeding, leave the wound uncovered.If the wound is bleeding, use a clean cloth or bandage, and apply gentle pressure to the area to stop any bleeding.Cover a wound that bled with a thin layer of topical antibiotic ointment, like Bacitracin, or a sterile moisture barrier ointment, like Aquaphor. Cover it with a clean bandage or gauze. Gently clean the wound and change the ointment and bandage once per day.Watch the area for signs of infection, like pain or redness and swelling. See your doctor if you suspect infection."],
                "context_set": ""
                },

                {"tag": "stings",
                "patterns": ["How do you treat Sting?", "Stings", "What to do if you get a sting?", "Which medicine to apply if sting?"],
                "responses": ["Remove any stingers immediately. Some experts recommend scraping out the stinger with a credit card. Applying ice to the site may provide some mild relief. Apply ice for 20 minutes once every hour as needed. Wrap the ice in a towel or keep a cloth between the ice and skin to keep from freezing the skin. Taking an antihistamine such as diphenhydramine (Benadryl) or a nonsedating one such as loratadine (Claritin) will help with itching and swelling. Take acetaminophen (Tylenol) or ibuprofen (Motrin)for pain relief as needed. Wash the sting site with soap and water. Placing hydrocortisone cream on the sting can help relieve redness, itching, and swelling."],
                "context_set": ""
                },

                {"tag": "Splinter",
                "patterns": ["How to remove Splinters", "How to cure Splinters?", "What to do if I have splinters?", "How do you bring a splinter to the surface?"],
                "responses": ["1. SOAK IT IN EPSOM SALTS. Dissolve a cup of the salts into a warm bath and soak whatever part of the body has the splinter. Failing that, you can also put some of the salts onto a bandage pad and leave it covered for a day; this will eventually help bring the splinter to the surface. 2. VINEGAR OR OIL. Another simple way to draw out that stubborn splinter is to soak the affected area in oil (olive or corn) or white vinegar. Just pour some in a bowl and soak the area for around 20 to 30 minutes,"],
                "context_set": ""
                },

                {"tag": "Sprains",
                "patterns": ["How do you treat a sprain?", "what to do if i get a sprain?", "Which cream to apply if i get a sprain?", "Which medicine to apply if I get a sprain?"],
                "responses": ["Use an ice pack or ice slush bath immediately for 15 to 20 minutes and repeat every two to three hours while you're awake. To help stop swelling, compress the ankle with an elastic bandage until the swelling stops. In most cases, pain relievers — such as ibuprofen (Advil, Motrin IB, others) or naproxen sodium (Aleve, others) or acetaminophen (Tylenol, others) are enough to manage the pain of a sprained ankle."],
                "context_set": ""
                },

                {"tag": "Strains",
                "patterns": ["How do you treat a strain?", "what to do if i get a strain?", "Which cream to apply if i get a strain?", "Which medicine to apply if I get a strain?", "How do you diagnose a strain?", "Is heat or ice better for a pulled muscle?"],
                "responses": ["Rest,Ice,Compression and Elevation can be used to cure strains. Avoid using your muscle for a few days, especially if movement causes an increase in pain and also Apply ice immediately after injuring your muscle. This will minimize swelling. Don’t put ice directly on your skin. Use an ice pack or wrap ice in a towel. To reduce swelling, wrap the affected area with an elastic bandage until swelling comes down."],
                "context_set": ""
                },

                {"tag": "Fever",
                "patterns": ["How do you treat a mild Fever?", "what to do if i get a mild fever?", "Which medicine to take if I get a mild fever?", "fever"],
                "responses": ["To treat a fever at home: 1)Drink plenty of fluids to stay hydrated. 2)Dress in lightweight clothing. 3)Use a light blanket if you feel chilled, until the chills end. 4)Take acetaminophen (Tylenol, others) or ibuprofen (Advil, Motrin IB, others). 5) Get medical help if the fever lasts more than five days in a row."],
                "context_set": ""
                },

                {"tag": "Nasal Congestion",
                "patterns": ["How do you treat nasal Congestion?", "what to do if i get a nasal congestion?", "Which medicine to take if I have a nasal congestion?", "what to do if i have a blocked nose?", "How do you treat a blocked nose?", "How long does nasal congestion last?"],
                "responses": ["When you’re stuffed up, focus on keeping your nasal passages and sinuses moist. To keep your nasal passages moist, you can: 1)Use a humidifier or vaporizer. 2)Drink lots of fluids. This will thin out your mucus, which could help prevent blocked sinuses. 3)Place a warm, wet towel on your face. It may relieve discomfort and open your nasal passages."],
                "context_set": ""
                },

                {"tag": "Cough",
                "patterns": ["How to cure cough?","How do you treat cough?", "what to do if i get a cough?", "Which medicine to take if I get cough?", "How do you get rid of cough?"],
                "responses": ["1) Honey:- Use honey to treat a cough, mix 2 teaspoons (tsp) with warm water or an herbal tea. Drink this mixture once or twice a day. Do not give honey to children under 1 year of age. 2) Ginger:- Brew up a soothing ginger tea by adding 20–40 grams (g) of fresh ginger slices to a cup of hot water. Allow to steep for a few minutes before drinking. Add honey or lemon juice to improve the taste and further soothe a cough. 3) Fluids:- Staying hydrated is vital for those with a cough or cold. Research indicates that drinking liquids at room temperature can alleviate a cough, runny nose, and sneezing."],
                "context_set": ""
                },

                {"tag": "Sore Throat",
                "patterns": ["How do you treat sore throat?", "what to do if i get a sore throat?", "Which medicine to take if I get a sore throat?", "How to cure sore throat?"],
                "responses": ["1) Make sure you get plenty of rest and drink a lot of fluids. 2)Inhale steam,Run hot water in a sink.Drape a towel over you to trap the steam, and have the person lean over the sink with the water running. Tell him to breathe deeply through his mouth and nose for 5 to 10 minutes. Repeat several times a day. 3)Have him sip chicken broth or warm tea with honey. Don’t give honey to a child under 12 months of age."],
                "context_set": ""
                },

                {"tag": "Gastrointestinal problems",
                "patterns": ["How do you treat gas problems?", "what to do if i have Gastrointestinal problems?", "Which medicine to take if I get gas problem?", "How to cure Gas problems?"],
                "responses": ["1) Replenish body fluids 2)Do not take antidiarrheal drugs or laxatives or pain medication, unless specified by a medical professional.3)Taking antacids may help, per recommendation of a healthcare professional. 4)If prone to frequent heartburns, seek medical help. 5)Taking meals that are not spicy regularly, can relieve ulcer pains. 6)Seek medical help, if conditions persist or continue to worsen"],
                "context_set": ""
                },

                {"tag": "Skin problems",
                "patterns": ["How do you treat Skin problems?", "what to do if i get a skin allergy?", "Which medicine to take if I get a skin allergy?", "How to cure skin allergy?"],
                "responses": ["1)Hydrocortisone cream. 2)Ointments like calamine lotion. 3)Antihistamines. 4)Cold compresses. 5)Oatmeal baths. 6)Talk to your doctor about what's best for your specific rash."],
                "context_set": ""
                },

                {"tag": "Abdonominal Pain",
                "patterns": ["How do you treat Abdonominal Pain?", "what to do if i get a Abdonominal Pain?", "Which medicine to take if I get a Abdonominal Pain?", "How to cure Abdonominal Pain?"],
                "responses": ["1)Provide clear fluids to sip, such as water, broth, or fruit juice diluted with water. 2)Serve bland foods, such as saltine crackers, plain bread, dry toast, rice, gelatin, or applesauce. 3)Avoid spicy or greasy foods and caffeinated or carbonated drinks until 48 hours after all symptoms have gone away. "],
                "context_set": ""
                },

                {"tag": "Bruises",
                "patterns": ["How do you treat Bruises?", "what to do if i get a Bruise?", "Which medicine to take if I get a Bruise?", "How to cure Bruises?"],
                "responses": ["1)Ice the bruise with an ice pack wrapped in a towel. 2)Leave it in place for 10 to 20 minutes. 3)Repeat several times a day for a day or two as needed. 4)Compress the bruised area if it is swelling, using an elastic bandage. "],
                "context_set": ""
                },

                {"tag": "Broken Toe",
                "patterns": ["How do you treat a Broken Toe?", "what to do if i get a Broken Toe?", "Which medicine to take if I get a Broken Toe?", "How to cure Broken Toe?"],
                "responses": ["1)To help decrease pain and swelling in a broken toe, elevate the foot, ice the injury, and stay off the foot. 2)Depending on the severity of the fracture, the toe may need to be put back into place (reduced), and some compound toe fractures may require surgery.3) Most broken toes heal without complications in six weeks."],
                "context_set": ""
                },

                {"tag": "Choking",
                "patterns": ["How do you treat Choking?", "what to do if i get a Choke?", "Which medicine to take if I get Choked?", "How to cure Choking?"],
                "responses": ["1)Encourage them to keep coughing to try to clear the blockage. 2)Ask them to try to spit out the object if it's in their mouth. 3)If coughing doesn't work, start back blows and Abdonominal thrusts"],
                "context_set": ""
                },

                {"tag": "Wound",
                "patterns": ["How do you treat a wound?", "what to do if i get a Wound?", "Which medicine to take if I get wounded?", "How to cure a wound?"],
                "responses": ["1)Rinse the cut or wound with water and apply pressure with sterile gauze, a bandage, or a clean cloth. 2)If blood soaks through the bandage, place another bandage on top of the first and keep applying pressure. 3)Raise the injured body part to slow bleeding. 4)When bleeding stops, cover the wound with a new, clean bandage."],
                "context_set": ""
                },

                {"tag": "Diarrhea",
                "patterns": ["How do you treat Diarrhea?", "what to do if i get Diarrhea?", "Which medicine to take if I get Diarrhea?", "How to cure Diarrhea?"],
                "responses": ["1)Hydrating the body is essential for recovering from diarrhea.This causes the body to lose electrolytes such as sodium and chloride. 2)It is highly recommended to avoid dairy products, as they may worsen diarrhea in some people. 3)However, if diarrhea lasts for more than 2 days, seek medical advice to avoid complications."],
                "context_set": ""
                },

                {
                "tag": "Baby Choking on Liquid",
                "patterns": ["What to do if a baby chokes on milk?", "First aid for a baby choking on liquid?", "Handling choking in infants?", "Emergency response for baby choking on liquid?", "How to clear a choking baby’s airway?"],
                "responses": ["If a baby is choking on liquid, immediately hold the baby in a head-down position on your forearm, supported by your thigh. Give up to 5 gentle back blows between the baby's shoulder blades using the heel of your hand. If the liquid does not dislodge, turn the baby face-up and give up to 5 chest thrusts. Repeat until the airway is clear or emergency services arrive."],
                "context_set": ""
              },
              {
                "tag": "Infant CPR",
                "patterns": ["How to perform CPR on an infant?", "CPR steps for babies?", "Emergency CPR for infants?", "First aid CPR for a non-breathing baby?", "Life-saving CPR technique for infants?"],
                "responses": ["If an infant is unresponsive and not breathing, call for help, then start CPR. Place 2 fingers on the sternum just below the nipple line. Compress the chest about 1.5 inches deep at a rate of 100-120 compressions per minute. After every 30 compressions, give 2 gentle rescue breaths by covering the baby’s mouth and nose with your mouth and blowing softly."],
                "context_set": ""
              },
              {
                "tag": "Febrile Seizure in Babies",
                "patterns": ["Managing febrile seizure in infants?", "What to do during a baby's febrile seizure?", "First aid for febrile seizure in babies?", "How to help a baby with a febrile seizure?", "Immediate steps for infant febrile seizure?"],
                "responses": ["If a baby has a febrile seizure, keep them safe by placing them on a soft surface, such as a carpeted floor. Remove any hard objects from the area. Do not restrain the baby or put anything in their mouth. After the seizure, lay the baby on their side to keep the airway open. Cool the baby by removing excess clothing and use a lukewarm sponge bath. Seek medical help immediately."],
                "context_set": ""
              },
              {
                "tag": "Burns from Hot Liquids",
                "patterns": ["First aid for burns from hot liquids on a baby?", "Treating a baby’s hot liquid burn?", "Emergency care for infant scalds?", "How to treat a scald on a baby?", "Immediate steps for baby burns from liquids?"],
                "responses": ["If a baby gets burned by a hot liquid, immediately cool the burn under lukewarm running water for at least 10 minutes. Do not use ice. Remove any clothing from the burned area carefully. Cover the burn loosely with a sterile gauze or a clean cloth. Avoid applying creams or ointments. Seek medical attention immediately after initial first aid."],
                "context_set": ""
              },
              {
                "tag": "Nasal Congestion in Babies",
                "patterns": ["Clearing nasal congestion in babies?", "First aid for baby nasal congestion?", "How to relieve a congested infant?", "Treating stuffy nose in infants?", "Home remedies for infant nasal congestion?"],
                "responses": ["To relieve nasal congestion in a baby, use saline drops and a bulb syringe to gently suction mucus from the nose. Position the baby with their head slightly elevated. Use a cool-mist humidifier in the baby’s room to keep the air moist. Consult a pediatrician if the congestion persists or is accompanied by fever or difficulty breathing."],
                "context_set": ""
              },
              {
                "tag": "Bee Sting on Babies",
                "patterns": ["First aid for bee sting on a baby?", "What to do if a baby gets stung by a bee?", "Handling bee stings in infants?", "Emergency steps for bee sting on infants?", "How to treat a baby’s bee sting?"],
                "responses": ["If a baby is stung by a bee, first, gently scrape away the stinger with a credit card or your fingernail. Do not use tweezers as it may squeeze more venom into the skin. Wash the area with soap and water and apply a cold compress to reduce swelling. Watch for signs of an allergic reaction such as difficulty breathing, swelling of the face or lips, or hives. If these symptoms occur, call emergency services immediately."],
                "context_set": ""
              },
              {
                "tag": "Diaper Rash",
                "patterns": ["Treating diaper rash in babies?", "First aid for severe diaper rash?", "Home treatment for infant diaper rash?", "How to alleviate diaper rash discomfort?", "Effective remedies for baby diaper rash?"],
                "responses": ["To treat diaper rash, change the baby’s diaper frequently and clean the area gently with water and a soft cloth. Allow the skin to air dry fully before putting on a new diaper. Apply a zinc oxide diaper cream to protect the skin. If the rash is severe, has blisters, or does not improve within a few days, consult a pediatrician."],
                "context_set": ""
              },
              {
                "tag": "Foreign Object Ingestion by Babies",
                "patterns": ["What to do if a baby swallows a foreign object?", "First aid for infant ingesting non-food item?", "Handling swallowed objects in babies?", "Emergency response for infant ingestion?", "Immediate care for babies swallowing objects?"],
                "responses": ["If you suspect that a baby has swallowed a foreign object, monitor them closely for signs of distress or choking. Do not attempt to induce vomiting. Look for coughing, wheezing, or difficulty breathing. If any of these signs occur, seek emergency medical attention immediately. Keep the baby calm and do not give them anything to eat or drink until evaluated by a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Infant Sunburn",
                "patterns": ["First aid for sunburn on a baby?", "Treating sunburn in infants?", "How to care for a baby’s sunburn?", "Immediate steps for infant sunburn care?", "Emergency treatment for baby sunburn?"],
                "responses": ["If a baby gets sunburned, move them out of the sun immediately. Cool the affected skin with a damp cloth. Apply aloe vera or a moisturizing lotion to soothe the skin if it doesn't irritate further. Keep the baby hydrated and dressed in loose, comfortable clothing. If the sunburn causes blisters, fever, or lethargy, seek medical attention immediately."],
                "context_set": ""
              },
              {
                "tag": "Milk Allergy Reaction in Babies",
                "patterns": ["How to identify milk allergy in babies?", "First aid for milk allergy in infants?", "What to do if baby has allergic reaction to milk?", "Immediate steps for infant milk allergy?", "Managing milk allergy symptoms in babies?"],
                "responses": ["If a baby shows signs of a milk allergy reaction, such as hives, eczema, vomiting, diarrhea, or wheezing, remove any milk or dairy products immediately. Administer antihistamines if prescribed. Monitor for any signs of anaphylaxis, including difficulty breathing or swelling of the face and lips. If these severe symptoms occur, use an epinephrine auto-injector if available and call emergency services immediately."],
                "context_set": ""
              },

              {
                "tag": "Pulled Muscle",
                "patterns": ["How do you treat a Pulled Muscle?", "what to do if my muscle is pulled?", "Which medicine to take if I got pulled muscle?", "How to cure a pulled muscle?"],
                "responses": ["For a pulled muscle, immediately rest the affected muscle and apply ice to reduce swelling for the first 48-72 hours. Apply ice for 20 minutes every hour as needed. After the initial period, switch to heat to help relax and loosen tissues and stimulate blood flow to the area. Use an elastic bandage to compress the muscle if there is swelling. Elevate the affected limb higher than your heart to help reduce swelling. Over-the-counter pain relievers such as ibuprofen or acetaminophen can help reduce pain and inflammation. If the muscle injury is severe or does not improve within a few days, consult a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Rectal bleeding",
                "patterns": ["How do you treat Rectal Bleeding?", "what to do if i get a Rectal Bleeding?", "Which medicine to take if I get Rectal Bleeding?", "How to cure Rectal Bleeding?"],
                "responses": ["Rectal bleeding can be a sign of something serious and should always be evaluated by a healthcare provider. While waiting for your appointment, avoid using nonsteroidal anti-inflammatory drugs (NSAIDs) and aspirin as they can increase bleeding. Instead, increase your fiber intake to help soften stools and reduce straining during bowel movements. Drink plenty of water. If you experience significant bleeding, dizziness, fainting, or pain, seek immediate medical attention."],
                "context_set": ""
              },
              {
                "tag": "Sun Burn",
                "patterns": ["How do you treat Sun Burn?", "what to do if i get a Sun Burn?", "Which medicine to take if I get Sun Burn?", "How to cure a Sun Burn?"],
                "responses": ["To treat sunburn, begin by getting out of the sun and cooling the skin with moist compresses or a cool shower. Apply aloe vera or a soothing lotion to the affected area. Stay hydrated by drinking plenty of fluids. Over-the-counter pain relief can be taken if needed. If the sunburn covers a large area, forms blisters, or is accompanied by symptoms such as fever, chills, or nausea, seek medical attention."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain",
                "patterns": ["How do you treat Testicle Pain?", "what to do if i get a Testicle Pain?", "Which medicine to take if I get a Testicle Pain?", "How to cure Testicle Pain?"],
                "responses": ["Testicle pain should be assessed by a healthcare provider immediately, especially if the pain is severe or sudden. At home, you can ease discomfort by supporting the testicles with an athletic supporter and applying ice packs wrapped in a cloth to the area. Over-the-counter pain relievers like ibuprofen can help reduce pain and swelling. Avoid any activities that could worsen the pain. Seek emergency medical treatment if the pain is associated with nausea, fever, or abdominal pain."],
                "context_set": ""
              },
              {
                "tag": "Vertigo",
                "patterns": ["How do you treat a Vertigo?", "what to do if i get a Vertigo?", "Which medicine to take if I get Vertigo?", "How to cure a Vertigo?"],
                "responses": ["Vertigo can often be treated at home with simple exercises like the Epley maneuver. However, if vertigo is new, severe, or associated with other symptoms like double vision, hearing loss, trouble speaking, coordination problems, or severe headaches, seek medical attention immediately. For mild vertigo, it's helpful to sit still in a quiet, dark room to lessen the spinning feeling. Avoid sudden movements and try to keep your head still."],
                "context_set": ""
              },
              {
                "tag": "Normal Bleeding",
                "patterns": ["How do you treat bleeding?", "what to do if i get a Bleeding?", "Which medicine to take if I get bleeding?", "How to cure Bleeding?"],
                "responses": ["To treat normal bleeding from small cuts or abrasions, first wash your hands to avoid infection and then gently clean the wound under running water. Dry the area and apply an antiseptic if available. Cover the wound with a sterile bandage. Apply pressure if the bleeding does not stop. If bleeding is severe, keep applying pressure and raise the injured area above the heart if possible. Seek immediate medical attention if the bleeding does not stop or if the wound is deep or large."],
                "context_set": ""
              },

              {
                "tag": "Eye Injury",
                "patterns": ["How do you treat an eye Injury?", "what to do if i get a eye Injury?", "Which medicine to take if I injured my eye?", "How to cure injured eye?"],
                "responses": ["For eye injuries, do not try to treat severe injuries yourself. Avoid touching, rubbing, or applying pressure to the eye. Do not attempt to remove objects stuck in the eye or wash out the eye for chemical exposures or punctures. Cover the eye with a sterile dressing that does not make contact with the eye itself. Seek immediate medical attention, especially if the injury involves chemicals, sharp objects, or forceful impact."],
                "context_set": ""
              },
            
              {
                "tag": "Chemical Burn",
                "patterns": ["How do you treat a chemical burn?", "what to do if i get a Chemical Burn?", "Which medicine to take if I get burn due to chemicals?", "How to cure Chemical Burn?"],
                "responses": ["Immediately remove any clothing or items contaminated by the chemical. Flush the affected area with cool running water for at least 20 minutes to remove the chemical. Do not apply any creams, ointments, or other remedies to the burn. After rinsing, lightly cover the burn with a sterile gauze or clean cloth. Seek professional medical treatment immediately to assess the extent of the burn and to receive further treatment."],
                "context_set": ""
              },
            
              {
                "tag": "Poison",
                "patterns": ["How do you treat a Poison?", "what to do if i get Poison?", "Which medicine to take if I am poisoned?", "How to cure Poisoning?"],
                "responses": ["If you suspect poisoning, do not wait for symptoms to appear. Call emergency services or a poison control center immediately. Do not attempt to induce vomiting or give any remedies unless directed by a medical professional. Provide as much information as possible about the poison to the healthcare provider, including what was ingested, how much, and when. Keep the victim calm and follow all instructions given by medical personnel."],
                "context_set": ""
              },
            
              {
                "tag": "Teeth",
                "patterns": ["How do you treat broken Teeth ?", "what to do if my Teeth got broken?", "Which medicine to take if I get broken teeth?", "cure broken teeth?"],
                "responses": ["For broken teeth, rinse your mouth with warm water to clean the area. Apply a cold compress to the outside of the mouth, cheek, or lip near the broken tooth to reduce swelling and relieve pain. If possible, retrieve any broken tooth fragments, keep them moist, and bring them to a dentist immediately. Visit a dentist as soon as possible."],
                "context_set": ""
              },
            
              {
                "tag": "seizure",
                "patterns": ["How do you treat a seizure?", "what to do if i get a seizure?", "Which medicine to take if I get seizure?", "How to cure seizure?"],
                "responses": ["During a seizure, keep the person safe by moving away any hard or sharp objects. Cushion their head and gently place them on their side to help keep their airway clear. Do not attempt to restrain them or put anything in their mouth. Monitor the duration of the seizure and any characteristics to report to medical personnel. After the seizure, provide comfort and reassurance as the person gains full awareness. Seek medical advice if the seizure lasts more than five minutes, repeats without full recovery, or if the person is injured, pregnant, or diabetic."],
                "context_set": ""
              },
            
              {
                "tag": "Head Injury",
                "patterns": ["How do you treat a head Injury?", "what to do if i get a Head Injury?", "Which medicine to take if I get injured in the head?", "How to cure Head Injury?"],
                "responses": ["For a head injury, if the person is conscious, keep them still and calm. Monitor their condition closely, checking for any signs of confusion, drowsiness, vomiting, or changes in their behavior. Avoid giving them any medications such as ibuprofen or aspirin, which could increase bleeding. If the person is unconscious, apply gentle pressure if there is bleeding but do not move them unless necessary. Call emergency services immediately for severe head injuries, if the person loses consciousness, or if there are signs of a severe concussion."],
                "context_set": ""
              },
            
              {
                "tag": "Fainting",
                "patterns": ["How do you treat Faint?", "what to do if i feel like Fainting?", "Which medicine to take if I get a Faint?", "How to cure Fainting?"],
                "responses": ["If someone feels like they might faint, have them sit or lie down and lower their head between their knees if sitting. If someone has fainted, lay them flat on their back and elevate their legs to increase blood flow to the brain. Loosen any constrictive clothing and ensure they have plenty of fresh air. Monitor their condition and check for breathing. If they do not wake up quickly, start CPR if trained and call for emergency help immediately."],
                "context_set": ""
              }, 

                {"tag": "Headache",
                "patterns": ["How do you treat a mild Headache?", "what to do if i get a mild Headache?", "Which medicine to take if I have a mild headache?", "How to cure a mild headache?"],
                "responses": ["Give ibuprofen (Advil, Motrin), aspirin, or acetaminophen (Tylenol) for pain. Avoid ibuprofen and other NSAIDs if the person has heart failure or kidney failure. Do not give aspirin to a child under age 18."],
                "context_set": ""
                },

                {"tag": "Cold",
                "patterns": ["How do you treat a Cold?", "what to do if i get a mild Cold?", "Which medicine to take if I have a Cold?", "How to cure Cold?"],
                "responses": ["1)Keeping hydrated is absolutely vital to help 'flush' out the cold, as well as to break down congestion and keep your throat lubricated. 2)Vitamin C is extremely helpful when fighting infection, so at the first sign of a cold be sure to increase your intake by eating plenty of berries, citrus fruits, papayas, broccoli and red peppers which will help keep you protected. 3)When it comes to combating a cold,Vitamin D is essential in helping to regulate immune response."],
                "context_set": ""
                },
                
                {"tag": "Rash",
                "patterns": ["How do you treat Rashes?", "what to do if i get a Rash?", "Which medicine to take if I have a Rash?", "How to cure Rash?"],
                "responses": ["1)Olive oil helps in healing and promotes skin renewal given it is packed with vitamin E and antioxidants. It also soothes the skin and reduces itching. 2)Baking soda is useful in drying skin rashes as also in relieving itching and inflammation. 3)Aloe Vera,Thanks to its antibacterial, antifungal, anti-inflammatory and emollient properties, aloe vera is excellent for treating a number of skin ailments including rashes as also soothing the skin."],
                "context_set": ""
                },
                
                {"tag": "snake bite",
                "patterns": ["How do you treat a snake bite?", "what to do if i get a snake bite?", "Which medicine to take if I get a snake bite?", "How to cure snake bite?", "i got bit by a snake"],
                "responses": ["While waiting for medical help: 1)Move the person beyond striking distance of the snake. 2)Have the person lie down with wound below the heart. 3)Keep the person calm and at rest, remaining as still as possible to keep venom from spreading. 4)Cover the wound with loose, sterile bandage. 5)Remove any jewelry from the area that was bitten. 6)Remove shoes if the leg or foot was bitten."],
                "context_set": ""
                },

                {"tag": "animal bite",
                "patterns": ["How do you treat a animal bite?", "How do you treat a monkey bite?","How do you treat a dog bite?", "what to do if i get a animal bite?", "Which medicine to take if I get a monekey bite?", "How to cure dog bite?", "i got bit by a dog"],
                "responses": ["1)Wash the wound with soap and warm water. 2)Gently press a clean cloth over the wound to stop the flow of blood. 3)Apply an antibacterial ointment to the wound. 4)Cover with a sterile bandage. 5)Watch for signs of infection. 6)Seek help if you suspect infection or possible exposure to rabies, or if the wound is severe."],
                "context_set": ""
                },

                {"tag": "Drowning",
                "patterns": ["What to do if someone is Drowning?", "what to do if someone drowned?", "What steps to take if i see a drowning person?", "How to help a drowning person?"],
                "responses": ["1)Place your ear next to the person's mouth and nose. Do you feel air on your cheek? 2)Look to see if the person's chest is moving.If the Person is Not Breathing, Check Pulse. 3)Check the person's pulse for 10 seconds.If There is No Pulse, Start CPR."],
                "context_set": ""
                },

        {"tag": "CPR",
                "patterns": ["How to give CPR??", "what to do in a CPR?", "What steps to take in a CPR??", "How to help a drowning person in CPR?"],
                "responses": ["1)For an adult or child, place the heel of one hand on the center of the chest at the nipple line. You can also push with one hand on top of the other. For an infant, place two fingers on the breastbone. 2)For an adult or child, press down at least 2 inches. Make sure not to press on ribs. For an infant, press down about 1 and 1/2 inches. Make sure not to press on the end of the breastbone. 3)Do chest compressions only, at the rate of 100-120 per minute or more. Let the chest rise completely between pushes. 4)Check to see if the person has started breathing."],
                "context_set": ""
                },  
        
                {
                  "tag": "Frost bite",
                  "patterns": ["What should I do if I have frostbite?", "How to treat frostbitten fingers?", "Emergency treatment for frostbite?", "Signs of frostbite treatment?", "First aid for frostbite?"],
                  "responses": ["To treat frostbite, get into a warm room as soon as possible and immerse the affected area in warm (not hot) water, or warm the affected area using body heat. Do not use a heating pad, heat lamp, or the heat of a stove, fireplace, or radiator for warming. Do not rub or massage the frostbitten area or break blisters."],
                  "context_set": ""
                },
                {
                  "tag": "Heat Exhaustion",
                  "patterns": ["Signs of heat exhaustion?", "How to deal with heat exhaustion?", "Preventing heat exhaustion?", "Treatment for heat exhaustion?", "What to do if someone has heat exhaustion?"],
                  "responses": ["Treat heat exhaustion by first moving to a cooler place and lying down. Drink cool water or sports drinks, and take a cool shower or use cold compresses. If symptoms worsen or last longer than one hour, seek medical attention immediately."],
                  "context_set": ""
                },
                {
                  "tag": "Heat Stroke",
                  "patterns": ["Immediate action for heat stroke?", "How to help someone with heat stroke?", "Emergency response for heat stroke?", "Signs and treatment of heat stroke?", "What should I do if I suspect heat stroke?"],
                  "responses": ["Heat stroke requires emergency treatment. Call emergency services right away. While waiting for help, move the person to a cooler place, remove excess clothing, and cool them with whatever means available, e.g., a cool bath or by sponging with cool water."],
                  "context_set": ""
                },
                {
                  "tag": "Insect Bites",
                  "patterns": ["How to treat insect bites?", "First aid for a mosquito bite?", "Dealing with bee stings?", "What to do for an ant bite?", "Remedies for insect bites?"],
                  "responses": ["For insect bites, wash the area with soap and water, apply a cold pack to reduce swelling, and avoid scratching to prevent infection. For stings, remove the stinger by scraping over it with a blunt side of a knife or a credit card and then follow the same care steps."],
                  "context_set": ""
                },
                {
                  "tag": "nose bleed",
                  "patterns": ["Steps to stop a nosebleed?", "First aid for nose bleeding?", "How to handle a severe nosebleed?", "What to do if my nose starts bleeding?", "Quick fixes for a nosebleed?"],
                  "responses": ["To stop a nosebleed, sit upright and lean forward. Using your thumb and index finger, firmly pinch the soft part of your nose and hold it for 10 minutes. Breathe through your mouth during this time and avoid lying down or tilting your head back."],
                  "context_set": ""
                },
                {
                  "tag": "Pulled Muscle",
                  "patterns": ["Treatment for a pulled muscle?", "How to handle muscle strain?", "First aid for muscle pull?", "What to do if I pull a muscle?", "Managing a muscle strain at home?"],
                  "responses": ["For a pulled muscle, rest the affected muscle and apply ice for the first 24-48 hours in 20-minute intervals. Wrap the muscle in a compression bandage and elevate it to reduce swelling. Avoid using the muscle strenuously and consider OTC pain relief if necessary."],
                  "context_set": ""
                },
                {
                  "tag": "Rectal bleeding",
                  "patterns": ["What causes rectal bleeding?", "How to manage rectal bleeding?", "First aid for rectal bleeding?", "Should I see a doctor for rectal bleeding?", "Home care for rectal bleeding?"],
                  "responses": ["Rectal bleeding can be a sign of a serious condition and should be evaluated by a doctor. For mild cases, ensure proper hygiene and use topical over-the-counter treatments to ease symptoms. Avoid straining during bowel movements and increase fiber intake."],
                  "context_set": ""
                },
                {
                  "tag": "Sun Burn",
                  "patterns": ["How to treat sunburn?", "Immediate relief for sunburn?", "First aid tips for sunburn?", "What helps with sunburn pain?", "Best way to handle sunburn?"],
                  "responses": ["For sunburn, apply aloe vera or over-the-counter moisturizing lotion to soothe the skin. Take a cool bath or apply cold, wet towels. Stay hydrated and if the sunburn is severe with blisters, seek medical attention. Avoid further sun exposure while healing."],
                  "context_set": ""
                },
                {
                  "tag": "Testicle Pain",
                  "patterns": ["What causes testicle pain?", "First aid for testicular pain?", "How to relieve testicle pain?", "Immediate care for testicular injury?", "When to seek help for testicle pain?"],
                  "responses": ["Testicle pain can be due to various causes including injuries, infections, or medical conditions like epididymitis. Rest and support the scrotum using a folded towel, apply ice packs to reduce swelling, and take over-the-counter pain relievers. Seek immediate medical attention if the pain is severe or sudden."],
                  "context_set": ""
                },
                {
                  "tag": "Vertigo",
                  "patterns": ["How to manage vertigo at home?", "First aid for vertigo?", "What to do if I feel dizzy?", "Home remedies for vertigo?", "Dealing with sudden vertigo?"],
                  "responses": ["For vertigo, sit or lie down immediately when you feel dizzy. Move slowly and change positions cautiously. If lying down, elevate your head slightly. Stay hydrated and avoid bright lights or sudden movements. If symptoms persist, consult a healthcare professional."],
                  "context_set": ""
                },
              
              

                { 
                "tag": "Fracture",
                "patterns": ["How do you treat a Fracture?", "what to do if i get a Fracture?", "Which medicine to take if I have a Fracture?", "How to cure a Fracture?"],
                "responses": ["1)Stop any bleeding. Apply pressure to the wound with a sterile bandage, a clean cloth or a clean piece of clothing. 2)Immobilize the injured area. Don't try to realign the bone or push a bone that's sticking out back in. If you've been trained in how to splint and professional help isn't readily available, apply a splint to the area above and below the fracture sites. Padding the splints can help reduce discomfort. 3)Apply ice packs to limit swelling and help relieve pain. Don't apply ice directly to the skin. Wrap the ice in a towel, piece of cloth or some other material. 4)Treat for shock. If the person feels faint or is breathing in short, rapid breaths, lay the person down with the head slightly lower than the trunk and, if possible, elevate the legs."],
                "context_set": ""
                },  
                {
                "tag": "Severe Allergic Reaction",
                "patterns": ["What to do during an anaphylactic shock?", "Immediate action for severe allergic reaction?", "First aid for life-threatening allergy?", "Handling severe allergic reactions?", "Emergency response for anaphylaxis?"],
                "responses": ["Anaphylaxis is a severe allergic reaction that requires immediate medical attention. Administer an epinephrine auto-injector if available, and call emergency services right away. Keep the person lying still on their back, cover them with a blanket, and elevate their legs if possible. Do not give them anything to drink and stay with them until medical help arrives."],
                "context_set": ""
              },
              {
                "tag": "Heart Attack",
                "patterns": ["Signs of a heart attack?", "What to do if someone is having a heart attack?", "First aid for heart attack?", "Emergency steps for heart attack?", "How to respond to a heart attack?"],
                "responses": ["If you suspect someone is having a heart attack, call emergency services immediately. Have the person sit down, rest, and try to stay calm. Loosen any tight clothing and ask if they take any chest pain medication for a known heart condition and help them take it. If the person is unconscious, begin CPR immediately and continue until help arrives."],
                "context_set": ""
              },
              {
                "tag": "Stroke",
                "patterns": ["How to identify a stroke?", "Immediate response to a stroke?", "First aid for stroke victims?", "What actions to take during a stroke?", "Emergency care for stroke?"],
                "responses": ["Recognize signs of a stroke using the FAST method: Face drooping, Arm weakness, Speech difficulties, Time to call emergency services. Immediately dial emergency services if you notice any of these signs. Do not give the person anything to eat or drink. Monitor their condition closely and prepare to perform CPR if necessary until emergency responders arrive."],
                "context_set": ""
              },
              {
                "tag": "Major Trauma",
                "patterns": ["First aid for major trauma?", "What to do if someone is severely injured?", "Handling serious physical injuries?", "Emergency steps for traumatic injuries?", "Immediate care for a major accident?"],
                "responses": ["For major trauma, immediately call emergency services. Do not move the person unless they are in immediate danger. If there is bleeding, apply firm pressure to the wound with a clean cloth. Avoid giving anything to eat or drink and do not attempt to treat severe injuries yourself. Cover them with a blanket to maintain body heat and monitor their vital signs until help arrives."],
                "context_set": ""
              },
              {
                "tag": "Severe Burns",
                "patterns": ["How to treat third-degree burns?", "Immediate action for severe burns?", "First aid for critical burns?", "What to do for large area burns?", "Emergency treatment for severe burns?"],
                "responses": ["Do not attempt to treat severe burns yourself. Cover the burn with a clean, dry cloth to prevent contamination. Avoid applying cold water as it can worsen the injury. Do not apply creams, ointments, or ice. Call emergency services immediately. Treat for shock if necessary and monitor breathing and circulation until medical help arrives."],
                "context_set": ""
              }, 
              {
                "tag": "Child Choking",
                "patterns": ["What to do if a child is choking?", "Choking first aid for children?", "How to help a choking child?", "Emergency steps for child choking?", "Child choking treatment?"],
                "responses": ["If a child is choking, ask them to cough to try to clear the object. If coughing doesn’t work, perform back blows and chest thrusts. For a child, lean them forward and give 5 firm back blows with the heel of your hand. If unsuccessful, perform 5 chest thrusts. Repeat until the object is dislodged or the child can breathe or cough. Call emergency services if the blockage does not clear."],
                "context_set": ""
              },
              {
                "tag": "Febrile Seizures in Children",
                "patterns": ["How to handle febrile seizures in children?", "First aid for febrile seizure?", "What to do during a child's febrile seizure?", "Febrile seizure treatment?", "Emergency care for febrile seizures?"],
                "responses": ["During a febrile seizure, keep the child safe from injury. Place them on the ground in a safe area, remove nearby objects, and cushion their head. Do not restrain them or put anything in their mouth. Once the seizure ends, keep the child on their side to maintain an open airway. Check for fever; if present, seek medical advice promptly."],
                "context_set": ""
              },
              {
                "tag": "Asthma Attack in Children",
                "patterns": ["First aid for child asthma attack?", "How to help a child having an asthma attack?", "Child asthma emergency steps?", "What to do if a child has an asthma flare-up?", "Managing asthma symptoms in children?"],
                "responses": ["If a child is having an asthma attack, help them into a comfortable sitting position and reassure them to stay calm. Assist them with their prescribed rescue inhaler according to their asthma action plan. Give 1 puff every 30-60 seconds for up to 10 puffs. If symptoms persist more than a few minutes, or if the child is distressed, call emergency services immediately."],
                "context_set": ""
              },
              {
                "tag": "Minor Cuts and Scrapes in Children",
                "patterns": ["Treating cuts and scrapes in children?", "First aid for child’s minor wound?", "How to treat a child’s scrape at home?", "Care tips for minor cuts on children?", "Handling minor wounds in kids?"],
                "responses": ["Clean the wound gently with water and mild soap to remove dirt. Apply gentle pressure with a clean cloth if there is bleeding. Once bleeding stops, dry the area and apply an antibiotic ointment to prevent infection. Cover the wound with a sterile bandage. Watch for signs of infection like increased redness, swelling, or pain."],
                "context_set": ""
              },
              {
                "tag": "Concussion in Children",
                "patterns": ["What to do if a child hits their head?", "First aid for concussion in children?", "Symptoms of concussion in a child?", "How to treat a child’s head injury?", "Immediate steps for child concussion?"],
                "responses": ["If a child sustains a head injury and shows signs of a concussion (confusion, dizziness, headache, nausea), seek medical attention immediately. Until help arrives, keep the child lying down and still with their head and shoulders slightly elevated. Avoid moving the child unless necessary and monitor their condition continuously."],
                "context_set": ""
              },
              {
                "tag": "Dehydration in Children",
                "patterns": ["How to treat dehydration in children?", "Recognizing dehydration in kids?", "First aid for a dehydrated child?", "What to give a dehydrated child?", "Managing mild dehydration at home?"],
                "responses": ["For mild dehydration in children, provide small sips of water or an oral rehydration solution every few minutes. Avoid giving sugary or caffeinated drinks. Encourage the child to drink small amounts frequently to slowly replenish fluids. If symptoms of dehydration persist or worsen, such as reduced urination, dry mouth, or lethargy, seek medical attention immediately."],
                "context_set": ""
              },
              {
                "tag": "Allergic Reactions in Children",
                "patterns": ["How to manage allergic reactions in children?", "First aid for child allergic reaction?", "Emergency care for children with allergies?", "What to do if a child has an allergic reaction?", "Immediate steps for allergy in kids?"],
                "responses": ["If a child has a known severe allergy and experiences symptoms like swelling of the face, difficulty breathing, or hives, use an epinephrine auto-injector if available and call emergency services immediately. Keep the child calm and lying down with legs raised to maintain blood flow if they feel faint. Monitor their condition until help arrives."],
                "context_set": ""
              },
              {
                "tag": "Insect Stings in Children",
                "patterns": ["First aid for insect stings on children?", "How to treat a bee sting in a child?", "Child got stung by an insect, what to do?", "Managing insect bites and stings in kids?", "Emergency response to insect stings in children?"],
                "responses": ["Remove the stinger by scraping it out with a credit card or your fingernail, if visible. Wash the area with soap and water. Apply a cold pack to reduce swelling and pain. If symptoms of a severe allergic reaction occur, such as difficulty breathing or swelling of the lips or eyelids, administer an epinephrine auto-injector if available and call emergency services immediately."],
                "context_set": ""
              },
              {
                "tag": "Bicycle Accident Injuries in Children",
                "patterns": ["What to do if a child falls off a bike?", "First aid for bicycle crash injuries?", "Handling bike injuries in kids?", "Child injured in a bike accident, how to respond?", "Immediate care for bike injuries in children?"],
                "responses": ["If a child is injured in a bicycle accident, ensure their safety by moving them away from further harm. Check for consciousness and call emergency services if the child is unresponsive, has difficulty breathing, or has severe injuries. For minor injuries, clean and dress wounds. Keep the child calm and still until help arrives or until you can assess the severity of injuries."],
                "context_set": ""
              },
              {
                "tag": "Burns from Hot Objects in Children",
                "patterns": ["First aid for burns in children?", "What to do if a child touches a hot object?", "Treating a child’s burn at home?", "Care for thermal burns in kids?", "Emergency steps for burns in children?"],
                "responses": ["For minor burns, cool the burn under running cool water for several minutes. Do not use ice. After cooling, cover the burn with a sterile, non-adhesive bandage or clean cloth. Avoid applying creams, ointments, or butter. For more serious burns, especially those covering a large area or involving the face, hands, or genitals, seek medical attention immediately."],
                "context_set": ""
              }, 
              {
                "tag": "Baby Choking on Liquid",
                "patterns": ["What to do if a baby chokes on milk?", "First aid for a baby choking on liquid?", "Handling choking in infants?", "Emergency response for baby choking on liquid?", "How to clear a choking baby’s airway?"],
                "responses": ["If a baby is choking on liquid, immediately hold the baby in a head-down position on your forearm, supported by your thigh. Give up to 5 gentle back blows between the baby's shoulder blades using the heel of your hand. If the liquid does not dislodge, turn the baby face-up and give up to 5 chest thrusts. Repeat until the airway is clear or emergency services arrive."],
                "context_set": ""
              },
              {
                "tag": "Infant CPR",
                "patterns": ["How to perform CPR on an infant?", "CPR steps for babies?", "Emergency CPR for infants?", "First aid CPR for a non-breathing baby?", "Life-saving CPR technique for infants?"],
                "responses": ["If an infant is unresponsive and not breathing, call for help, then start CPR. Place 2 fingers on the sternum just below the nipple line. Compress the chest about 1.5 inches deep at a rate of 100-120 compressions per minute. After every 30 compressions, give 2 gentle rescue breaths by covering the baby’s mouth and nose with your mouth and blowing softly."],
                "context_set": ""
              },
              {
                "tag": "Febrile Seizure in Babies",
                "patterns": ["Managing febrile seizure in infants?", "What to do during a baby's febrile seizure?", "First aid for febrile seizure in babies?", "How to help a baby with a febrile seizure?", "Immediate steps for infant febrile seizure?"],
                "responses": ["If a baby has a febrile seizure, keep them safe by placing them on a soft surface, such as a carpeted floor. Remove any hard objects from the area. Do not restrain the baby or put anything in their mouth. After the seizure, lay the baby on their side to keep the airway open. Cool the baby by removing excess clothing and use a lukewarm sponge bath. Seek medical help immediately."],
                "context_set": ""
              },
              {
                "tag": "Burns from Hot Liquids",
                "patterns": ["First aid for burns from hot liquids on a baby?", "Treating a baby’s hot liquid burn?", "Emergency care for infant scalds?", "How to treat a scald on a baby?", "Immediate steps for baby burns from liquids?"],
                "responses": ["If a baby gets burned by a hot liquid, immediately cool the burn under lukewarm running water for at least 10 minutes. Do not use ice. Remove any clothing from the burned area carefully. Cover the burn loosely with a sterile gauze or a clean cloth. Avoid applying creams or ointments. Seek medical attention immediately after initial first aid."],
                "context_set": ""
              },
              {
                "tag": "Nasal Congestion in Babies",
                "patterns": ["Clearing nasal congestion in babies?", "First aid for baby nasal congestion?", "How to relieve a congested infant?", "Treating stuffy nose in infants?", "Home remedies for infant nasal congestion?"],
                "responses": ["To relieve nasal congestion in a baby, use saline drops and a bulb syringe to gently suction mucus from the nose. Position the baby with their head slightly elevated. Use a cool-mist humidifier in the baby’s room to keep the air moist. Consult a pediatrician if the congestion persists or is accompanied by fever or difficulty breathing."],
                "context_set": ""
              },
              {
                "tag": "Bee Sting on Babies",
                "patterns": ["First aid for bee sting on a baby?", "What to do if a baby gets stung by a bee?", "Handling bee stings in infants?", "Emergency steps for bee sting on infants?", "How to treat a baby’s bee sting?"],
                "responses": ["If a baby is stung by a bee, first, gently scrape away the stinger with a credit card or your fingernail. Do not use tweezers as it may squeeze more venom into the skin. Wash the area with soap and water and apply a cold compress to reduce swelling. Watch for signs of an allergic reaction such as difficulty breathing, swelling of the face or lips, or hives. If these symptoms occur, call emergency services immediately."],
                "context_set": ""
              },
              {
                "tag": "Diaper Rash",
                "patterns": ["Treating diaper rash in babies?", "First aid for severe diaper rash?", "Home treatment for infant diaper rash?", "How to alleviate diaper rash discomfort?", "Effective remedies for baby diaper rash?"],
                "responses": ["To treat diaper rash, change the baby’s diaper frequently and clean the area gently with water and a soft cloth. Allow the skin to air dry fully before putting on a new diaper. Apply a zinc oxide diaper cream to protect the skin. If the rash is severe, has blisters, or does not improve within a few days, consult a pediatrician."],
                "context_set": ""
              },
              {
                "tag": "Foreign Object Ingestion by Babies",
                "patterns": ["What to do if a baby swallows a foreign object?", "First aid for infant ingesting non-food item?", "Handling swallowed objects in babies?", "Emergency response for infant ingestion?", "Immediate care for babies swallowing objects?"],
                "responses": ["If you suspect that a baby has swallowed a foreign object, monitor them closely for signs of distress or choking. Do not attempt to induce vomiting. Look for coughing, wheezing, or difficulty breathing. If any of these signs occur, seek emergency medical attention immediately. Keep the baby calm and do not give them anything to eat or drink until evaluated by a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Infant Sunburn",
                "patterns": ["First aid for sunburn on a baby?", "Treating sunburn in infants?", "How to care for a baby’s sunburn?", "Immediate steps for infant sunburn care?", "Emergency treatment for baby sunburn?"],
                "responses": ["If a baby gets sunburned, move them out of the sun immediately. Cool the affected skin with a damp cloth. Apply aloe vera or a moisturizing lotion to soothe the skin if it doesn't irritate further. Keep the baby hydrated and dressed in loose, comfortable clothing. If the sunburn causes blisters, fever, or lethargy, seek medical attention immediately."],
                "context_set": ""
              },
              {
                "tag": "Milk Allergy Reaction in Babies",
                "patterns": ["How to identify milk allergy in babies?", "First aid for milk allergy in infants?", "What to do if baby has allergic reaction to milk?", "Immediate steps for infant milk allergy?", "Managing milk allergy symptoms in babies?"],
                "responses": ["If a baby shows signs of a milk allergy reaction, such as hives, eczema, vomiting, diarrhea, or wheezing, remove any milk or dairy products immediately. Administer antihistamines if prescribed. Monitor for any signs of anaphylaxis, including difficulty breathing or swelling of the face and lips. If these severe symptoms occur, use an epinephrine auto-injector if available and call emergency services immediately."],
                "context_set": ""
              }, 
              {
                "tag": "Baby Choking on Liquid",
                "patterns": ["What to do if a baby chokes on milk?", "First aid for a baby choking on liquid?", "Handling choking in infants?", "Emergency response for baby choking on liquid?", "How to clear a choking baby’s airway?"],
                "responses": ["If a baby is choking on liquid, immediately hold the baby in a head-down position on your forearm, supported by your thigh. Give up to 5 gentle back blows between the baby's shoulder blades using the heel of your hand. If the liquid does not dislodge, turn the baby face-up and give up to 5 chest thrusts. Repeat until the airway is clear or emergency services arrive."],
                "context_set": ""
              },
              {
                "tag": "Infant CPR",
                "patterns": ["How to perform CPR on an infant?", "CPR steps for babies?", "Emergency CPR for infants?", "First aid CPR for a non-breathing baby?", "Life-saving CPR technique for infants?"],
                "responses": ["If an infant is unresponsive and not breathing, call for help, then start CPR. Place 2 fingers on the sternum just below the nipple line. Compress the chest about 1.5 inches deep at a rate of 100-120 compressions per minute. After every 30 compressions, give 2 gentle rescue breaths by covering the baby’s mouth and nose with your mouth and blowing softly."],
                "context_set": ""
              },
              {
                "tag": "Febrile Seizure in Babies",
                "patterns": ["Managing febrile seizure in infants?", "What to do during a baby's febrile seizure?", "First aid for febrile seizure in babies?", "How to help a baby with a febrile seizure?", "Immediate steps for infant febrile seizure?"],
                "responses": ["If a baby has a febrile seizure, keep them safe by placing them on a soft surface, such as a carpeted floor. Remove any hard objects from the area. Do not restrain the baby or put anything in their mouth. After the seizure, lay the baby on their side to keep the airway open. Cool the baby by removing excess clothing and use a lukewarm sponge bath. Seek medical help immediately."],
                "context_set": ""
              },
              {
                "tag": "Burns from Hot Liquids",
                "patterns": ["First aid for burns from hot liquids on a baby?", "Treating a baby’s hot liquid burn?", "Emergency care for infant scalds?", "How to treat a scald on a baby?", "Immediate steps for baby burns from liquids?"],
                "responses": ["If a baby gets burned by a hot liquid, immediately cool the burn under lukewarm running water for at least 10 minutes. Do not use ice. Remove any clothing from the burned area carefully. Cover the burn loosely with a sterile gauze or a clean cloth. Avoid applying creams or ointments. Seek medical attention immediately after initial first aid."],
                "context_set": ""
              },
              {
                "tag": "Nasal Congestion in Babies",
                "patterns": ["Clearing nasal congestion in babies?", "First aid for baby nasal congestion?", "How to relieve a congested infant?", "Treating stuffy nose in infants?", "Home remedies for infant nasal congestion?"],
                "responses": ["To relieve nasal congestion in a baby, use saline drops and a bulb syringe to gently suction mucus from the nose. Position the baby with their head slightly elevated. Use a cool-mist humidifier in the baby’s room to keep the air moist. Consult a pediatrician if the congestion persists or is accompanied by fever or difficulty breathing."],
                "context_set": ""
              },
              {
                "tag": "Bee Sting on Babies",
                "patterns": ["First aid for bee sting on a baby?", "What to do if a baby gets stung by a bee?", "Handling bee stings in infants?", "Emergency steps for bee sting on infants?", "How to treat a baby’s bee sting?"],
                "responses": ["If a baby is stung by a bee, first, gently scrape away the stinger with a credit card or your fingernail. Do not use tweezers as it may squeeze more venom into the skin. Wash the area with soap and water and apply a cold compress to reduce swelling. Watch for signs of an allergic reaction such as difficulty breathing, swelling of the face or lips, or hives. If these symptoms occur, call emergency services immediately."],
                "context_set": ""
              },
              {
                "tag": "Diaper Rash",
                "patterns": ["Treating diaper rash in babies?", "First aid for severe diaper rash?", "Home treatment for infant diaper rash?", "How to alleviate diaper rash discomfort?", "Effective remedies for baby diaper rash?"],
                "responses": ["To treat diaper rash, change the baby’s diaper frequently and clean the area gently with water and a soft cloth. Allow the skin to air dry fully before putting on a new diaper. Apply a zinc oxide diaper cream to protect the skin. If the rash is severe, has blisters, or does not improve within a few days, consult a pediatrician."],
                "context_set": ""
              },
              {
                "tag": "Foreign Object Ingestion by Babies",
                "patterns": ["What to do if a baby swallows a foreign object?", "First aid for infant ingesting non-food item?", "Handling swallowed objects in babies?", "Emergency response for infant ingestion?", "Immediate care for babies swallowing objects?"],
                "responses": ["If you suspect that a baby has swallowed a foreign object, monitor them closely for signs of distress or choking. Do not attempt to induce vomiting. Look for coughing, wheezing, or difficulty breathing. If any of these signs occur, seek emergency medical attention immediately. Keep the baby calm and do not give them anything to eat or drink until evaluated by a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Infant Sunburn",
                "patterns": ["First aid for sunburn on a baby?", "Treating sunburn in infants?", "How to care for a baby’s sunburn?", "Immediate steps for infant sunburn care?", "Emergency treatment for baby sunburn?"],
                "responses": ["If a baby gets sunburned, move them out of the sun immediately. Cool the affected skin with a damp cloth. Apply aloe vera or a moisturizing lotion to soothe the skin if it doesn't irritate further. Keep the baby hydrated and dressed in loose, comfortable clothing. If the sunburn causes blisters, fever, or lethargy, seek medical attention immediately."],
                "context_set": ""
              },
              {
                "tag": "Milk Allergy Reaction in Babies",
                "patterns": ["How to identify milk allergy in babies?", "First aid for milk allergy in infants?", "What to do if baby has allergic reaction to milk?", "Immediate steps for infant milk allergy?", "Managing milk allergy symptoms in babies?"],
                "responses": ["If a baby shows signs of a milk allergy reaction, such as hives, eczema, vomiting, diarrhea, or wheezing, remove any milk or dairy products immediately. Administer antihistamines if prescribed. Monitor for any signs of anaphylaxis, including difficulty breathing or swelling of the face and lips. If these severe symptoms occur, use an epinephrine auto-injector if available and call emergency services immediately."],
                "context_set": ""
              },
              {
                "tag": "Baby Choking on Liquid",
                "patterns": ["What to do if a baby chokes on milk?", "First aid for a baby choking on liquid?", "Handling choking in infants?", "Emergency response for baby choking on liquid?", "How to clear a choking baby’s airway?"],
                "responses": ["If a baby is choking on liquid, immediately hold the baby in a head-down position on your forearm, supported by your thigh. Give up to 5 gentle back blows between the baby's shoulder blades using the heel of your hand. If the liquid does not dislodge, turn the baby face-up and give up to 5 chest thrusts. Repeat until the airway is clear or emergency services arrive."],
                "context_set": ""
              },
              {
                "tag": "Infant CPR",
                "patterns": ["How to perform CPR on an infant?", "CPR steps for babies?", "Emergency CPR for infants?", "First aid CPR for a non-breathing baby?", "Life-saving CPR technique for infants?"],
                "responses": ["If an infant is unresponsive and not breathing, call for help, then start CPR. Place 2 fingers on the sternum just below the nipple line. Compress the chest about 1.5 inches deep at a rate of 100-120 compressions per minute. After every 30 compressions, give 2 gentle rescue breaths by covering the baby’s mouth and nose with your mouth and blowing softly."],
                "context_set": ""
              },
              {
                "tag": "Febrile Seizure in Babies",
                "patterns": ["Managing febrile seizure in infants?", "What to do during a baby's febrile seizure?", "First aid for febrile seizure in babies?", "How to help a baby with a febrile seizure?", "Immediate steps for infant febrile seizure?"],
                "responses": ["If a baby has a febrile seizure, keep them safe by placing them on a soft surface, such as a carpeted floor. Remove any hard objects from the area. Do not restrain the baby or put anything in their mouth. After the seizure, lay the baby on their side to keep the airway open. Cool the baby by removing excess clothing and use a lukewarm sponge bath. Seek medical help immediately."],
                "context_set": ""
              },
              {
                "tag": "Baby Choking on Liquid",
                "patterns": ["What to do if a baby chokes on milk?", "First aid for a baby choking on liquid?", "Handling choking in infants?", "Emergency response for baby choking on liquid?", "How to clear a choking baby’s airway?"],
                "responses": ["If a baby is choking on liquid, immediately hold the baby in a head-down position on your forearm, supported by your thigh. Give up to 5 gentle back blows between the baby's shoulder blades using the heel of your hand. If the liquid does not dislodge, turn the baby face-up and give up to 5 chest thrusts. Repeat until the airway is clear or emergency services arrive."],
                "context_set": ""
              },
              {
                "tag": "Infant CPR",
                "patterns": ["How to perform CPR on an infant?", "CPR steps for babies?", "Emergency CPR for infants?", "First aid CPR for a non-breathing baby?", "Life-saving CPR technique for infants?"],
                "responses": ["If an infant is unresponsive and not breathing, call for help, then start CPR. Place 2 fingers on the sternum just below the nipple line. Compress the chest about 1.5 inches deep at a rate of 100-120 compressions per minute. After every 30 compressions, give 2 gentle rescue breaths by covering the baby’s mouth and nose with your mouth and blowing softly."],
                "context_set": ""
              },
              {
                "tag": "Febrile Seizure in Babies",
                "patterns": ["Managing febrile seizure in infants?", "What to do during a baby's febrile seizure?", "First aid for febrile seizure in babies?", "How to help a baby with a febrile seizure?", "Immediate steps for infant febrile seizure?"],
                "responses": ["If a baby has a febrile seizure, keep them safe by placing them on a soft surface, such as a carpeted floor. Remove any hard objects from the area. Do not restrain the baby or put anything in their mouth. After the seizure, lay the baby on their side to keep the airway open. Cool the baby by removing excess clothing and use a lukewarm sponge bath. Seek medical help immediately."],
                "context_set": ""
              },
              {
                "tag": "Burns from Hot Liquids",
                "patterns": ["First aid for burns from hot liquids on a baby?", "Treating a baby’s hot liquid burn?", "Emergency care for infant scalds?", "How to treat a scald on a baby?", "Immediate steps for baby burns from liquids?"],
                "responses": ["If a baby gets burned by a hot liquid, immediately cool the burn under lukewarm running water for at least 10 minutes. Do not use ice. Remove any clothing from the burned area carefully. Cover the burn loosely with a sterile gauze or a clean cloth. Avoid applying creams or ointments. Seek medical attention immediately after initial first aid."],
                "context_set": ""
              },
              {
                "tag": "Nasal Congestion in Babies",
                "patterns": ["Clearing nasal congestion in babies?", "First aid for baby nasal congestion?", "How to relieve a congested infant?", "Treating stuffy nose in infants?", "Home remedies for infant nasal congestion?"],
                "responses": ["To relieve nasal congestion in a baby, use saline drops and a bulb syringe to gently suction mucus from the nose. Position the baby with their head slightly elevated. Use a cool-mist humidifier in the baby’s room to keep the air moist. Consult a pediatrician if the congestion persists or is accompanied by fever or difficulty breathing."],
                "context_set": ""
              },
              {
                "tag": "Bee Sting on Babies",
                "patterns": ["First aid for bee sting on a baby?", "What to do if a baby gets stung by a bee?", "Handling bee stings in infants?", "Emergency steps for bee sting on infants?", "How to treat a baby’s bee sting?"],
                "responses": ["If a baby is stung by a bee, first, gently scrape away the stinger with a credit card or your fingernail. Do not use tweezers as it may squeeze more venom into the skin. Wash the area with soap and water and apply a cold compress to reduce swelling. Watch for signs of an allergic reaction such as difficulty breathing, swelling of the face or lips, or hives. If these symptoms occur, call emergency services immediately."],
                "context_set": ""
              },
              {
                "tag": "Diaper Rash",
                "patterns": ["Treating diaper rash in babies?", "First aid for severe diaper rash?", "Home treatment for infant diaper rash?", "How to alleviate diaper rash discomfort?", "Effective remedies for baby diaper rash?"],
                "responses": ["To treat diaper rash, change the baby’s diaper frequently and clean the area gently with water and a soft cloth. Allow the skin to air dry fully before putting on a new diaper. Apply a zinc oxide diaper cream to protect the skin. If the rash is severe, has blisters, or does not improve within a few days, consult a pediatrician."],
                "context_set": ""
              },
              {
                "tag": "Foreign Object Ingestion by Babies",
                "patterns": ["What to do if a baby swallows a foreign object?", "First aid for infant ingesting non-food item?", "Handling swallowed objects in babies?", "Emergency response for infant ingestion?", "Immediate care for babies swallowing objects?"],
                "responses": ["If you suspect that a baby has swallowed a foreign object, monitor them closely for signs of distress or choking. Do not attempt to induce vomiting. Look for coughing, wheezing, or difficulty breathing. If any of these signs occur, seek emergency medical attention immediately. Keep the baby calm and do not give them anything to eat or drink until evaluated by a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Infant Sunburn",
                "patterns": ["First aid for sunburn on a baby?", "Treating sunburn in infants?", "How to care for a baby’s sunburn?", "Immediate steps for infant sunburn care?", "Emergency treatment for baby sunburn?"],
                "responses": ["If a baby gets sunburned, move them out of the sun immediately. Cool the affected skin with a damp cloth. Apply aloe vera or a moisturizing lotion to soothe the skin if it doesn't irritate further. Keep the baby hydrated and dressed in loose, comfortable clothing. If the sunburn causes blisters, fever, or lethargy, seek medical attention immediately."],
                "context_set": ""
              },
              {
                "tag": "Milk Allergy Reaction in Babies",
                "patterns": ["How to identify milk allergy in babies?", "First aid for milk allergy in infants?", "What to do if baby has allergic reaction to milk?", "Immediate steps for infant milk allergy?", "Managing milk allergy symptoms in babies?"],
                "responses": ["If a baby shows signs of a milk allergy reaction, such as hives, eczema, vomiting, diarrhea, or wheezing, remove any milk or dairy products immediately. Administer antihistamines if prescribed. Monitor for any signs of anaphylaxis, including difficulty breathing or swelling of the face and lips. If these severe symptoms occur, use an epinephrine auto-injector if available and call emergency services immediately."],
                "context_set": ""
              }, 
              {
                "tag": "Suspected Broken Leg",
                "patterns": ["What should I do if I think I broke my leg?", "How to tell if a leg is broken?", "Immediate steps for a suspected broken leg?", "First aid for possible leg fracture?"],
                "responses": ["Do not move the person unless absolutely necessary to avoid further injury. Keep the leg immobile; do not try to realign the bone. Apply ice wrapped in a cloth to reduce swelling and pain. Elevate the leg if possible. Call emergency services or go to the emergency room immediately."],
                "context_set": ""
              },
            
              {
                "tag": "Compound Fracture in Leg",
                "patterns": ["How to treat a compound fracture in the leg?", "First aid for open leg fracture?", "What to do if there's a bone protruding in a leg injury?", "Managing a compound leg fracture?"],
                "responses": ["Cover the wound with a clean cloth or sterile dressing to prevent contamination. Do not attempt to push the bone back in. Apply gentle pressure around the wound to control bleeding. Keep the leg immobile and elevated if possible. Call for emergency medical help immediately."],
                "context_set": ""
              },
            
              {
                "tag": "Simple Leg Fracture",
                "patterns": ["First aid for a closed leg fracture?", "What to do for a simple broken leg?", "How to care for a non-compound leg fracture?", "Immediate treatment for a closed leg break?"],
                "responses": ["Keep the injured leg as still as possible. Apply ice to reduce swelling but avoid applying ice directly to the skin. Use cushions or clothes to create a makeshift splint to immobilize the leg. Do not give anything to eat or drink if surgery might be required. Seek medical attention promptly."],
                "context_set": ""
              },
            
              {
                "tag": "Leg Fracture in Children",
                "patterns": ["How to handle a leg fracture in a child?", "Child broke their leg, what to do?", "First aid for kids with broken legs?", "Immediate care for a child’s broken leg?"],
                "responses": ["Keep the child calm and still; reassure them as you call for medical help. Do not try to move or adjust the leg. Apply ice wrapped in cloth to ease pain and swelling. If there’s a wound, cover it with a clean bandage. Get professional medical care as quickly as possible."],
                "context_set": ""
              },
            
              {
                "tag": "Stress Fracture in Leg",
                "patterns": ["What to do for a stress fracture in the leg?", "First aid for a mild leg fracture?", "How to treat minor fractures in the leg?", "Care instructions for a stress fracture in the leg?"],
                "responses": ["Rest the affected leg and avoid putting weight on it. Apply ice for 20 minutes every couple of hours to reduce swelling. Compress the leg with an elastic bandage if swelling is present. Elevate the leg to decrease swelling. Seek medical evaluation to determine the need for further treatment such as bracing or physical therapy."],
                "context_set": ""
              },
            
              {
                "tag": "Multiple Fractures in Leg",
                "patterns": ["How to care for multiple fractures in a leg?", "First aid for complex leg injuries?", "What to do if someone has multiple breaks in the leg?", "Emergency response for multiple leg fractures?"],
                "responses": ["Call emergency services immediately. Do not move the person unless they are in danger. Try to keep the leg as still as possible. Apply ice packs to areas of swelling. Cover any wounds with sterile dressings. Keep the person warm and calm while waiting for medical help."],
                "context_set": ""
              },
            
              {
                "tag": "Fractured Thigh Bone",
                "patterns": ["How to treat a broken thigh bone?", "First aid for femur fracture?", "Immediate steps for a fractured femur?", "What to do for a broken upper leg?"],
                "responses": ["A fractured femur is a severe injury requiring immediate medical attention. Call for emergency assistance. Do not attempt to move the person unless absolutely necessary. If you must apply ice, wrap it in cloth and apply it to the injured area to minimize swelling. Cover the person with a blanket to maintain body temperature and prevent shock."],
                "context_set": ""
              },
            
              {
                "tag": "Broken Leg with Severe Bleeding",
                "patterns": ["First aid for a bleeding broken leg?", "How to manage a broken leg with heavy bleeding?", "What to do if a broken leg is bleeding significantly?", "Stopping bleeding in a severe leg fracture?"],
                "responses": ["Call emergency services right away. While waiting for help, apply firm pressure to the bleeding area with a clean cloth or sterile bandage. If possible, elevate the leg above heart level. Do not attempt to clean severe wounds or remove deeply embedded objects as this could increase bleeding."],
                "context_set": ""
              },
            
              {
                "tag": "Aftercare for a Broken Leg",
                "patterns": ["What to do after a leg is set in a cast?", "Care tips post leg fracture?", "How to manage daily activities with a broken leg?", "Recovery advice for a healed leg fracture?"],
                "responses": ["Follow your doctor’s instructions regarding care of the cast and any weight-bearing limits. Keep the cast dry and elevated when sitting to reduce swelling. Attend all follow-up appointments to monitor healing. Engage in recommended rehabilitation exercises to restore strength and mobility under professional guidance."],
                "context_set": ""
              },
            
              {
                "tag": "Broken Leg with Suspected Spinal Injury",
                "patterns": ["What to do if a broken leg comes with back pain?", "Handling a leg fracture with potential spinal injury?", "First aid for leg and possible spinal injury?", "Immediate care for multiple traumatic injuries?"],
                "responses": ["Do not move the person unless absolutely necessary to avoid worsening a potential spinal injury. Call for emergency medical help. Keep the person as still as possible, supporting the head and neck if you must reposition them for safety. Monitor their breathing and consciousness, and prepare to perform CPR if necessary while awaiting help."],
                "context_set": ""
              }, 
              {
                "tag": "Suspected Broken Arm",
                "patterns": ["How do I know if my arm is broken?", "First aid for a suspected broken arm?", "What to do if you think you broke your arm?", "Emergency steps for a possible arm fracture?"],
                "responses": ["Do not move the arm; stabilize the arm in its current position. If available, use a splint or sling to immobilize the arm but do not try to realign it. Apply ice wrapped in a cloth to reduce swelling. Avoid giving pain medications before getting medical advice. Seek professional medical help immediately."],
                "context_set": ""
              },
            
              {
                "tag": "Compound Fracture in Arm",
                "patterns": ["Handling an open fracture in the arm?", "First aid for compound arm fracture?", "What to do if bone is visible in arm injury?", "Emergency care for open arm fractures?"],
                "responses": ["Cover the wound with a clean cloth or sterile dressing. Do not attempt to push any protruding bones back into place. Apply gentle pressure around the wound to control bleeding if necessary. Keep the arm immobilized and elevated. Call emergency services immediately."],
                "context_set": ""
              },
            
              {
                "tag": "Simple Fracture of the Arm",
                "patterns": ["Treatment for a closed arm fracture?", "First aid for a simple broken arm?", "How to care for a non-compound arm fracture?", "Immediate steps after an arm break?"],
                "responses": ["Immobilize the arm using a sling or splint if possible, without adjusting the arm's position. Apply ice packs to reduce swelling, wrapping the ice in cloth to avoid direct skin contact. Avoid using the arm and elevate it to decrease pain and swelling. Seek medical attention as soon as possible."],
                "context_set": ""
              },
            
              {
                "tag": "Arm Fracture in Children",
                "patterns": ["How to treat a child's broken arm?", "First aid for broken arm in kids?", "What to do if a child breaks their arm?", "Immediate care for child’s broken arm?"],
                "responses": ["Keep the child calm and do not move the injured arm. If you can safely apply a splint or sling, do so without moving the arm. Apply ice wrapped in a towel for comfort and to reduce swelling. Take the child to a pediatric emergency room or call emergency services right away."],
                "context_set": ""
              },
            
              {
                "tag": "Stress Fracture in Arm",
                "patterns": ["Dealing with a stress fracture in the arm?", "First aid for minor arm fracture?", "How to treat hairline fractures in the arm?", "Care for mild fractures in the arm?"],
                "responses": ["Rest the arm and avoid activities that cause pain. Apply ice periodically to reduce swelling and pain. Use an elastic bandage or splint to immobilize the arm if necessary. If pain or swelling persists, seek medical evaluation for appropriate management and potential physical therapy."],
                "context_set": ""
              },
            
              {
                "tag": "Multiple Fractures in Arm",
                "patterns": ["First aid for multiple fractures in one arm?", "Handling severe arm injuries with multiple breaks?", "What to do if multiple arm bones are fractured?", "Emergency treatment for complex arm fractures?"],
                "responses": ["Call emergency services for immediate medical assistance. Do not attempt to realign the bones. Immobilize the arm as best as you can with a sling or splint. Apply ice to reduce swelling but ensure there is a barrier such as a cloth between the ice and skin. Keep the arm elevated if possible."],
                "context_set": ""
              },
            
              {
                "tag": "Fractured Wrist",
                "patterns": ["How to treat a broken wrist?", "First aid for wrist fracture?", "Immediate steps for a fractured wrist?", "What to do for a broken wrist?"],
                "responses": ["Stabilize the wrist with a splint or a makeshift support. Apply ice to the injured area to reduce swelling and pain. Avoid using the wrist and keep it elevated. Seek medical attention quickly to ensure proper alignment and healing."],
                "context_set": ""
              },
            
              {
                "tag": "Broken Arm with Severe Bleeding",
                "patterns": ["Managing a broken arm with heavy bleeding?", "First aid for bleeding with an arm fracture?", "What to do if a broken arm bleeds profusely?", "Stopping severe bleeding in an arm fracture?"],
                "responses": ["Call emergency services right away. While waiting for help, apply pressure to the bleeding site with a clean cloth. If the bleeding does not stop, continue to apply pressure with a new cloth on top of the old. Keep the arm elevated above the heart to reduce bleeding."],
                "context_set": ""
              },
            
              {
                "tag": "Aftercare for a Broken Arm",
                "patterns": ["Post-care tips for a healed broken arm?", "What to do after an arm cast is removed?", "How to manage recovery after an arm fracture?", "Rehabilitation for a broken arm?"],
                "responses": ["Follow all rehabilitation exercises prescribed by your healthcare provider to regain strength and mobility. Keep the arm elevated when resting if swelling persists. Avoid strenuous activities until cleared by a medical professional. Attend all follow-up appointments to monitor healing."],
                "context_set": ""
              },
            
              {
                "tag": "Broken Arm with Nerve Damage",
                "patterns": ["What to do if a broken arm has nerve damage?", "Handling a fractured arm with suspected nerve injury?", "First aid for arm fracture with nerve issues?", "Immediate care for nerve damage in a broken arm?"],
                "responses": ["Do not move the arm. Immobilize it in the position found, using a sling or splint if possible. Do not try to realign the arm. Nerve damage may not be immediately obvious, so seek emergency medical care where further testing and treatment can be provided."],
                "context_set": ""
              }, 
              {
                "tag": "Dry Cough",
                "patterns": ["What to do for a dry cough?", "Home remedies for a dry cough?", "First aid for persistent dry cough?", "Relief from dry coughing?"],
                "responses": ["Stay hydrated by drinking plenty of water. Use a humidifier to add moisture to the air. Suck on throat lozenges or hard candies to soothe the throat. If the cough persists for more than a few weeks, or is accompanied by other symptoms like shortness of breath, consult a healthcare provider."],
                "context_set": ""
              },
            
              {
                "tag": "Cough with Phlegm",
                "patterns": ["How to treat a cough with mucus?", "What to do if coughing up phlegm?", "First aid for cough producing phlegm?", "Managing a productive cough?"],
                "responses": ["Drink plenty of fluids to help thin the mucus. Inhale steam from a bowl of hot water or take a hot shower to loosen the phlegm. Use a saline nasal spray or drops to aid in mucus expulsion. If the cough is persistent, or the phlegm is discolored or blood-stained, seek medical advice."],
                "context_set": ""
              },
            
              {
                "tag": "Nighttime Cough",
                "patterns": ["How to ease nighttime cough?", "First aid for cough at night?", "What helps with coughing at night?", "Treating cough that worsens at night?"],
                "responses": ["Elevate the head with extra pillows at bedtime to help reduce coughing. Avoid heavy meals and caffeine close to bedtime. Keep the bedroom air moist with a humidifier. If nighttime cough persists, consult a healthcare provider to rule out underlying conditions like asthma or GERD."],
                "context_set": ""
              },
            
              {
                "tag": "Cough in Children",
                "patterns": ["How to treat a child’s cough?", "First aid for coughing in children?", "Home remedies for children’s cough?", "What to do if a child keeps coughing?"],
                "responses": ["Keep the child hydrated with fluids. Use a cool-mist humidifier in the child’s room. For children over one year, a small amount of honey can help soothe the cough. Avoid giving over-the-counter cough medicine to children under four years old. If the child's cough is severe, disrupts sleep, or is accompanied by fever or difficulty breathing, seek pediatric care."],
                "context_set": ""
              },
            
              {
                "tag": "Coughing Fit",
                "patterns": ["First aid for a coughing fit?", "What to do during a severe coughing attack?", "Handling sudden bouts of intense coughing?", "Emergency steps for uncontrollable coughing?"],
                "responses": ["Breathe slowly and deeply through the nose to calm the cough. Sip water slowly or suck on ice chips. Inhale steam from hot water to ease the cough. If coughing fits are frequent and severe, causing difficulty breathing or lasting more than a few minutes, seek immediate medical attention."],
                "context_set": ""
              },
            
              {
                "tag": "Cough with Fever",
                "patterns": ["Treatment for cough with fever?", "What to do if coughing and feverish?", "Managing cough accompanied by fever?", "First aid for cough and fever?"],
                "responses": ["Rest and stay hydrated. Monitor the fever; if it exceeds 101°F (38.3°C) in adults or is persistent, consider using fever reducers like acetaminophen. If symptoms include a high fever, severe cough, or difficulty breathing, seek medical evaluation as these could indicate a more serious infection."],
                "context_set": ""
              },
            
              {
                "tag": "Whooping Cough",
                "patterns": ["How to manage whooping cough?", "First aid for pertussis?", "What to do for severe whooping cough?", "Home care tips for whooping cough?"],
                "responses": ["Keep the environment free from irritants like smoke. Maintain good hydration and use a humidifier. Whooping cough is highly contagious and potentially dangerous, especially for infants. It is important to seek medical attention for diagnosis and treatment with antibiotics. Ensure vaccinations are up to date."],
                "context_set": ""
              },
            
              {
                "tag": "Cough after Choking",
                "patterns": ["What to do if coughing after choking?", "First aid for post-choking cough?", "Handling cough after a choking episode?", "Care for persistent cough after choking?"],
                "responses": ["If coughing persists after a choking incident, seek medical attention immediately. Continuous coughing after choking can indicate that part of the obstructed material may still be partially blocking the airway."],
                "context_set": ""
              },
            
              {
                "tag": "Chronic Cough",
                "patterns": ["Management for chronic cough?", "Long-term care for persistent coughing?", "What to do if cough doesn’t go away?", "Treating ongoing cough issues?"],
                "responses": ["Identify and treat underlying causes such as allergies, asthma, or GERD with the help of a healthcare provider. Use a humidifier and stay hydrated. Avoid triggers like tobacco smoke. Chronic cough that persists for weeks should be evaluated by a healthcare professional to determine and treat the underlying cause."],
                "context_set": ""
              },
            
              {
                "tag": "Cough Due to Cold",
                "patterns": ["How to treat cough from a common cold?", "First aid for cold-related cough?", "Home remedies for cough due to cold?", "Relief for coughing from a cold?"],
                "responses": ["Stay hydrated and rest as much as possible. Use a humidifier to add moisture to the air. Hot teas with honey can soothe the throat (for those over one year old). If the cough is persistent, disruptive, or accompanied by high fever and difficulty breathing, consult a healthcare provider."],
                "context_set": ""
              }, 
              {
                "tag": "Eye Strain Relief",
                "patterns": ["How to relieve eye strain?"],
                "responses": ["Take frequent breaks from screens, use the 20-20-20 rule (every 20 minutes, look at something 20 feet away for 20 seconds), and ensure proper lighting. If symptoms persist, consult an eye doctor."],
                "context_set": ""
              },
              {
                "tag": "Eye Pain Causes",
                "patterns": ["What are common causes of eye pain?"],
                "responses": ["Eye pain can be caused by various factors including dry eyes, foreign objects in the eye, eye strain, allergies, infections, or more serious conditions. Consult an eye specialist for proper diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Foreign Object Sensation",
                "patterns": ["I feel like there's something in my eye. What should I do?"],
                "responses": ["Flush your eye with clean water or use artificial tears to help remove the foreign object. If the sensation persists or if there's any redness, swelling, or pain, seek medical attention."],
                "context_set": ""
              },  
              {
                "tag": "Blood in Urine Overview",
                "patterns": ["What could be causing blood in urine?"],
                "responses": ["Blood in urine, also known as hematuria, can be caused by various factors including urinary tract infections, kidney stones, bladder or kidney infections, trauma, or underlying medical conditions. It's crucial to seek medical evaluation promptly to determine the cause and appropriate treatment."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Help",
                "patterns": ["When should I seek medical help for blood in urine?"],
                "responses": ["It's important to seek immediate medical attention if you notice blood in your urine, especially if it's accompanied by pain, fever, difficulty urinating, or if you have a history of kidney problems. These could be signs of a serious condition requiring urgent medical intervention."],
                "context_set": ""
              },
              {
                "tag": "First Aid for Blood in Urine",
                "patterns": ["What should I do as first aid for blood in urine?"],
                "responses": ["As first aid for blood in urine, encourage the person to rest and stay hydrated. If there's significant pain or other concerning symptoms, seek medical help immediately. Refrain from providing any medications and instead, focus on getting professional medical assistance."],
                "context_set": ""
              },
              {
                "tag": "Blood in Urine and Self-Diagnosis",
                "patterns": ["Can you diagnose the cause of blood in urine?"],
                "responses": ["As an AI, I'm unable to diagnose medical conditions. Blood in urine can have various causes, some of which may require urgent medical attention. It's essential to consult a healthcare professional for proper evaluation, diagnosis, and treatment."],
                "context_set": ""
              },
              {
                "tag": "Blood in Urine and Medication Advice",
                "patterns": ["Should I take medication for blood in urine?"],
                "responses": ["I cannot provide advice on medication usage for blood in urine. It's important to seek medical evaluation to determine the underlying cause and receive appropriate treatment. Refrain from self-medication and rely on professional medical advice."],
                "context_set": ""
              },
              {
                "tag": "Blood in Urine and Home Remedies",
                "patterns": ["Are there any home remedies for blood in urine?"],
                "responses": ["While some home remedies may provide temporary relief for symptoms associated with blood in urine, such as staying hydrated or using heat packs for pain, it's crucial to seek medical evaluation for proper diagnosis and treatment. Refrain from relying solely on home remedies and consult a healthcare professional for guidance."],
                "context_set": ""
              },
              {
                "tag": "Blood in Urine Assessment",
                "patterns": ["How can I assess the severity of blood in urine?"],
                "responses": ["If you notice blood in your urine, assess its severity based on factors like the amount of blood, presence of pain or discomfort, any associated symptoms such as fever or difficulty urinating, and your medical history. Regardless of severity, seeking medical evaluation is crucial for accurate diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Blood in Urine and Delayed Treatment",
                "patterns": ["Can blood in urine be left untreated?"],
                "responses": ["Leaving blood in urine untreated can be risky as it may indicate underlying conditions such as urinary tract infections, kidney stones, or bladder cancer, which may worsen without proper medical intervention. It's important to seek prompt medical evaluation to address the underlying cause and prevent potential complications."],
                "context_set": ""
              },
              {
                "tag": "Blood in Urine and Medical Examination",
                "patterns": ["What will happen during a medical examination for blood in urine?"],
                "responses": ["During a medical examination for blood in urine, a healthcare provider may conduct a physical examination, inquire about your medical history and symptoms, and may recommend additional tests such as urine analysis or imaging studies to determine the underlying cause. Prompt medical evaluation is crucial for proper diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Blood in Urine and Medical Consultation",
                "patterns": ["How do I schedule a medical consultation for blood in urine?"],
                "responses": ["To schedule a medical consultation for blood in urine, contact your primary care physician, a urologist, or visit an urgent care center if the symptoms are severe or sudden. It's important to seek medical evaluation promptly to determine the cause of the blood in urine and receive appropriate treatment."],
                "context_set": ""
              }, 
              {
                "tag": "Testicle Pain Overview",
                "patterns": ["What could be causing testicle pain?"],
                "responses": ["Testicle pain can be caused by various factors including injury, infection, inflammation, torsion (twisting of the testicle), or underlying medical conditions. It's crucial to seek medical evaluation promptly to determine the cause and appropriate treatment."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Help",
                "patterns": ["When should I seek medical help for testicle pain?"],
                "responses": ["It's important to seek immediate medical attention if you experience severe testicle pain, sudden onset of pain, swelling, redness, or if the pain is accompanied by fever, nausea, or difficulty urinating. These could be signs of a serious condition requiring urgent medical intervention."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain Management",
                "patterns": ["How can I manage testicle pain at home?"],
                "responses": ["While mild testicle pain may sometimes resolve on its own, it's crucial to refrain from self-medication and seek medical advice for proper evaluation and treatment. Applying ice packs, wearing supportive underwear, and avoiding activities that exacerbate the pain may provide temporary relief, but medical evaluation is essential for accurate diagnosis and management."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Self-Diagnosis",
                "patterns": ["Can you diagnose the cause of my testicle pain?"],
                "responses": ["As an AI, I'm unable to diagnose medical conditions. Testicle pain can have various causes, some of which may require urgent medical attention. It's essential to consult a healthcare professional for proper evaluation, diagnosis, and treatment."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Painkillers",
                "patterns": ["Should I take painkillers for testicle pain?"],
                "responses": ["I cannot provide advice on medication usage. Testicle pain can have serious underlying causes that require medical attention. It's important to refrain from self-medication and consult a healthcare provider for proper evaluation and treatment."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Home Remedies",
                "patterns": ["Are there any home remedies for testicle pain?"],
                "responses": ["While some home remedies like applying ice packs or taking over-the-counter pain relievers may provide temporary relief for mild testicle pain, it's essential to seek medical evaluation for persistent or severe pain. Home remedies should not substitute professional medical care."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain Assessment",
                "patterns": ["How can I assess the severity of my testicle pain?"],
                "responses": ["If you're experiencing testicle pain, assess its severity based on factors like the intensity and duration of pain, presence of swelling or redness, and any associated symptoms such as fever or difficulty urinating. Regardless of severity, seeking medical evaluation is crucial for accurate diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Delayed Treatment",
                "patterns": ["Can testicle pain be left untreated?"],
                "responses": ["Leaving testicle pain untreated can be risky as it may indicate underlying conditions such as infection or torsion, which can lead to serious complications including infertility or loss of the testicle. It's important to seek medical evaluation promptly to address the underlying cause and prevent potential complications."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Medical Examination",
                "patterns": ["What will happen during a medical examination for testicle pain?"],
                "responses": ["During a medical examination for testicle pain, a healthcare provider may conduct a physical examination, inquire about your medical history and symptoms, and may recommend additional tests such as ultrasound or urine analysis to determine the underlying cause of the pain. Prompt medical evaluation is crucial for proper diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Medical Consultation",
                "patterns": ["How do I schedule a medical consultation for testicle pain?"],
                "responses": ["To schedule a medical consultation for testicle pain, contact your primary care physician, a urologist, or visit an urgent care center if the pain is severe or sudden. It's important to seek medical evaluation promptly to determine the cause of the pain and receive appropriate treatment."],
                "context_set": ""
              }, 
              {
                "tag": "Pills Information Disclaimer",
                "patterns": ["Can you provide information about specific pills?"],
                "responses": ["I'm sorry, but as an AI, I cannot provide information or advice on specific pills, medications, or medical treatments. It's important to consult a healthcare professional or pharmacist for accurate information and guidance regarding medication usage."],
                "context_set": ""
              },
              {
                "tag": "Medication Advice Disclaimer",
                "patterns": ["What are the side effects of [specific pill name]?"],
                "responses": ["I'm unable to provide information about specific medications or their side effects. It's crucial to consult a healthcare provider or pharmacist for detailed information about the potential side effects of any medication."],
                "context_set": ""
              },
              {
                "tag": "Pill Dosage Inquiry Disclaimer",
                "patterns": ["How many [specific pill name] should I take for [condition]?"],
                "responses": ["I'm not equipped to offer advice on specific medication dosages. It's essential to consult a qualified healthcare professional who can evaluate your condition and provide personalized dosage recommendations based on your medical history and current health status."],
                "context_set": ""
              },
              {
                "tag": "Medication Interactions Disclaimer",
                "patterns": ["Can I take [specific pill name] with [another medication]?"],
                "responses": ["I cannot provide information on potential medication interactions. It's vital to consult a healthcare professional or pharmacist who can assess your medical history and current medications to determine if there are any potential interactions between medications."],
                "context_set": ""
              },
              {
                "tag": "Generic vs. Brand Name Pills Disclaimer",
                "patterns": ["What's the difference between generic and brand name versions of [specific pill name]?"],
                "responses": ["I'm not able to provide detailed comparisons between generic and brand name medications. It's advisable to consult a healthcare provider or pharmacist who can offer information specific to your medication needs and preferences."],
                "context_set": ""
              },
              {
                "tag": "Pill Identification Inquiry Disclaimer",
                "patterns": ["Can you identify this pill? It's [description of pill]"],
                "responses": ["As an AI, I'm unable to identify pills based on descriptions. It's crucial to consult a healthcare professional or pharmacist who can accurately identify medications and provide guidance on their usage."],
                "context_set": ""
              },
              {
                "tag": "Pill Storage and Handling Disclaimer",
                "patterns": ["How should I store [specific pill name]?"],
                "responses": ["I'm not equipped to provide instructions on the storage or handling of specific medications. It's important to carefully read the medication's label or consult a pharmacist for proper storage guidelines to ensure medication effectiveness and safety."],
                "context_set": ""
              },
              {
                "tag": "Pill Expiration Inquiry Disclaimer",
                "patterns": ["Is it safe to take expired [specific pill name]?"],
                "responses": ["I cannot provide advice on the safety of taking expired medications. It's recommended to dispose of expired medications properly and consult a healthcare professional or pharmacist for guidance on obtaining a new prescription if needed."],
                "context_set": ""
              },
              {
                "tag": "Pill Consumption Schedule Disclaimer",
                "patterns": ["When should I take [specific pill name]?"],
                "responses": ["I'm unable to provide specific dosing schedules for medications. It's essential to follow the instructions provided by your healthcare provider or pharmacist regarding when and how to take your medication for optimal effectiveness and safety."],
                "context_set": ""
              },
              {
                "tag": "Pill Allergy Inquiry Disclaimer",
                "patterns": ["I'm allergic to [specific ingredient]. Can I take [specific pill name]?"],
                "responses": ["I cannot offer advice on medication allergies or whether it's safe to take a specific medication if you have allergies. It's crucial to consult a healthcare provider or pharmacist who can assess your medical history and provide guidance on suitable medication alternatives."],
                "context_set": ""
              },   
              {
                "tag": "Causes of Back Pain",
                "patterns": ["What are common causes of back pain?"],
                "responses": ["Back pain can be caused by various factors including muscle strain, poor posture, injury, herniated discs, arthritis, or underlying health conditions. It's important to consult a healthcare provider for proper diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Managing Back Pain at Home",
                "patterns": ["How can I manage back pain at home?"],
                "responses": ["Apply ice or heat packs, practice gentle stretching and strengthening exercises, maintain good posture, use over-the-counter pain relievers if necessary, and avoid activities that worsen the pain. If symptoms persist, seek medical advice."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Help",
                "patterns": ["When should I seek medical help for back pain?"],
                "responses": ["Seek medical attention if back pain is severe, lasts longer than a few weeks, is accompanied by numbness or tingling in the legs, difficulty walking, or loss of bladder or bowel control. These could be signs of a serious condition needing urgent treatment."],
                "context_set": ""
              },
              {
                "tag": "Back Pain Due to Poor Posture",
                "patterns": ["How can I relieve back pain caused by poor posture?"],
                "responses": ["Focus on maintaining proper posture while sitting, standing, and lifting objects. Use ergonomic furniture, take regular breaks to stretch, and consider exercises to strengthen core muscles. If pain persists, consult a physical therapist for guidance."],
                "context_set": ""
              },
              {
                "tag": "Exercises for Back Pain Relief",
                "patterns": ["What exercises can help relieve back pain?"],
                "responses": ["Gentle exercises such as yoga, swimming, walking, or Pilates can help strengthen back muscles and improve flexibility. Consult a healthcare provider or physical therapist for personalized exercise recommendations based on your specific condition."],
                "context_set": ""
              },
              {
                "tag": "Preventing Back Pain",
                "patterns": ["How can I prevent back pain?"],
                "responses": ["Maintain a healthy weight, exercise regularly to strengthen back and core muscles, practice good posture, use proper lifting techniques, avoid prolonged sitting or standing, and ensure a supportive mattress and ergonomic workspace. Regular stretching and strengthening exercises can also help prevent back pain."],
                "context_set": ""
              },
              {
                "tag": "Chronic Back Pain Management",
                "patterns": ["How to manage chronic back pain?"],
                "responses": ["Chronic back pain may require a multidisciplinary approach including physical therapy, medication, injections, or even surgery in severe cases. Work with your healthcare provider to develop a comprehensive treatment plan tailored to your needs."],
                "context_set": ""
              },
              {
                "tag": "Back Pain During Pregnancy",
                "patterns": ["I'm experiencing back pain during pregnancy. What should I do?"],
                "responses": ["Back pain is common during pregnancy due to hormonal changes and increased weight. Practice good posture, use supportive shoes, try prenatal yoga or swimming, use pregnancy pillows for support, and consider seeing a physical therapist specializing in prenatal care for additional guidance."],
                "context_set": ""
              },
              {
                "tag": "Sciatica Relief",
                "patterns": ["How can I relieve sciatica pain?"],
                "responses": ["Apply ice or heat packs to the affected area, perform gentle stretches targeting the sciatic nerve, avoid sitting for prolonged periods, and consider over-the-counter pain relievers or muscle relaxants. If symptoms persist, consult a healthcare provider for further evaluation and treatment."],
                "context_set": ""
              },
              {
                "tag": "Back Pain in Children",
                "patterns": ["My child complains of back pain. What should I do?"],
                "responses": ["Back pain in children is less common but can be caused by various factors including heavy backpacks, poor posture, or underlying medical conditions. Monitor your child's symptoms, encourage good posture and regular physical activity, and consult a pediatrician if back pain persists or worsens."],
                "context_set": ""
              }, 
              {
                "tag": "Eye Strain Relief",
                "patterns": ["How to relieve eye strain?"],
                "responses": ["Take frequent breaks from screens, use the 20-20-20 rule (every 20 minutes, look at something 20 feet away for 20 seconds), and ensure proper lighting. If symptoms persist, consult an eye doctor."],
                "context_set": ""
              },
              {
                "tag": "Eye Pain Causes",
                "patterns": ["What are common causes of eye pain?"],
                "responses": ["Eye pain can be caused by various factors including dry eyes, foreign objects in the eye, eye strain, allergies, infections, or more serious conditions. Consult an eye specialist for proper diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Foreign Object Sensation",
                "patterns": ["I feel like there's something in my eye. What should I do?"],
                "responses": ["Flush your eye with clean water or use artificial tears to help remove the foreign object. If the sensation persists or if there's any redness, swelling, or pain, seek medical attention."],
                "context_set": ""
              },
              {
                "tag": "Eye Pain and Redness",
                "patterns": ["My eye is red and painful. What could be wrong?"],
                "responses": ["Redness and pain in the eye could indicate an infection, inflammation, or even a scratched cornea. Avoid rubbing the eye and seek prompt evaluation by an eye doctor."],
                "context_set": ""
              },
              {
                "tag": "Emergency Eye Care",
                "patterns": ["What should I do if I have sudden severe eye pain?"],
                "responses": ["Sudden severe eye pain could be a sign of a serious condition such as acute glaucoma or a detached retina. Seek immediate medical attention to prevent vision loss."],
                "context_set": ""
              },
              {
                "tag": "Eye Pain with Headache",
                "patterns": ["I have eye pain along with a headache. What could be causing this?"],
                "responses": ["Eye pain accompanied by a headache could be due to conditions like migraines, sinusitis, or even increased intraocular pressure. Consult a healthcare provider for proper evaluation and treatment."],
                "context_set": ""
              },
              {
                "tag": "Eye Pain and Light Sensitivity",
                "patterns": ["My eyes hurt, and I'm sensitive to light. What should I do?"],
                "responses": ["Light sensitivity along with eye pain could indicate conditions like uveitis, corneal abrasion, or even meningitis. Seek medical attention promptly for a thorough examination."],
                "context_set": ""
              },
              {
                "tag": "Eye Pain After Injury",
                "patterns": ["I got something in my eye, and now it's painful. What should I do?"],
                "responses": ["If you've experienced an eye injury, do not rub the eye. Rinse it gently with water and avoid attempting to remove any embedded object. Seek immediate medical attention to prevent further damage."],
                "context_set": ""
              },
              {
                "tag": "Eye Pain in Children",
                "patterns": ["My child is complaining of eye pain. What should I do?"],
                "responses": ["Eye pain in children could be due to various reasons including foreign objects, infections, or vision problems. Take your child to a pediatrician or an eye specialist for proper evaluation."],
                "context_set": ""
              },
              {
                "tag": "Preventive Eye Care",
                "patterns": ["How can I prevent eye pain?"],
                "responses": ["Ensure regular eye exams, practice good hygiene, protect your eyes from injuries, and follow proper screen usage guidelines. If you experience persistent eye pain or discomfort, seek professional advice."],
                "context_set": ""
              },   
              {
                "tag": "Testicle Pain Causes",
                "patterns": ["What are common causes of testicle pain?"],
                "responses": ["Testicle pain can be caused by various factors including injury, infection, inflammation, torsion, hernia, or referred pain from other areas like the abdomen or groin. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain Severity",
                "patterns": ["How serious is testicle pain?"],
                "responses": ["Testicle pain can range from mild discomfort to severe pain. Any persistent or severe testicle pain should be evaluated by a healthcare professional to rule out serious conditions such as testicular torsion or infection."],
                "context_set": ""
              },
              {
                "tag": "Testicular Torsion",
                "patterns": ["What is testicular torsion?"],
                "responses": ["Testicular torsion occurs when the spermatic cord twists, cutting off blood flow to the testicle. This is a medical emergency and requires immediate evaluation and treatment to prevent permanent damage to the testicle."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Swelling",
                "patterns": ["My testicle is swollen and painful. What could be wrong?"],
                "responses": ["Swelling and pain in the testicle could be due to various reasons including infection, trauma, or inflammation. It's important to see a doctor to determine the cause and appropriate treatment."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain After Injury",
                "patterns": ["I injured my testicle, and now it's painful. What should I do?"],
                "responses": ["If you've experienced trauma to the testicle, it's important to seek medical attention, especially if there is swelling, bruising, or severe pain. Avoid applying pressure to the area and refrain from strenuous activities until evaluated by a healthcare professional."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Urination",
                "patterns": ["I have testicle pain when I urinate. What could be causing this?"],
                "responses": ["Testicle pain during urination could be a sign of a urinary tract infection or a sexually transmitted infection. It's important to see a doctor for proper diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Fever",
                "patterns": ["I have testicle pain and fever. What should I do?"],
                "responses": ["Testicle pain accompanied by fever could indicate an infection, such as epididymitis or orchitis. It's important to seek medical attention promptly for evaluation and treatment to prevent complications."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Blood in Urine",
                "patterns": ["I noticed blood in my urine along with testicle pain. What could be wrong?"],
                "responses": ["Blood in the urine along with testicle pain could indicate various conditions including urinary tract infection, kidney stones, or even testicular cancer. It's important to see a doctor for further evaluation and diagnosis."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Nausea",
                "patterns": ["I have testicle pain and nausea. What could be causing this?"],
                "responses": ["Testicle pain accompanied by nausea could be a sign of a serious condition such as testicular torsion, which requires immediate medical attention. It's important to seek prompt evaluation by a healthcare professional."],
                "context_set": ""
              },
              {
                "tag": "Testicle Pain and Discharge",
                "patterns": ["I have testicle pain and discharge from the penis. What should I do?"],
                "responses": ["Testicle pain with discharge from the penis could indicate a sexually transmitted infection or epididymitis. It's important to see a doctor for proper diagnosis and treatment to prevent complications and transmission of infection."],
                "context_set": ""
              }, 
              {
                "tag": "Lower Back Pain Causes",
                "patterns": ["What are common causes of lower back pain?"],
                "responses": ["Lower back pain can be caused by various factors including muscle strain, poor posture, spinal abnormalities, herniated discs, or degenerative conditions. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Lower Back Pain",
                "patterns": ["How serious is lower back pain?"],
                "responses": ["Lower back pain can range from mild discomfort to severe pain that affects daily activities. While many cases resolve with self-care, persistent or severe pain, especially if accompanied by other symptoms like weakness or numbness, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Lower Back Pain and Sciatica",
                "patterns": ["I have lower back pain that radiates down my leg. What could be causing this?"],
                "responses": ["Lower back pain that radiates down the leg is often associated with sciatica, which is caused by compression or irritation of the sciatic nerve. It's important to see a healthcare professional for proper diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Lower Back Pain and Lifting",
                "patterns": ["I have lower back pain after lifting something heavy. What should I do?"],
                "responses": ["If you've experienced lower back pain after lifting heavy objects, it's important to avoid further strain and rest. Apply ice to the affected area and consider gentle stretching exercises once the acute pain subsides. If the pain persists or worsens, seek medical attention."],
                "context_set": ""
              },
              {
                "tag": "Lower Back Pain and Posture",
                "patterns": ["How does posture affect lower back pain?"],
                "responses": ["Poor posture, such as slouching or sitting for prolonged periods, can contribute to lower back pain by putting strain on the muscles and ligaments. Practicing good posture and taking frequent breaks to stretch can help alleviate and prevent lower back pain."],
                "context_set": ""
              },
              {
                "tag": "Lower Back Pain and Exercise",
                "patterns": ["Can exercise help with lower back pain?"],
                "responses": ["Yes, gentle exercises and stretches can help strengthen the muscles supporting the lower back and improve flexibility, which may alleviate lower back pain over time. However, it's important to consult with a healthcare professional before starting any exercise program, especially if experiencing severe or chronic pain."],
                "context_set": ""
              },
              {
                "tag": "Lower Back Pain and Chronic Conditions",
                "patterns": ["Is lower back pain always a sign of a chronic condition?"],
                "responses": ["Not necessarily. While lower back pain can be a symptom of chronic conditions such as degenerative disc disease or spinal stenosis, it can also result from acute injuries or muscle strain. However, if the pain persists for more than a few weeks or if it worsens, medical evaluation is recommended."],
                "context_set": ""
              },
              {
                "tag": "Lower Back Pain and Sleeping",
                "patterns": ["How can I sleep better with lower back pain?"],
                "responses": ["Sleeping on your side with a pillow between your knees can help alleviate lower back pain by maintaining proper spinal alignment. Additionally, using a supportive mattress and avoiding sleeping on your stomach can also help reduce strain on the lower back."],
                "context_set": ""
              },
              {
                "tag": "Lower Back Pain and Weight Management",
                "patterns": ["Can losing weight help with lower back pain?"],
                "responses": ["Excess weight can put strain on the lower back, exacerbating pain and contributing to spinal conditions. Losing weight through a combination of healthy diet and exercise can help reduce pressure on the spine and alleviate lower back pain."],
                "context_set": ""
              },
              {
                "tag": "Lower Back Pain and Medical Evaluation",
                "patterns": ["When should I see a doctor for lower back pain?"],
                "responses": ["You should consider seeking medical attention for lower back pain if it persists for more than a few weeks, if it's accompanied by weakness, numbness, or tingling in the legs, or if it's associated with bladder or bowel dysfunction. Additionally, sudden onset of severe pain or pain after an injury warrants immediate medical evaluation."],
                "context_set": ""
              }, 
              {
                "tag": "Headache Causes",
                "patterns": ["What are common causes of headaches?"],
                "responses": ["Headaches can be caused by various factors including stress, tension, dehydration, lack of sleep, eyestrain, sinus congestion, or more serious conditions such as migraines or head injuries. It's important to seek medical evaluation for persistent or severe headaches to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Headaches",
                "patterns": ["How serious are headaches?"],
                "responses": ["While most headaches are not serious and can be managed with self-care measures, some headaches, such as migraines or those accompanied by neurological symptoms, can be indicative of more serious conditions. If you experience sudden, severe headaches or headaches that interfere with daily activities, seek medical attention."],
                "context_set": ""
              },
              {
                "tag": "Tension Headaches",
                "patterns": ["What are tension headaches?"],
                "responses": ["Tension headaches are the most common type of headache and are often described as a dull, achy pain or pressure sensation around the head. They are usually caused by muscle tension in the neck and scalp and can be triggered by stress, poor posture, or fatigue."],
                "context_set": ""
              },
              {
                "tag": "Migraine Headaches",
                "patterns": ["What are migraines?"],
                "responses": ["Migraines are a type of headache characterized by throbbing pain, often on one side of the head, along with other symptoms such as nausea, vomiting, and sensitivity to light and sound. Migraines can be debilitating and may require medical treatment for management."],
                "context_set": ""
              },
              {
                "tag": "Headache Triggers",
                "patterns": ["What can trigger headaches?"],
                "responses": ["Common headache triggers include stress, lack of sleep, dehydration, skipping meals, caffeine withdrawal, certain foods or food additives, environmental factors such as strong smells or loud noises, and hormonal changes in women. Identifying and avoiding triggers can help prevent headaches."],
                "context_set": ""
              },
              {
                "tag": "Headache Relief Techniques",
                "patterns": ["How can I relieve headaches without medication?"],
                "responses": ["Non-medication approaches to relieving headaches include applying cold or warm compresses to the forehead or neck, practicing relaxation techniques such as deep breathing or meditation, maintaining good hydration, getting adequate sleep, and practicing good posture."],
                "context_set": ""
              },
              {
                "tag": "Headache and Medical Evaluation",
                "patterns": ["When should I see a doctor for headaches?"],
                "responses": ["You should consider seeking medical attention for headaches if they are severe or persistent, if they are accompanied by other symptoms such as fever, nausea, vomiting, or neurological symptoms like confusion or weakness, or if they worsen over time. Sudden, severe headaches may require urgent medical evaluation."],
                "context_set": ""
              },
              {
                "tag": "Headache Prevention",
                "patterns": ["How can I prevent headaches?"],
                "responses": ["To prevent headaches, it's important to maintain a healthy lifestyle by managing stress, staying hydrated, getting regular exercise, practicing good sleep hygiene, eating balanced meals, avoiding known triggers, and maintaining good posture. If headaches persist despite these measures, seek medical evaluation."],
                "context_set": ""
              },
              {
                "tag": "Cluster Headaches",
                "patterns": ["What are cluster headaches?"],
                "responses": ["Cluster headaches are a rare but severe type of headache characterized by intense, stabbing pain typically around one eye. They often occur in clusters or patterns and can be accompanied by other symptoms such as redness or tearing of the eye, nasal congestion, or restlessness."],
                "context_set": ""
              },
              {
                "tag": "Headache Location",
                "patterns": ["Does the location of the headache matter?"],
                "responses": ["The location of the headache can provide clues to its underlying cause. For example, tension headaches often cause a band-like pain around the forehead or temples, while migraines often cause throbbing pain on one side of the head. It's important to pay attention to the location and other accompanying symptoms for proper diagnosis and treatment."],
                "context_set": ""
              }, 
              {
                "tag": "Shoulder Pain Causes",
                "patterns": ["What are common causes of shoulder pain?"],
                "responses": ["Shoulder pain can be caused by various factors including muscle strain, rotator cuff injuries, tendonitis, bursitis, arthritis, shoulder dislocation, or referred pain from other areas like the neck or upper back. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Shoulder Pain",
                "patterns": ["How serious is shoulder pain?"],
                "responses": ["Shoulder pain can range from mild discomfort to severe pain that affects mobility and daily activities. While many cases of shoulder pain improve with self-care measures, persistent or severe pain, especially if accompanied by other symptoms like weakness or numbness, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Rotator Cuff Injuries",
                "patterns": ["What are rotator cuff injuries?"],
                "responses": ["Rotator cuff injuries involve damage or inflammation to the muscles and tendons that surround the shoulder joint. They can result from overuse, trauma, or degenerative changes and are a common cause of shoulder pain, especially in athletes and older adults."],
                "context_set": ""
              },
              {
                "tag": "Shoulder Pain and Range of Motion",
                "patterns": ["I have shoulder pain that limits my range of motion. What could be causing this?"],
                "responses": ["Limited range of motion in the shoulder could be due to various reasons including muscle tightness, joint stiffness, or structural issues such as a rotator cuff tear or frozen shoulder. It's important to see a healthcare professional for proper diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Shoulder Pain and Sleep",
                "patterns": ["How can I sleep better with shoulder pain?"],
                "responses": ["Sleeping on your back or on the unaffected side with a pillow between your arms can help alleviate shoulder pain while sleeping. Additionally, using a supportive mattress and avoiding sleeping on the affected shoulder can also help reduce discomfort."],
                "context_set": ""
              },
              {
                "tag": "Shoulder Pain Relief Techniques",
                "patterns": ["How can I relieve shoulder pain without medication?"],
                "responses": ["Non-medication approaches to relieving shoulder pain include applying ice or heat packs, gentle stretching exercises, massage, physical therapy, and using supportive devices such as slings or braces. It's important to consult with a healthcare professional for personalized recommendations."],
                "context_set": ""
              },
              {
                "tag": "Shoulder Pain and Rest",
                "patterns": ["Should I rest my shoulder if it's painful?"],
                "responses": ["While it's important to avoid activities that exacerbate shoulder pain, complete rest may not be necessary or beneficial for recovery. Gentle movement and exercises prescribed by a healthcare professional can help maintain flexibility and strength in the shoulder while promoting healing."],
                "context_set": ""
              },
              {
                "tag": "Shoulder Pain and Posture",
                "patterns": ["How does posture affect shoulder pain?"],
                "responses": ["Poor posture, such as slouching or rounded shoulders, can contribute to shoulder pain by putting strain on the muscles and ligaments surrounding the shoulder joint. Practicing good posture and ergonomic adjustments can help alleviate and prevent shoulder pain."],
                "context_set": ""
              },
              {
                "tag": "Shoulder Pain and Medical Evaluation",
                "patterns": ["When should I see a doctor for shoulder pain?"],
                "responses": ["You should consider seeking medical attention for shoulder pain if it persists for more than a few weeks, if it's accompanied by other symptoms such as swelling, redness, or fever, or if it's associated with trauma or difficulty in performing daily activities. Sudden, severe shoulder pain may require urgent medical evaluation."],
                "context_set": ""
              },
              {
                "tag": "Shoulder Pain and Exercise",
                "patterns": ["Can exercise help with shoulder pain?"],
                "responses": ["Yes, specific exercises and physical therapy can help strengthen the muscles supporting the shoulder joint, improve flexibility, and reduce pain. However, it's important to consult with a healthcare professional before starting any exercise program, especially if experiencing severe or chronic pain."],
                "context_set": ""
              }, 
              {
                "tag": "Neck Pain Causes",
                "patterns": ["What are common causes of neck pain?"],
                "responses": ["Neck pain can be caused by various factors including muscle strain, poor posture, neck injuries, arthritis, herniated discs, nerve compression, or underlying medical conditions. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Neck Pain",
                "patterns": ["How serious is neck pain?"],
                "responses": ["Neck pain can range from mild discomfort to severe pain that affects mobility and daily activities. While many cases of neck pain improve with self-care measures, persistent or severe pain, especially if accompanied by other symptoms like weakness or numbness, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Neck Muscle Strain",
                "patterns": ["What causes neck muscle strain?"],
                "responses": ["Neck muscle strain can occur due to various reasons including poor posture, sudden movements, overuse of neck muscles, or sleeping in an awkward position. It's important to practice good posture and perform neck stretches to prevent muscle strain."],
                "context_set": ""
              },
              {
                "tag": "Neck Pain and Headaches",
                "patterns": ["Can neck pain cause headaches?"],
                "responses": ["Yes, neck pain can sometimes lead to headaches, especially tension-type headaches. Muscle tension and stiffness in the neck can refer pain to the head, resulting in headaches. Addressing the underlying neck issue can help alleviate associated headaches."],
                "context_set": ""
              },
              {
                "tag": "Neck Pain and Sleeping",
                "patterns": ["How can I sleep better with neck pain?"],
                "responses": ["Sleeping on your back or side with a supportive pillow that maintains the natural curve of your neck can help alleviate neck pain while sleeping. Avoid sleeping on your stomach as it can strain the neck muscles and exacerbate pain."],
                "context_set": ""
              },
              {
                "tag": "Neck Pain Relief Techniques",
                "patterns": ["How can I relieve neck pain without medication?"],
                "responses": ["Non-medication approaches to relieving neck pain include applying ice or heat packs, practicing gentle neck stretches and exercises, maintaining good posture, using ergonomic pillows or supports, and getting regular massages or physical therapy sessions."],
                "context_set": ""
              },
              {
                "tag": "Neck Pain and Stress",
                "patterns": ["Can stress contribute to neck pain?"],
                "responses": ["Yes, stress can lead to muscle tension and tightness in the neck and shoulders, resulting in neck pain. Managing stress through relaxation techniques such as deep breathing, meditation, or yoga can help reduce neck pain and prevent recurrence."],
                "context_set": ""
              },
              {
                "tag": "Neck Pain and Medical Evaluation",
                "patterns": ["When should I see a doctor for neck pain?"],
                "responses": ["You should consider seeking medical attention for neck pain if it persists for more than a few weeks, if it's accompanied by other symptoms such as numbness, tingling, weakness, or difficulty in moving the arms or hands, or if it's associated with trauma or injury. Sudden, severe neck pain may require urgent medical evaluation."],
                "context_set": ""
              },
              {
                "tag": "Neck Pain and Posture",
                "patterns": ["How does posture affect neck pain?"],
                "responses": ["Poor posture, such as slouching or holding the head in a forward position for extended periods, can strain the muscles and ligaments in the neck, leading to pain and stiffness. Practicing good posture and ergonomic adjustments can help alleviate and prevent neck pain."],
                "context_set": ""
              },
              {
                "tag": "Neck Pain Prevention",
                "patterns": ["How can I prevent neck pain?"],
                "responses": ["To prevent neck pain, it's important to maintain good posture, avoid prolonged periods of sitting or standing in one position, take frequent breaks to stretch and move the neck and shoulders, use ergonomic furniture and equipment, and manage stress effectively."],
                "context_set": ""
              }, 
              {
                "tag": "Stomach Pain Causes",
                "patterns": ["What are common causes of stomach pain?"],
                "responses": ["Stomach pain can be caused by various factors including indigestion, gas, gastritis, peptic ulcers, constipation, food poisoning, infections, or more serious conditions such as appendicitis or gallstones. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Stomach Pain",
                "patterns": ["How serious is stomach pain?"],
                "responses": ["Stomach pain can range from mild discomfort to severe pain that affects daily activities. While many cases of stomach pain improve with self-care measures, persistent or severe pain, especially if accompanied by other symptoms like fever, vomiting, or difficulty breathing, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Stomach Pain and Digestive Issues",
                "patterns": ["Can digestive issues cause stomach pain?"],
                "responses": ["Yes, digestive issues such as indigestion, gas, gastritis, or constipation can cause stomach pain. These conditions often result from dietary factors, lifestyle habits, or underlying gastrointestinal disorders. Making dietary modifications and practicing good digestive hygiene can help alleviate stomach pain."],
                "context_set": ""
              },
              {
                "tag": "Stomach Pain and Food Poisoning",
                "patterns": ["How can I tell if my stomach pain is due to food poisoning?"],
                "responses": ["Stomach pain accompanied by symptoms like nausea, vomiting, diarrhea, fever, and abdominal cramps may indicate food poisoning. Food poisoning is usually caused by consuming contaminated food or water and typically resolves on its own within a few days. However, severe cases may require medical attention."],
                "context_set": ""
              },
              {
                "tag": "Stomach Pain and Medical Evaluation",
                "patterns": ["When should I see a doctor for stomach pain?"],
                "responses": ["You should consider seeking medical attention for stomach pain if it persists for more than a few days, if it's severe or worsening over time, if it's accompanied by other symptoms such as fever, vomiting, bloody stools, or difficulty breathing, or if it's associated with trauma or injury."],
                "context_set": ""
              },
              {
                "tag": "Stomach Pain Relief Techniques",
                "patterns": ["How can I relieve stomach pain without medication?"],
                "responses": ["Non-medication approaches to relieving stomach pain include resting and avoiding foods that exacerbate symptoms, consuming small, bland meals, staying hydrated with clear fluids, applying heat to the abdomen, practicing relaxation techniques, and using over-the-counter antacids or simethicone for gas relief."],
                "context_set": ""
              },
              {
                "tag": "Stomach Pain and Stress",
                "patterns": ["Can stress contribute to stomach pain?"],
                "responses": ["Yes, stress can affect the digestive system and contribute to stomach pain or exacerbate existing gastrointestinal issues. Managing stress through relaxation techniques such as deep breathing, meditation, or yoga can help alleviate stomach pain and improve overall well-being."],
                "context_set": ""
              },
              {
                "tag": "Stomach Pain and Hydration",
                "patterns": ["Does hydration affect stomach pain?"],
                "responses": ["Yes, dehydration can exacerbate stomach pain and digestive issues. It's important to stay hydrated by drinking plenty of water throughout the day, especially if experiencing diarrhea or vomiting, to replace lost fluids and electrolytes and promote recovery."],
                "context_set": ""
              },
              {
                "tag": "Stomach Pain and Dietary Modifications",
                "patterns": ["Can dietary modifications help with stomach pain?"],
                "responses": ["Yes, making dietary modifications such as avoiding spicy, fatty, or acidic foods, limiting caffeine and alcohol intake, eating smaller, more frequent meals, and incorporating fiber-rich foods can help alleviate stomach pain and improve digestive health."],
                "context_set": ""
              },
              {
                "tag": "Stomach Pain Prevention",
                "patterns": ["How can I prevent stomach pain?"],
                "responses": ["To prevent stomach pain, it's important to maintain a balanced diet, stay hydrated, practice good food hygiene, manage stress effectively, avoid overeating and eating too quickly, maintain a healthy weight, and avoid smoking and excessive alcohol consumption."],
                "context_set": ""
              },   
              {
                "tag": "Elbow Pain Causes",
                "patterns": ["What are common causes of elbow pain?"],
                "responses": ["Elbow pain can be caused by various factors including overuse injuries such as tennis elbow or golfer's elbow, repetitive motions, trauma or impact injuries, arthritis, bursitis, nerve compression, or underlying medical conditions. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Elbow Pain",
                "patterns": ["How serious is elbow pain?"],
                "responses": ["Elbow pain can range from mild discomfort to severe pain that affects daily activities. While many cases of elbow pain improve with self-care measures, persistent or severe pain, especially if accompanied by other symptoms like swelling, redness, or loss of function, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Tennis Elbow",
                "patterns": ["What is tennis elbow?"],
                "responses": ["Tennis elbow, also known as lateral epicondylitis, is a painful condition caused by overuse of the muscles and tendons in the forearm, leading to inflammation of the tendon attachment on the outside of the elbow. It is commonly associated with repetitive gripping and wrist extension motions."],
                "context_set": ""
              },
              {
                "tag": "Golfer's Elbow",
                "patterns": ["What is golfer's elbow?"],
                "responses": ["Golfer's elbow, also known as medial epicondylitis, is a painful condition caused by overuse of the muscles and tendons in the forearm, leading to inflammation of the tendon attachment on the inside of the elbow. It is commonly associated with repetitive gripping and wrist flexion motions."],
                "context_set": ""
              },
              {
                "tag": "Elbow Pain and Range of Motion",
                "patterns": ["I have elbow pain that limits my range of motion. What could be causing this?"],
                "responses": ["Limited range of motion in the elbow could be due to various reasons including muscle or tendon injury, arthritis, joint inflammation, or nerve compression. It's important to see a healthcare professional for proper diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Elbow Pain Relief Techniques",
                "patterns": ["How can I relieve elbow pain without medication?"],
                "responses": ["Non-medication approaches to relieving elbow pain include resting and avoiding activities that exacerbate symptoms, applying ice or heat packs, performing gentle stretching and strengthening exercises, using elbow braces or supports, and receiving physical therapy or massage therapy."],
                "context_set": ""
              },
              {
                "tag": "Elbow Pain and Rest",
                "patterns": ["Should I rest my elbow if it's painful?"],
                "responses": ["While it's important to avoid activities that exacerbate elbow pain, complete rest may not be necessary or beneficial for recovery. Gradual return to activities with modifications and proper technique, along with targeted exercises and physical therapy, can help promote healing and prevent recurrence."],
                "context_set": ""
              },
              {
                "tag": "Elbow Pain and Posture",
                "patterns": ["How does posture affect elbow pain?"],
                "responses": ["Poor posture, such as slouching or rounding the shoulders, can contribute to elbow pain by altering the mechanics of the arm and placing strain on the muscles and tendons. Practicing good posture and ergonomic adjustments can help alleviate and prevent elbow pain."],
                "context_set": ""
              },
              {
                "tag": "Elbow Pain and Medical Evaluation",
                "patterns": ["When should I see a doctor for elbow pain?"],
                "responses": ["You should consider seeking medical attention for elbow pain if it persists for more than a few weeks, if it's severe or worsening over time, if it's accompanied by other symptoms such as swelling, redness, or inability to straighten the arm, or if it's associated with trauma or injury."],
                "context_set": ""
              },
              {
                "tag": "Elbow Pain and Exercise",
                "patterns": ["Can exercise help with elbow pain?"],
                "responses": ["Yes, specific exercises and physical therapy can help strengthen the muscles supporting the elbow joint, improve flexibility, and reduce pain. However, it's important to consult with a healthcare professional before starting any exercise program, especially if experiencing severe or chronic pain."],
                "context_set": ""
              }, 
              {
                "tag": "Hip Pain Causes",
                "patterns": ["What are common causes of hip pain?"],
                "responses": ["Hip pain can be caused by various factors including osteoarthritis, bursitis, tendonitis, muscle strain, hip fractures, labral tears, sciatica, or referred pain from the lower back or pelvis. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Hip Pain",
                "patterns": ["How serious is hip pain?"],
                "responses": ["Hip pain can range from mild discomfort to severe pain that affects mobility and daily activities. While many cases of hip pain improve with self-care measures, persistent or severe pain, especially if accompanied by other symptoms like swelling, redness, or loss of function, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Hip Pain and Osteoarthritis",
                "patterns": ["Can hip pain be caused by osteoarthritis?"],
                "responses": ["Yes, osteoarthritis is a common cause of hip pain, especially in older adults. It occurs when the protective cartilage in the hip joint wears down over time, leading to pain, stiffness, and reduced range of motion. Treatment options include medications, physical therapy, and in severe cases, surgery."],
                "context_set": ""
              },
              {
                "tag": "Hip Pain and Bursitis",
                "patterns": ["What is hip bursitis?"],
                "responses": ["Hip bursitis is inflammation of the bursa, small fluid-filled sacs that cushion the hip joint. It can cause pain, swelling, and tenderness in the hip area, especially with movement. Treatment may include rest, ice, physical therapy, and corticosteroid injections."],
                "context_set": ""
              },
              {
                "tag": "Hip Pain and Muscle Strain",
                "patterns": ["Can hip pain be caused by muscle strain?"],
                "responses": ["Yes, hip pain can result from muscle strain or overuse injuries, especially in athletes or individuals who engage in repetitive activities. Rest, ice, compression, and elevation (RICE), along with stretching and strengthening exercises, can help alleviate hip pain due to muscle strain."],
                "context_set": "" 
              },  
              {
                "tag": "Wrist Pain Causes",
                "patterns": ["What are common causes of wrist pain?"],
                "responses": ["Wrist pain can be caused by various factors including repetitive strain injuries, carpal tunnel syndrome, tendonitis, sprains or strains, arthritis, fractures, nerve compression, or underlying medical conditions. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Wrist Pain",
                "patterns": ["How serious is wrist pain?"],
                "responses": ["Wrist pain can range from mild discomfort to severe pain that affects daily activities. While many cases of wrist pain improve with self-care measures, persistent or severe pain, especially if accompanied by other symptoms like swelling, numbness, or loss of function, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Carpal Tunnel Syndrome",
                "patterns": ["What is carpal tunnel syndrome?"],
                "responses": ["Carpal tunnel syndrome is a condition caused by compression of the median nerve as it passes through the carpal tunnel in the wrist. It leads to symptoms such as pain, numbness, tingling, and weakness in the hand and fingers. It's often associated with repetitive hand and wrist movements."],
                "context_set": ""
              },
              {
                "tag": "Wrist Sprains and Strains",
                "patterns": ["How do wrist sprains and strains occur?"],
                "responses": ["Wrist sprains and strains occur when the ligaments or muscles in the wrist are stretched or torn due to sudden impact, force, or overuse. Common causes include falls onto an outstretched hand, repetitive motions, or sudden twisting movements."],
                "context_set": ""
              },
              {
                "tag": "Wrist Pain and Range of Motion",
                "patterns": ["I have wrist pain that limits my range of motion. What could be causing this?"],
                "responses": ["Limited range of motion in the wrist could be due to various reasons including injury, inflammation, arthritis, or nerve compression. It's important to see a healthcare professional for proper diagnosis and treatment to restore mobility and function."],
                "context_set": ""
              },
              {
                "tag": "Wrist Pain Relief Techniques",
                "patterns": ["How can I relieve wrist pain without medication?"],
                "responses": ["Non-medication approaches to relieving wrist pain include resting and avoiding activities that exacerbate symptoms, applying ice or heat packs, wearing a wrist splint or brace for support, performing gentle stretching and strengthening exercises, and receiving physical therapy or massage therapy."],
                "context_set": ""
              },
              {
                "tag": "Wrist Pain and Rest",
                "patterns": ["Should I rest my wrist if it's painful?"],
                "responses": ["While it's important to avoid activities that exacerbate wrist pain, complete rest may not be necessary or beneficial for recovery. Gradual return to activities with modifications and proper technique, along with targeted exercises and physical therapy, can help promote healing and prevent recurrence."],
                "context_set": ""
              },
              {
                "tag": "Wrist Pain and Posture",
                "patterns": ["How does posture affect wrist pain?"],
                "responses": ["Poor wrist posture, such as repetitive bending or awkward positioning, can contribute to wrist pain by placing strain on the muscles, tendons, and nerves. Practicing ergonomic principles and using proper wrist alignment during activities can help alleviate and prevent wrist pain."],
                "context_set": ""
              },
              {
                "tag": "Wrist Pain and Medical Evaluation",
                "patterns": ["When should I see a doctor for wrist pain?"],
                "responses": ["You should consider seeking medical attention for wrist pain if it persists for more than a few weeks, if it's severe or worsening over time, if it's accompanied by other symptoms such as swelling, redness, or inability to move the wrist, or if it's associated with trauma or injury."],
                "context_set": ""
              },
              {
                "tag": "Wrist Pain and Exercise",
                "patterns": ["Can exercise help with wrist pain?"],
                "responses": ["Yes, specific exercises and physical therapy can help strengthen the muscles supporting the wrist joint, improve flexibility, and reduce pain. However, it's important to consult with a healthcare professional before starting any exercise program, especially if experiencing severe or chronic pain."],
                "context_set": ""
              } , 
              {
                "tag": "Knee Pain Causes",
                "patterns": ["What are common causes of knee pain?"],
                "responses": ["Knee pain can be caused by various factors including injuries such as ligament tears, meniscus tears, or fractures, overuse or repetitive strain injuries, osteoarthritis, rheumatoid arthritis, tendonitis, bursitis, or underlying medical conditions. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Knee Pain",
                "patterns": ["How serious is knee pain?"],
                "responses": ["Knee pain can range from mild discomfort to severe pain that affects mobility and daily activities. While many cases of knee pain improve with self-care measures, persistent or severe pain, especially if accompanied by other symptoms like swelling, instability, or difficulty bearing weight, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Knee Injuries",
                "patterns": ["What are common knee injuries?"],
                "responses": ["Common knee injuries include ligament sprains or tears (such as ACL, MCL, or PCL tears), meniscus tears, fractures, patellar tendonitis (jumper's knee), or bursitis. These injuries can result from sports activities, accidents, or overuse."],
                "context_set": ""
              },
              {
                "tag": "Knee Pain and Range of Motion",
                "patterns": ["I have knee pain that limits my range of motion. What could be causing this?"],
                "responses": ["Limited range of motion in the knee could be due to various reasons including injury, inflammation, arthritis, or mechanical issues such as loose bodies or cartilage damage. It's important to see a healthcare professional for proper diagnosis and treatment to restore mobility and function."],
                "context_set": ""
              },
              {
                "tag": "Knee Pain Relief Techniques",
                "patterns": ["How can I relieve knee pain without medication?"],
                "responses": ["Non-medication approaches to relieving knee pain include resting and avoiding activities that exacerbate symptoms, applying ice or heat packs, using compression wraps or braces for support, performing gentle stretching and strengthening exercises, and receiving physical therapy or acupuncture."],
                "context_set": ""
              },
              {
                "tag": "Knee Pain and Rest",
                "patterns": ["Should I rest my knee if it's painful?"],
                "responses": ["While it's important to avoid activities that exacerbate knee pain, complete rest may not be necessary or beneficial for recovery. Gradual return to activities with modifications and proper technique, along with targeted exercises and physical therapy, can help promote healing and prevent recurrence."],
                "context_set": ""
              },
              {
                "tag": "Knee Pain and Posture",
                "patterns": ["How does posture affect knee pain?"],
                "responses": ["Poor posture, such as standing or sitting with improper alignment or putting excessive strain on the knees, can contribute to knee pain. Practicing good posture and ergonomic adjustments can help alleviate and prevent knee pain."],
                "context_set": ""
              },
              {
                "tag": "Knee Pain and Medical Evaluation",
                "patterns": ["When should I see a doctor for knee pain?"],
                "responses": ["You should consider seeking medical attention for knee pain if it persists for more than a few weeks, if it's severe or worsening over time, if it's accompanied by other symptoms such as swelling, redness, or instability, or if it's associated with trauma or injury."],
                "context_set": ""
              },
              {
                "tag": "Knee Pain and Exercise",
                "patterns": ["Can exercise help with knee pain?"],
                "responses": ["Yes, specific exercises and physical therapy can help strengthen the muscles supporting the knee joint, improve flexibility, and reduce pain. However, it's important to consult with a healthcare professional before starting any exercise program, especially if experiencing severe or chronic pain."],
                "context_set": ""
              },
              {
                "tag": "Knee Pain Prevention",
                "patterns": ["How can I prevent knee pain?"],
                "responses": ["To prevent knee pain, it's important to maintain a healthy weight, stay active with regular exercise, use proper techniques and protective gear during sports activities, avoid sudden changes in activity level, and address any underlying issues such as muscle weakness or poor flexibility."],
                "context_set": ""
              },  
              {
                "tag": "Buttock Pain Causes",
                "patterns": ["What are common causes of buttock pain?"],
                "responses": ["Buttock pain can be caused by various factors including muscle strain, ligament sprain, sciatica, piriformis syndrome, sacroiliac joint dysfunction, hip arthritis, bursitis, or referred pain from lumbar spine issues. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Buttock Pain",
                "patterns": ["How serious is buttock pain?"],
                "responses": ["Buttock pain can range from mild discomfort to severe pain that affects mobility and daily activities. While many cases of buttock pain improve with self-care measures, persistent or severe pain, especially if accompanied by other symptoms like numbness, tingling, or weakness, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Sciatica",
                "patterns": ["What is sciatica?"],
                "responses": ["Sciatica is a condition characterized by pain that radiates along the sciatic nerve, which runs from the lower back down the buttocks and legs. It is often caused by compression or irritation of the sciatic nerve due to conditions such as herniated disc, spinal stenosis, or piriformis syndrome."],
                "context_set": ""
              },
              {
                "tag": "Piriformis Syndrome",
                "patterns": ["What is piriformis syndrome?"],
                "responses": ["Piriformis syndrome is a condition characterized by pain in the buttocks that may radiate down the leg, often due to irritation or compression of the sciatic nerve by the piriformis muscle. It can result from overuse, muscle imbalances, or trauma to the area."],
                "context_set": ""
              },
              {
                "tag": "Buttock Pain and Sitting",
                "patterns": ["Why does my buttock pain worsen when I sit?"],
                "responses": ["Buttock pain that worsens with sitting may be related to conditions such as piriformis syndrome, sciatica, or sacroiliac joint dysfunction, which can be aggravated by prolonged sitting or pressure on the buttocks. Changing positions frequently, using cushions or ergonomic seating, and stretching can help alleviate discomfort."],
                "context_set": ""
              },
              {
                "tag": "Buttock Pain Relief Techniques",
                "patterns": ["How can I relieve buttock pain without medication?"],
                "responses": ["Non-medication approaches to relieving buttock pain include resting and avoiding activities that exacerbate symptoms, applying ice or heat packs, performing gentle stretching and strengthening exercises, using supportive cushions or pillows, and receiving physical therapy or massage therapy."],
                "context_set": ""
              },
              {
                "tag": "Buttock Pain and Exercise",
                "patterns": ["Can exercise help with buttock pain?"],
                "responses": ["Yes, specific exercises and physical therapy can help strengthen the muscles around the buttocks, improve flexibility, and reduce pain. However, it's important to consult with a healthcare professional before starting any exercise program, especially if experiencing severe or chronic pain."],
                "context_set": ""
              },
              {
                "tag": "Buttock Pain and Medical Evaluation",
                "patterns": ["When should I see a doctor for buttock pain?"],
                "responses": ["You should consider seeking medical attention for buttock pain if it persists for more than a few weeks, if it's severe or worsening over time, if it's accompanied by other symptoms such as numbness, tingling, or weakness, or if it's associated with trauma or injury."],
                "context_set": ""
              },
              {
                "tag": "Buttock Pain and Posture",
                "patterns": ["How does posture affect buttock pain?"],
                "responses": ["Poor posture, such as slouching or sitting for prolonged periods with improper alignment, can contribute to buttock pain by placing strain on the muscles, ligaments, and nerves in the lower back and buttocks. Practicing good posture and ergonomic adjustments can help alleviate and prevent buttock pain."],
                "context_set": ""
              },
              {
                "tag": "Buttock Pain Prevention",
                "patterns": ["How can I prevent buttock pain?"],
                "responses": ["To prevent buttock pain, it's important to maintain a healthy weight, stay active with regular exercise, practice proper body mechanics and lifting techniques, avoid prolonged sitting or standing in one position, use supportive seating and ergonomic equipment, and address any underlying musculoskeletal issues."],
                "context_set": ""
              },    
              {
                "tag": "Penis Pain Causes",
                "patterns": ["What are common causes of penis pain?"],
                "responses": ["Penis pain can be caused by various factors including injury, inflammation, infection, sexually transmitted infections (STIs), urinary tract infections (UTIs), penile trauma, priapism, Peyronie's disease, or other underlying medical conditions. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Penis Pain",
                "patterns": ["How serious is penis pain?"],
                "responses": ["Penis pain can range from mild discomfort to severe pain that affects daily activities and quality of life. While many cases of penis pain improve with self-care measures, persistent or severe pain, especially if accompanied by other symptoms like swelling, redness, discharge, or difficulty urinating, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Penile Injuries",
                "patterns": ["What are common penile injuries?"],
                "responses": ["Common penile injuries include trauma from accidents, sports activities, or sexual intercourse, penile fractures (rupture of the tunica albuginea), and lacerations or cuts. These injuries can result in pain, swelling, bruising, and difficulty with erections."],
                "context_set": ""
              },
              {
                "tag": "Penis Pain and Sexual Activity",
                "patterns": ["Why does penis pain occur during or after sexual activity?"],
                "responses": ["Penis pain during or after sexual activity may be due to various reasons including friction, abrasions, sensitivity, or underlying conditions such as infection or inflammation. Using lubrication, practicing safe sex, and communicating with sexual partners can help prevent discomfort."],
                "context_set": ""
              },
              {
                "tag": "Penis Pain Relief Techniques",
                "patterns": ["How can I relieve penis pain without medication?"],
                "responses": ["Non-medication approaches to relieving penis pain include resting and avoiding activities that exacerbate symptoms, applying ice packs or warm compresses, practicing good hygiene, wearing loose-fitting clothing, and avoiding sexual activity until the pain resolves."],
                "context_set": ""
              },
              {
                "tag": "Penis Pain and Medical Evaluation",
                "patterns": ["When should I see a doctor for penis pain?"],
                "responses": ["You should consider seeking medical attention for penis pain if it persists for more than a few days, if it's severe or worsening over time, if it's accompanied by other symptoms such as swelling, redness, discharge, fever, or difficulty urinating, or if it's associated with trauma or injury."],
                "context_set": ""
              },
              {
                "tag": "Priapism",
                "patterns": ["What is priapism?"],
                "responses": ["Priapism is a persistent and painful erection that lasts for more than four hours without sexual stimulation. It can be caused by various factors including blood clotting disorders, certain medications, illicit drug use, or underlying medical conditions. Priapism is considered a medical emergency and requires immediate medical attention to prevent complications."],
                "context_set": ""
              },
              {
                "tag": "Peyronie's Disease",
                "patterns": ["What is Peyronie's disease?"],
                "responses": ["Peyronie's disease is a condition characterized by the development of fibrous scar tissue (plaques) in the penis, leading to curvature, pain, and difficulty with erections. The exact cause is unknown, but it may result from injury or inflammation. Treatment options include medications, injections, or surgery."],
                "context_set": ""
              },
              {
                "tag": "Penis Pain Prevention",
                "patterns": ["How can I prevent penis pain?"],
                "responses": ["To prevent penis pain, it's important to practice safe sex, maintain good hygiene, avoid risky sexual behaviors, use lubrication during sexual activity, wear protective gear during sports or activities that could result in injury, and seek prompt medical attention for any signs of infection or inflammation."],
                "context_set": ""
              },
              {
                "tag": "Penis Pain and Hygiene",
                "patterns": ["How does hygiene affect penis pain?"],
                "responses": ["Poor hygiene, such as inadequate cleaning of the genital area, can contribute to penis pain by increasing the risk of infections, irritation, and inflammation. Practicing good hygiene including regular washing with mild soap and water can help prevent discomfort and maintain genital health."],
                "context_set": ""
              },   
              {
                "tag": "Ear Pain Causes",
                "patterns": ["What are common causes of ear pain?"],
                "responses": ["Ear pain can be caused by various factors including ear infections (otitis media or otitis externa), sinus infections, dental issues, temporomandibular joint (TMJ) disorder, impacted earwax, eustachian tube dysfunction, barotrauma, or foreign objects in the ear canal. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Ear Pain",
                "patterns": ["How serious is ear pain?"],
                "responses": ["Ear pain can range from mild discomfort to severe pain that affects hearing and quality of life. While many cases of ear pain improve with self-care measures, persistent or severe pain, especially if accompanied by other symptoms like fever, hearing loss, drainage from the ear, or dizziness, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Ear Infections",
                "patterns": ["What are common ear infections?"],
                "responses": ["Common ear infections include otitis media (middle ear infection) and otitis externa (swimmer's ear). Otitis media typically involves fluid buildup and inflammation behind the eardrum, often due to respiratory infections, while otitis externa involves inflammation of the ear canal, often due to moisture or trauma."],
                "context_set": ""
              },
              {
                "tag": "Ear Pain and Hearing Loss",
                "patterns": ["Why does ear pain sometimes accompany hearing loss?"],
                "responses": ["Ear pain may accompany hearing loss due to various reasons including ear infections, fluid buildup in the middle ear, eustachian tube dysfunction, damage to the eardrum or middle ear structures, or other underlying conditions affecting the auditory system. Seeking medical evaluation can help identify the cause and appropriate treatment."],
                "context_set": ""
              },
              {
                "tag": "Ear Pain Relief Techniques",
                "patterns": ["How can I relieve ear pain without medication?"],
                "responses": ["Non-medication approaches to relieving ear pain include applying warm compresses to the affected ear, using over-the-counter ear drops for wax removal or pain relief (if not contraindicated), practicing proper ear hygiene, avoiding exposure to loud noises or irritants, and maintaining proper hydration."],
                "context_set": ""
              },
              {
                "tag": "Ear Pain and Medical Evaluation",
                "patterns": ["When should I see a doctor for ear pain?"],
                "responses": ["You should consider seeking medical attention for ear pain if it persists for more than a few days, if it's severe or worsening over time, if it's accompanied by other symptoms such as fever, hearing loss, drainage from the ear, or dizziness, or if it's associated with trauma or injury."],
                "context_set": ""
              },
              {
                "tag": "Eustachian Tube Dysfunction",
                "patterns": ["What is eustachian tube dysfunction?"],
                "responses": ["Eustachian tube dysfunction is a condition characterized by blockage or dysfunction of the eustachian tube, which connects the middle ear to the back of the nose and helps equalize pressure. It can lead to symptoms such as ear pain, pressure, fullness, or hearing loss, often associated with changes in altitude, colds, or allergies."],
                "context_set": ""
              },
              {
                "tag": "Barotrauma",
                "patterns": ["What is barotrauma?"],
                "responses": ["Barotrauma is ear pain or discomfort caused by changes in pressure, often experienced during activities such as flying in an airplane, scuba diving, or driving in mountainous areas. It can result in symptoms such as ear popping, fullness, or pain due to unequal pressure between the middle ear and the surrounding environment."],
                "context_set": ""
              },
              {
                "tag": "Foreign Object in Ear",
                "patterns": ["What should I do if I suspect a foreign object in my ear?"],
                "responses": ["If you suspect a foreign object in your ear and experience pain or discomfort, it's important to avoid inserting anything into the ear canal. Instead, seek medical attention promptly for safe removal by a healthcare professional to prevent injury or further complications."],
                "context_set": ""
              },
              {
                "tag": "Preventive Ear Care",
                "patterns": ["How can I prevent ear pain?"],
                "responses": ["To prevent ear pain, it's important to practice good ear hygiene, avoid inserting objects into the ear canal, use ear protection in noisy environments or during water activities, treat underlying conditions promptly (such as allergies or sinus infections), and seek medical evaluation for recurrent or persistent ear symptoms."],
                "context_set": ""
              },  
              {
                "tag": "Nose Pain Causes",
                "patterns": ["What are common causes of nose pain?"],
                "responses": ["Nose pain can be caused by various factors including sinus infections (sinusitis), nasal congestion, nasal trauma or injury, nasal polyps, deviated septum, allergic rhinitis, dry air, foreign objects in the nose, or other underlying medical conditions. It's important to seek medical evaluation to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Severity of Nose Pain",
                "patterns": ["How serious is nose pain?"],
                "responses": ["Nose pain can range from mild discomfort to severe pain that affects breathing and quality of life. While many cases of nose pain improve with self-care measures, persistent or severe pain, especially if accompanied by other symptoms like fever, nasal discharge, difficulty breathing, or facial swelling, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Sinusitis",
                "patterns": ["What is sinusitis?"],
                "responses": ["Sinusitis is inflammation or infection of the sinus cavities, often resulting from viral or bacterial infections, allergies, or nasal polyps. Symptoms may include nasal congestion, facial pain or pressure, headache, cough, and postnasal drip. Treatment may involve medications, nasal irrigation, or in severe cases, surgery."],
                "context_set": ""
              },
              {
                "tag": "Nasal Congestion",
                "patterns": ["Why does nose pain sometimes accompany nasal congestion?"],
                "responses": ["Nose pain may accompany nasal congestion due to various reasons including sinusitis, allergies, common cold, or nasal polyps. Nasal congestion can cause pressure and discomfort in the nasal passages and sinuses, leading to pain or headache. Proper management of congestion can help alleviate nose pain."],
                "context_set": ""
              },
              {
                "tag": "Nose Pain and Nasal Trauma",
                "patterns": ["How does nasal trauma cause nose pain?"],
                "responses": ["Nasal trauma, such as blunt force injury, nose picking, or nasal surgery, can cause pain, swelling, and bruising in the nose. In some cases, it may lead to nasal fractures or septal hematoma. Seeking medical evaluation is important to assess the extent of injury and prevent complications."],
                "context_set": ""
              },
              {
                "tag": "Nose Pain Relief Techniques",
                "patterns": ["How can I relieve nose pain without medication?"],
                "responses": ["Non-medication approaches to relieving nose pain include applying warm compresses to the affected area, using saline nasal sprays or nasal irrigation to moisten and clear the nasal passages, inhaling steam, maintaining proper hydration, and avoiding irritants such as smoke or strong odors."],
                "context_set": ""
              },
              {
                "tag": "Nose Pain and Medical Evaluation",
                "patterns": ["When should I see a doctor for nose pain?"],
                "responses": ["You should consider seeking medical attention for nose pain if it persists for more than a few days, if it's severe or worsening over time, if it's accompanied by other symptoms such as fever, nasal discharge, difficulty breathing, or facial swelling, or if it's associated with trauma or injury."],
                "context_set": ""
              },
              {
                "tag": "Nosebleeds",
                "patterns": ["What should I do if I have nosebleeds along with nose pain?"],
                "responses": ["If you experience nosebleeds along with nose pain, it's important to sit upright and lean forward to prevent swallowing blood, pinch the nostrils together for about 10-15 minutes to stop the bleeding, avoid blowing your nose, and seek medical attention if bleeding persists or if nosebleeds recur frequently."],
                "context_set": ""
              },
              {
                "tag": "Nasal Polyps",
                "patterns": ["What are nasal polyps?"],
                "responses": ["Nasal polyps are noncancerous growths that form in the lining of the nasal passages or sinuses, often due to chronic inflammation from conditions like sinusitis, allergies, or asthma. They can cause symptoms such as nasal congestion, loss of smell, facial pain or pressure, and runny nose. Treatment may involve medications or surgery."],
                "context_set": ""
              },
              {
                "tag": "Nose Pain Prevention",
                "patterns": ["How can I prevent nose pain?"],
                "responses": ["To prevent nose pain, it's important to maintain good nasal hygiene, use humidifiers to keep the air moist, avoid irritants such as smoke or strong odors, manage allergies and sinusitis promptly, practice proper technique during nose blowing, and seek medical evaluation for recurrent or persistent nasal symptoms."],
                "context_set": ""
              }, 
              {
                "tag": "Breathing Problem Causes",
                "patterns": ["What are common causes of breathing problems?"],
                "responses": ["Breathing problems can be caused by various factors including respiratory infections (such as colds, flu, or pneumonia), allergies, asthma, chronic obstructive pulmonary disease (COPD), pulmonary embolism, heart conditions, anxiety or panic attacks, obesity, or environmental factors like pollution or smoke exposure."],
                "context_set": ""
              },
              {
                "tag": "Severity of Breathing Problems",
                "patterns": ["How serious are breathing problems?"],
                "responses": ["Breathing problems can range from mild shortness of breath to severe difficulty breathing that requires immediate medical attention. While many cases of breathing problems improve with self-care measures or treatment, persistent or severe difficulty breathing, especially if accompanied by other symptoms like chest pain, wheezing, or fainting, should prompt a visit to a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Asthma",
                "patterns": ["What is asthma?"],
                "responses": ["Asthma is a chronic respiratory condition characterized by inflammation and narrowing of the airways, leading to symptoms such as wheezing, coughing, chest tightness, and shortness of breath. Triggers may include allergens, respiratory infections, exercise, cold air, or stress. Treatment involves medications and management of triggers."],
                "context_set": ""
              },
              {
                "tag": "COPD",
                "patterns": ["What is chronic obstructive pulmonary disease (COPD)?"],
                "responses": ["COPD is a progressive lung disease that includes chronic bronchitis and emphysema, often caused by long-term exposure to irritants like cigarette smoke. It leads to symptoms such as coughing, wheezing, shortness of breath, and chest tightness. Management involves medications, pulmonary rehabilitation, and lifestyle changes."],
                "context_set": ""
              },
              {
                "tag": "Pulmonary Embolism",
                "patterns": ["What is a pulmonary embolism?"],
                "responses": ["A pulmonary embolism is a blockage in one of the pulmonary arteries in the lungs, usually caused by blood clots that travel from elsewhere in the body, often the legs. Symptoms may include sudden shortness of breath, chest pain, rapid heart rate, and coughing up blood. It's a medical emergency requiring immediate treatment."],
                "context_set": ""
              },
              {
                "tag": "Anxiety and Breathing",
                "patterns": ["How does anxiety affect breathing?"],
                "responses": ["Anxiety can affect breathing by triggering the body's stress response, leading to rapid breathing (hyperventilation) or shallow breathing. This can result in symptoms such as shortness of breath, chest tightness, dizziness, or tingling sensations. Managing anxiety through relaxation techniques or therapy can help improve breathing."],
                "context_set": ""
              },
              {
                "tag": "Breathing Problem Relief Techniques",
                "patterns": ["How can I relieve breathing problems without medication?"],
                "responses": ["Non-medication approaches to relieving breathing problems include practicing relaxation techniques such as deep breathing exercises, pursed-lip breathing, or progressive muscle relaxation, maintaining proper posture, avoiding triggers such as allergens or smoke, and using air filters or humidifiers to improve air quality."],
                "context_set": ""
              },
              {
                "tag": "Breathing Problem and Exercise",
                "patterns": ["Can exercise help with breathing problems?"],
                "responses": ["Yes, regular exercise can help improve lung function, increase endurance, and reduce symptoms in some individuals with breathing problems such as asthma or COPD. However, it's important to consult with a healthcare professional before starting any exercise program, especially if experiencing severe or chronic breathing difficulties."],
                "context_set": ""
              },
              {
                "tag": "Breathing Problem and Medical Evaluation",
                "patterns": ["When should I see a doctor for breathing problems?"],
                "responses": ["You should consider seeking medical attention for breathing problems if they persist for more than a few days, if they're severe or worsening over time, if they're accompanied by other symptoms such as chest pain, wheezing, coughing up blood, or fainting, or if they're associated with a known heart or lung condition."],
                "context_set": ""
              },
              {
                "tag": "Breathing Problem Prevention",
                "patterns": ["How can I prevent breathing problems?"],
                "responses": ["To prevent breathing problems, it's important to avoid exposure to known triggers such as smoke, pollution, allergens, or respiratory infections, practice good hygiene, maintain a healthy lifestyle including regular exercise and a balanced diet, manage stress and anxiety, and seek prompt medical attention for any underlying respiratory or cardiac conditions."],
                "context_set": ""
              }, 
              {
                "tag": "CPR Basics",
                "patterns": ["What are the basics of CPR?"],
                "responses": ["CPR, or cardiopulmonary resuscitation, is an emergency procedure performed to manually preserve brain function until further measures can be taken to restore spontaneous blood circulation and breathing in a person experiencing cardiac arrest. It involves chest compressions and rescue breaths to circulate oxygenated blood throughout the body."],
                "context_set": ""
              },
              {
                "tag": "When to Perform CPR",
                "patterns": ["When should I perform CPR?"],
                "responses": ["CPR should be performed immediately if you encounter someone who is unresponsive, not breathing, or only gasping. In cases of sudden cardiac arrest, every minute without CPR decreases the chance of survival, so it's crucial to act quickly and initiate CPR while waiting for emergency medical services (EMS) to arrive."],
                "context_set": ""
              },
              {
                "tag": "Steps of CPR",
                "patterns": ["What are the steps of performing CPR?"],
                "responses": ["The steps of CPR typically include: 1. Check for responsiveness: Tap the person and shout, 'Are you okay?' 2. Call for help: Call emergency services (911 or local emergency number) or instruct someone else to do so. 3. Perform chest compressions: Place the heel of one hand on the center of the person's chest, interlock fingers, and push hard and fast (at least 100-120 compressions per minute). 4. Open the airway: Tilt the head back and lift the chin to open the airway. 5. Give rescue breaths: Pinch the nose closed, make a complete seal over the person's mouth, and give two rescue breaths."],
                "context_set": ""
              },
              {
                "tag": "Hands-Only CPR",
                "patterns": ["What is hands-only CPR?"],
                "responses": ["Hands-only CPR involves performing chest compressions without rescue breaths. It is recommended for untrained bystanders or those unwilling to perform rescue breaths. The key is to push hard and fast on the center of the chest, allowing the chest to recoil fully between compressions, until help arrives."],
                "context_set": ""
              },
              {
                "tag": "CPR for Children and Infants",
                "patterns": ["How does CPR differ for children and infants?"],
                "responses": ["For children (aged 1 to puberty) and infants, CPR techniques are similar but with modifications: For infants, use two fingers to perform chest compressions, aiming for the center of the chest just below the nipple line. For children, use one or two hands depending on the size of the child, compressing the chest about one-third to one-half the depth of the chest."],
                "context_set": ""
              },
              {
                "tag": "CPR Training",
                "patterns": ["Where can I get CPR training?"],
                "responses": ["CPR training is offered by various organizations such as the American Heart Association (AHA), the Red Cross, and community centers. Courses are available for both healthcare professionals and laypersons, covering CPR techniques, AED (automated external defibrillator) use, and first aid skills."],
                "context_set": ""
              },
              {
                "tag": "AED Use",
                "patterns": ["Should I use an AED during CPR?"],
                "responses": ["If an AED (automated external defibrillator) is available, it should be used alongside CPR. AEDs are designed to analyze the heart rhythm and deliver a shock if necessary to restore a normal heart rhythm. They are safe and easy to use, with voice prompts guiding the user through the process."],
                "context_set": ""
              },
              {
                "tag": "CPR for Drowning Victims",
                "patterns": ["How do I perform CPR on a drowning victim?"],
                "responses": ["For drowning victims, it's important to ensure safety before initiating CPR. Remove the person from the water, check for responsiveness, and begin CPR if the person is unresponsive and not breathing normally. Focus on providing effective chest compressions and rescue breaths to restore breathing and circulation."],
                "context_set": ""
              },
              {
                "tag": "CPR and Legal Protection",
                "patterns": ["Am I legally protected if I perform CPR?"],
                "responses": ["Good Samaritan laws vary by jurisdiction, but in many places, individuals who provide reasonable assistance during emergencies such as CPR are protected from liability as long as they act in good faith and without gross negligence. These laws are intended to encourage bystanders to provide aid without fear of legal repercussions."],
                "context_set": ""
              },
              {
                "tag": "Reviewing CPR Skills",
                "patterns": ["How can I review my CPR skills?"],
                "responses": ["You can review your CPR skills by taking refresher courses offered by organizations such as the American Heart Association or the Red Cross, practicing on manikins, participating in simulated scenarios, or attending CPR training sessions at your workplace or community events."],
                "context_set": ""
              }, 
              {
                "tag": "Outer Bleeding Basics",
                "patterns": ["What are the basics of managing outer bleeding?"],
                "responses": ["Managing outer bleeding involves applying direct pressure to the wound to control bleeding, elevating the injured area if possible, and protecting both the injured person and the rescuer from exposure to bloodborne pathogens. It's important to assess the severity of bleeding and seek medical attention if necessary."],
                "context_set": ""
              },
              {
                "tag": "Pressure Application",
                "patterns": ["How do I apply pressure to control bleeding?"],
                "responses": ["To apply pressure to a bleeding wound, use a clean cloth, sterile gauze, or a clean hand to apply direct pressure over the wound. Maintain pressure until bleeding stops or medical help arrives. Avoid lifting the cloth to check the wound, as this can disrupt clot formation and prolong bleeding."],
                "context_set": ""
              },
              {
                "tag": "Elevation Technique",
                "patterns": ["When should I elevate an injured limb to control bleeding?"],
                "responses": ["Elevate an injured limb to control bleeding only if it doesn't cause further harm or discomfort to the injured person. Elevating the limb above the level of the heart can help reduce blood flow to the injured area and minimize bleeding. However, prioritize direct pressure over elevation in most cases."],
                "context_set": ""
              },
              {
                "tag": "Types of External Bleeding",
                "patterns": ["What are the different types of external bleeding?"],
                "responses": ["External bleeding can occur from various types of wounds, including cuts (incisions), scrapes (abrasions), punctures (piercings), and avulsions (tears). Each type of wound may require slightly different management techniques, but the primary goal is to control bleeding and prevent infection."],
                "context_set": ""
              },
              {
                "tag": "Applying Tourniquets",
                "patterns": ["Should I apply a tourniquet for external bleeding?"],
                "responses": ["Tourniquets should only be used as a last resort for life-threatening bleeding that cannot be controlled by direct pressure. Apply a tourniquet 2-3 inches above the wound, between the wound and the heart, using a wide, flat band (such as a belt or cloth). Tighten until bleeding stops and secure it in place."],
                "context_set": ""
              },
              {
                "tag": "Seeking Medical Attention",
                "patterns": ["When should I seek medical attention for external bleeding?"],
                "responses": ["You should seek medical attention for external bleeding if it is severe, doesn't stop with direct pressure, is pulsatile or spouting, involves a large wound or deep cut, is accompanied by signs of infection (such as redness, warmth, or pus), or if the injured person is unable to control bleeding themselves."],
                "context_set": ""
              },
              {
                "tag": "Bleeding Control Kits",
                "patterns": ["Should I have a bleeding control kit on hand?"],
                "responses": ["Having a bleeding control kit, including items such as sterile gauze, bandages, adhesive tape, gloves, and a tourniquet, can be beneficial for managing bleeding emergencies. Familiarize yourself with the contents of the kit and how to use them properly."],
                "context_set": ""
              },
              {
                "tag": "External Bleeding and Shock",
                "patterns": ["Can external bleeding lead to shock?"],
                "responses": ["Yes, severe external bleeding can lead to hypovolemic shock, a life-threatening condition where the body doesn't have enough blood to function properly. Signs of shock include pale or clammy skin, rapid breathing, rapid pulse, confusion, and unconsciousness. Seek medical help immediately if shock is suspected."],
                "context_set": ""
              },
              {
                "tag": "Cleaning Wounds",
                "patterns": ["How should I clean a bleeding wound?"],
                "responses": ["To clean a bleeding wound, rinse it gently with clean water to remove dirt or debris. Avoid using soap, hydrogen peroxide, or alcohol, as they can irritate the wound. Apply an antibiotic ointment and cover the wound with a clean bandage to protect it from further contamination."],
                "context_set": ""
              },
              {
                "tag": "Preventing Infection",
                "patterns": ["How can I prevent infection in a bleeding wound?"],
                "responses": ["To prevent infection in a bleeding wound, keep the wound clean and covered with a sterile bandage or dressing, change bandages regularly, avoid touching the wound with dirty hands, and watch for signs of infection such as increased redness, swelling, pain, or discharge. Seek medical attention if infection occurs."],
                "context_set": ""
              },
              {
                "tag": "Period Pain Basics",
                "patterns": ["What are the basics of period pain?"],
                "responses": ["Period pain, also known as dysmenorrhea, is a common menstrual symptom characterized by cramping in the lower abdomen, back pain, and discomfort during menstruation. It is caused by uterine contractions as the body sheds the uterine lining. While mild period pain is normal, severe pain may indicate an underlying medical condition."],
                "context_set": ""
              },
              {
                "tag": "Menstrual Cramps",
                "patterns": ["What causes menstrual cramps?"],
                "responses": ["Menstrual cramps are primarily caused by the release of prostaglandins, hormone-like substances that trigger uterine contractions to help expel the uterine lining during menstruation. Higher levels of prostaglandins can lead to stronger and more painful contractions, resulting in menstrual cramps."],
                "context_set": ""
              },
              {
                "tag": "Severity of Period Pain",
                "patterns": ["How severe can period pain be?"],
                "responses": ["Period pain can range from mild to severe. Mild cramps may cause discomfort or a dull ache, while severe cramps can be debilitating and interfere with daily activities. If period pain is significantly impacting your quality of life or if it worsens over time, it's important to seek medical evaluation."],
                "context_set": ""
              },
              {
                "tag": "Non-Medication Relief",
                "patterns": ["Are there non-medication ways to relieve period pain?"],
                "responses": ["Yes, there are several non-medication approaches to relieve period pain, including applying heat to the lower abdomen or taking warm baths, practicing relaxation techniques such as deep breathing or meditation, engaging in light physical activity or gentle stretching, and using over-the-counter heat patches or massage."],
                "context_set": ""
              },
              {
                "tag": "Healthy Lifestyle",
                "patterns": ["Can lifestyle changes help reduce period pain?"],
                "responses": ["Maintaining a healthy lifestyle can help reduce the severity of period pain for some individuals. This includes regular exercise, maintaining a balanced diet rich in fruits, vegetables, and whole grains, staying hydrated, getting enough sleep, and managing stress through relaxation techniques or hobbies."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Attention",
                "patterns": ["When should I seek medical attention for period pain?"],
                "responses": ["You should consider seeking medical attention for period pain if it is severe and not relieved by over-the-counter pain relievers or non-medication approaches, if it significantly impacts your daily activities or quality of life, if it worsens over time, or if it is accompanied by other concerning symptoms."],
                "context_set": ""
              },
              {
                "tag": "Underlying Medical Conditions",
                "patterns": ["What underlying medical conditions can cause severe period pain?"],
                "responses": ["Severe period pain may be caused by underlying medical conditions such as endometriosis, adenomyosis, fibroids, pelvic inflammatory disease (PID), or ovarian cysts. These conditions can lead to more intense and persistent menstrual cramps and may require medical evaluation and treatment."],
                "context_set": ""
              },
              {
                "tag": "Medication Options",
                "patterns": ["What medication options are available for period pain?"],
                "responses": ["Various over-the-counter medications can help relieve period pain, including nonsteroidal anti-inflammatory drugs (NSAIDs) like ibuprofen or naproxen, which reduce inflammation and alleviate cramping. Always follow the recommended dosage and consult with a healthcare provider if you have concerns or if pain persists."],
                "context_set": ""
              },
              {
                "tag": "Hormonal Birth Control",
                "patterns": ["Can hormonal birth control help with period pain?"],
                "responses": ["Hormonal birth control methods such as birth control pills, patches, or hormonal intrauterine devices (IUDs) can help reduce period pain for some individuals by regulating menstrual cycles and reducing the intensity of menstrual bleeding and cramping. Discuss with a healthcare provider to explore the best option for you."],
                "context_set": ""
              },
              {
                "tag": "Period Pain and Pregnancy",
                "patterns": ["Can period pain indicate pregnancy?"],
                "responses": ["While period pain is a common menstrual symptom, it can also be mistaken for early pregnancy symptoms such as cramping and abdominal discomfort. If you experience unusual or severe period pain along with other symptoms like missed periods, nausea, or breast tenderness, consider taking a pregnancy test and consult with a healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Seizure Basics",
                "patterns": ["What are the basics of seizures?"],
                "responses": ["A seizure is a sudden, uncontrolled electrical disturbance in the brain that can cause changes in behavior, movements, feelings, or levels of consciousness. Seizures can vary widely in severity and duration, and they may be caused by various factors such as epilepsy, fever, head injury, or underlying medical conditions."],
                "context_set": ""
              },
              {
                "tag": "Types of Seizures",
                "patterns": ["What are the different types of seizures?"],
                "responses": ["Seizures can be classified into different types based on their characteristics and the areas of the brain affected. Common types include generalized seizures (affecting both sides of the brain), focal seizures (affecting specific areas of the brain), absence seizures (brief lapses in awareness), tonic-clonic seizures (formerly known as grand mal seizures), and others."],
                "context_set": ""
              },
              {
                "tag": "Triggers",
                "patterns": ["What can trigger seizures?"],
                "responses": ["Seizures may be triggered by various factors such as lack of sleep, stress, flashing or flickering lights (photosensitivity), certain medications, alcohol or drug withdrawal, hormonal changes, fever (especially in children), infections, head injuries, or underlying medical conditions like epilepsy or brain tumors."],
                "context_set": ""
              },
              {
                "tag": "Managing Seizures",
                "patterns": ["How can seizures be managed?"],
                "responses": ["Managing seizures often involves a combination of approaches tailored to the individual's specific needs. This may include taking anti-seizure medications as prescribed by a healthcare provider, maintaining a healthy lifestyle, managing stress, getting enough sleep, avoiding seizure triggers, and following a seizure action plan."],
                "context_set": ""
              },
              {
                "tag": "First Aid for Seizures",
                "patterns": ["What should I do if someone has a seizure?"],
                "responses": ["If someone is having a seizure, stay calm and keep them safe from harm. Move nearby objects out of the way to prevent injury, cushion their head, and gently guide them to the ground if they are standing. Do not restrain them or put anything in their mouth. After the seizure, roll them onto their side to keep their airway clear and stay with them until they recover."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Attention",
                "patterns": ["When should I seek medical attention for seizures?"],
                "responses": ["You should seek medical attention for seizures if they last longer than 5 minutes, if they occur in water, if the person has difficulty breathing or turns blue, if they are injured during the seizure, if they have repeated seizures without regaining consciousness, or if it's their first seizure."],
                "context_set": ""
              },
              {
                "tag": "Epilepsy Diagnosis",
                "patterns": ["How is epilepsy diagnosed?"],
                "responses": ["Epilepsy is typically diagnosed based on a thorough medical history, physical examination, and diagnostic tests such as electroencephalogram (EEG) to measure brain activity during seizures, imaging studies (such as MRI or CT scans) to look for underlying brain abnormalities, and blood tests to rule out other potential causes."],
                "context_set": ""
              },
              {
                "tag": "Seizure Action Plan",
                "patterns": ["Should I have a seizure action plan?"],
                "responses": ["Having a seizure action plan can help individuals with epilepsy and their caregivers effectively manage seizures. A seizure action plan includes information about the person's medical history, emergency contacts, specific seizure triggers, medications, and steps to take during and after a seizure, tailored to their individual needs."],
                "context_set": ""
              },
              {
                "tag": "Living with Epilepsy",
                "patterns": ["How can someone live well with epilepsy?"],
                "responses": ["Living well with epilepsy involves educating oneself about the condition, following a treatment plan prescribed by a healthcare provider, managing stress, getting enough sleep, avoiding seizure triggers, staying active and maintaining a healthy lifestyle, and seeking support from healthcare professionals, support groups, and loved ones."],
                "context_set": ""
              },
              {
                "tag": "Safety Precautions",
                "patterns": ["What safety precautions should be taken for someone with epilepsy?"],
                "responses": ["Safety precautions for someone with epilepsy may include avoiding activities that pose a risk of injury during seizures, such as swimming alone or working at heights without supervision, wearing medical alert jewelry to inform others about their condition, and informing caregivers, teachers, and employers about what to do in case of a seizure."],
                "context_set": ""
              },
              {
                "tag": "Seizure Basics",
                "patterns": ["What are the basics of seizures?"],
                "responses": ["A seizure is a sudden, uncontrolled electrical disturbance in the brain that can cause changes in behavior, movements, feelings, or levels of consciousness. Seizures can vary widely in severity and duration, and they may be caused by various factors such as epilepsy, fever, head injury, or underlying medical conditions."],
                "context_set": ""
              },
              {
                "tag": "Types of Seizures",
                "patterns": ["What are the different types of seizures?"],
                "responses": ["Seizures can be classified into different types based on their characteristics and the areas of the brain affected. Common types include generalized seizures (affecting both sides of the brain), focal seizures (affecting specific areas of the brain), absence seizures (brief lapses in awareness), tonic-clonic seizures (formerly known as grand mal seizures), and others."],
                "context_set": ""
              },
              {
                "tag": "Triggers",
                "patterns": ["What can trigger seizures?"],
                "responses": ["Seizures may be triggered by various factors such as lack of sleep, stress, flashing or flickering lights (photosensitivity), certain medications, alcohol or drug withdrawal, hormonal changes, fever (especially in children), infections, head injuries, or underlying medical conditions like epilepsy or brain tumors."],
                "context_set": ""
              },
              {
                "tag": "Managing Seizures",
                "patterns": ["How can seizures be managed?"],
                "responses": ["Managing seizures often involves a combination of approaches tailored to the individual's specific needs. This may include taking anti-seizure medications as prescribed by a healthcare provider, maintaining a healthy lifestyle, managing stress, getting enough sleep, avoiding seizure triggers, and following a seizure action plan."],
                "context_set": ""
              },
              {
                "tag": "First Aid for Seizures",
                "patterns": ["What should I do if someone has a seizure?"],
                "responses": ["If someone is having a seizure, stay calm and keep them safe from harm. Move nearby objects out of the way to prevent injury, cushion their head, and gently guide them to the ground if they are standing. Do not restrain them or put anything in their mouth. After the seizure, roll them onto their side to keep their airway clear and stay with them until they recover."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Attention",
                "patterns": ["When should I seek medical attention for seizures?"],
                "responses": ["You should seek medical attention for seizures if they last longer than 5 minutes, if they occur in water, if the person has difficulty breathing or turns blue, if they are injured during the seizure, if they have repeated seizures without regaining consciousness, or if it's their first seizure."],
                "context_set": ""
              },
              {
                "tag": "Epilepsy Diagnosis",
                "patterns": ["How is epilepsy diagnosed?"],
                "responses": ["Epilepsy is typically diagnosed based on a thorough medical history, physical examination, and diagnostic tests such as electroencephalogram (EEG) to measure brain activity during seizures, imaging studies (such as MRI or CT scans) to look for underlying brain abnormalities, and blood tests to rule out other potential causes."],
                "context_set": ""
              },
              {
                "tag": "Seizure Action Plan",
                "patterns": ["Should I have a seizure action plan?"],
                "responses": ["Having a seizure action plan can help individuals with epilepsy and their caregivers effectively manage seizures. A seizure action plan includes information about the person's medical history, emergency contacts, specific seizure triggers, medications, and steps to take during and after a seizure, tailored to their individual needs."],
                "context_set": ""
              },
              {
                "tag": "Living with Epilepsy",
                "patterns": ["How can someone live well with epilepsy?"],
                "responses": ["Living well with epilepsy involves educating oneself about the condition, following a treatment plan prescribed by a healthcare provider, managing stress, getting enough sleep, avoiding seizure triggers, staying active and maintaining a healthy lifestyle, and seeking support from healthcare professionals, support groups, and loved ones."],
                "context_set": ""
              },
              {
                "tag": "Safety Precautions",
                "patterns": ["What safety precautions should be taken for someone with epilepsy?"],
                "responses": ["Safety precautions for someone with epilepsy may include avoiding activities that pose a risk of injury during seizures, such as swimming alone or working at heights without supervision, wearing medical alert jewelry to inform others about their condition, and informing caregivers, teachers, and employers about what to do in case of a seizure."],
                "context_set": ""
              },
            
        
            
              {
                "tag": "Nose Pain Causes",
                "patterns": ["What are common causes of nose pain?"],
                "responses": ["Nose pain can be caused by various factors including sinusitis, nasal congestion or blockage, nasal trauma or injury, nasal polyps, allergies, sinus infections, deviated septum, dry air, or irritants such as pollutants or chemicals."],
                "context_set": ""
              },
              {
                "tag": "Sinusitis",
                "patterns": ["What is sinusitis?"],
                "responses": ["Sinusitis is the inflammation or swelling of the tissue lining the sinuses, which can cause symptoms such as nasal congestion, facial pain or pressure, headache, cough, and post-nasal drip. Acute sinusitis typically follows a viral infection, while chronic sinusitis may persist for weeks or months."],
                "context_set": ""
              },
              {
                "tag": "Nasal Congestion",
                "patterns": ["How does nasal congestion cause nose pain?"],
                "responses": ["Nasal congestion, often due to inflammation of the nasal passages or swollen blood vessels, can lead to pressure and discomfort in the nose. This can be caused by conditions such as allergies, colds, sinus infections, or structural abnormalities in the nasal passages."],
                "context_set": ""
              },
              {
                "tag": "Nasal Trauma",
                "patterns": ["Can nasal trauma cause nose pain?"],
                "responses": ["Yes, nasal trauma or injury, such as a broken nose, blunt force trauma, or even minor bumps or blows to the nose, can cause pain, swelling, and bruising. It may also lead to difficulty breathing through the nose and may require medical evaluation and treatment."],
                "context_set": ""
              },
              {
                "tag": "Nasal Polyps",
                "patterns": ["What are nasal polyps?"],
                "responses": ["Nasal polyps are soft, noncancerous growths that develop on the lining of the nasal passages or sinuses. They can cause symptoms such as nasal congestion, reduced sense of smell, runny nose, facial pain or pressure, and post-nasal drip. Treatment may include medications or surgery."],
                "context_set": ""
              },
              {
                "tag": "Allergic Rhinitis",
                "patterns": ["How does allergic rhinitis contribute to nose pain?"],
                "responses": ["Allergic rhinitis, commonly known as hay fever, occurs when the immune system overreacts to allergens such as pollen, dust mites, or pet dander. Symptoms may include nasal congestion, sneezing, runny nose, itchy or watery eyes, and facial pain or pressure due to sinus inflammation."],
                "context_set": ""
              },
              {
                "tag": "Deviated Septum",
                "patterns": ["What is a deviated septum?"],
                "responses": ["A deviated septum occurs when the thin wall (nasal septum) between the nasal passages is displaced or deviated to one side, making one nasal passage smaller than the other. This can lead to difficulty breathing through the nose, nasal congestion, frequent nosebleeds, and facial pain or pressure."],
                "context_set": ""
              },
              {
                "tag": "Dry Air",
                "patterns": ["How does dry air cause nose pain?"],
                "responses": ["Dry air can irritate the nasal passages, leading to dryness, itching, and discomfort. This can be particularly problematic in dry climates or during the winter months when indoor heating systems remove moisture from the air. Using a humidifier and staying hydrated can help alleviate dry air-related nose pain."],
                "context_set": ""
              },
              {
                "tag": "Irritants",
                "patterns": ["What irritants can cause nose pain?"],
                "responses": ["Exposure to irritants such as pollutants, chemicals, cigarette smoke, or strong odors can irritate the nasal passages and trigger inflammation, leading to nose pain, burning, or discomfort. Minimizing exposure to such irritants and using nasal saline rinses may provide relief."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Attention",
                "patterns": ["When should I seek medical attention for nose pain?"],
                "responses": ["You should seek medical attention for nose pain if it is severe or persistent, if it's accompanied by other concerning symptoms such as fever, headache, vision changes, or signs of infection (such as yellow or green nasal discharge), or if it's affecting your ability to breathe or sleep."],
                "context_set": ""
              }, 
              {
                "tag": "Stage 1 Burn Basics",
                "patterns": ["What are the basics of stage 1 burns?"],
                "responses": ["Stage 1 burns, also known as superficial burns or first-degree burns, affect only the outer layer of the skin (epidermis). They typically appear red and may be accompanied by mild pain, swelling, and tenderness. Stage 1 burns usually heal within a few days without scarring."],
                "context_set": ""
              },
              {
                "tag": "Causes of Stage 1 Burns",
                "patterns": ["What can cause stage 1 burns?"],
                "responses": ["Stage 1 burns can be caused by brief exposure to low-intensity heat, such as touching a hot surface briefly, minor sunburns, or contact with hot liquids or steam. They can also result from friction burns or exposure to certain chemicals or irritants."],
                "context_set": ""
              },
              {
                "tag": "Symptoms of Stage 1 Burns",
                "patterns": ["What are the symptoms of stage 1 burns?"],
                "responses": ["Symptoms of stage 1 burns include redness, warmth, and mild pain at the site of the burn. The affected area may also be slightly swollen and tender to the touch. In some cases, there may be peeling of the skin as the burn heals."],
                "context_set": ""
              },
              {
                "tag": "Home Treatment for Stage 1 Burns",
                "patterns": ["How can I treat stage 1 burns at home?"],
                "responses": ["For stage 1 burns, it's important to cool the burn immediately with cool (not cold) running water or a clean, damp cloth to reduce pain and prevent further tissue damage. Apply aloe vera gel or a moisturizer to soothe the skin and keep it hydrated. Avoid popping blisters, and cover the burn with a sterile, non-adhesive bandage."],
                "context_set": ""
              },
              {
                "tag": "Avoiding Irritants",
                "patterns": ["What should I avoid to prevent irritation of stage 1 burns?"],
                "responses": ["To prevent further irritation of stage 1 burns, avoid applying ice directly to the burn, as it can cause frostbite. Avoid using butter, oil, or other greasy substances on the burn, as they can trap heat and bacteria. Also, refrain from breaking blisters, as this increases the risk of infection."],
                "context_set": ""
              },
              {
                "tag": "Pain Management",
                "patterns": ["How can I manage pain from stage 1 burns?"],
                "responses": ["Over-the-counter pain relievers such as ibuprofen or acetaminophen can help alleviate pain from stage 1 burns. Avoid using aspirin for pain relief, especially in children or teenagers, as it may increase the risk of Reye's syndrome. Cool compresses and elevation of the affected area may also provide relief."],
                "context_set": ""
              },
              {
                "tag": "Monitoring Healing",
                "patterns": ["How can I monitor the healing of stage 1 burns?"],
                "responses": ["Keep a close eye on the burn for signs of infection, such as increased redness, swelling, warmth, or pus-like discharge. If the burn shows signs of infection or if it doesn't seem to be healing properly after a few days, seek medical attention for further evaluation and treatment."],
                "context_set": ""
              },
              {
                "tag": "Sun Protection",
                "patterns": ["Should I protect stage 1 burns from the sun?"],
                "responses": ["Yes, it's important to protect stage 1 burns from further sun exposure to prevent additional damage and discomfort. Apply a broad-spectrum sunscreen with a high SPF to the affected area when going outdoors, and cover the burn with clothing or a bandage for added protection."],
                "context_set": ""
              },
              {
                "tag": "Follow-Up Care",
                "patterns": ["Do I need follow-up care for stage 1 burns?"],
                "responses": ["While stage 1 burns typically heal on their own without complications, it's important to monitor the burn for signs of infection and to seek medical attention if needed. Follow any additional care instructions provided by a healthcare provider, and keep the burn clean and protected until it has fully healed."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Attention",
                "patterns": ["When should I seek medical attention for stage 1 burns?"],
                "responses": ["You should seek medical attention for stage 1 burns if they cover a large area of the body, if they are located on the face, hands, feet, groin, or major joints, if they are accompanied by severe pain, swelling, or signs of infection, or if you have concerns about the healing process."],
                "context_set": ""
              },  
              {
                "tag": "Stage 2 Burn Basics",
                "patterns": ["What are the basics of stage 2 burns?"],
                "responses": ["Stage 2 burns, also known as partial-thickness burns, involve damage to both the outer layer of the skin (epidermis) and the underlying layer (dermis). They typically appear red, swollen, and may develop blisters. Stage 2 burns are more painful than stage 1 burns and may take longer to heal."],
                "context_set": ""
              },
              {
                "tag": "Causes of Stage 2 Burns",
                "patterns": ["What can cause stage 2 burns?"],
                "responses": ["Stage 2 burns can be caused by exposure to heat, flames, hot liquids or steam, chemicals, or prolonged sun exposure. They may also result from friction, such as road rash from a motorcycle accident, or electrical burns from contact with an electrical source."],
                "context_set": ""
              },
              {
                "tag": "Symptoms of Stage 2 Burns",
                "patterns": ["What are the symptoms of stage 2 burns?"],
                "responses": ["Symptoms of stage 2 burns include redness, swelling, pain, and the formation of blisters. The skin may also appear moist or shiny. Stage 2 burns are more painful than stage 1 burns due to the involvement of nerve endings in the dermis layer of the skin."],
                "context_set": ""
              },
              {
                "tag": "Home Treatment for Stage 2 Burns",
                "patterns": ["How can I treat stage 2 burns at home?"],
                "responses": ["For stage 2 burns, it's important to cool the burn immediately with cool (not cold) running water or a clean, damp cloth to reduce pain and prevent further tissue damage. Apply aloe vera gel or a moisturizer to soothe the skin and keep it hydrated. Cover the burn loosely with a sterile, non-adhesive bandage."],
                "context_set": ""
              },
              {
                "tag": "Avoiding Irritants",
                "patterns": ["What should I avoid to prevent irritation of stage 2 burns?"],
                "responses": ["To prevent further irritation of stage 2 burns, avoid applying ice directly to the burn, as it can cause frostbite. Avoid using butter, oil, or other greasy substances on the burn, as they can trap heat and bacteria. Also, refrain from breaking blisters, as this increases the risk of infection."],
                "context_set": ""
              },
              {
                "tag": "Pain Management",
                "patterns": ["How can I manage pain from stage 2 burns?"],
                "responses": ["Over-the-counter pain relievers such as ibuprofen or acetaminophen can help alleviate pain from stage 2 burns. Avoid using aspirin for pain relief, especially in children or teenagers, as it may increase the risk of Reye's syndrome. Cool compresses and elevation of the affected area may also provide relief."],
                "context_set": ""
              },
              {
                "tag": "Monitoring Healing",
                "patterns": ["How can I monitor the healing of stage 2 burns?"],
                "responses": ["Keep a close eye on the burn for signs of infection, such as increased redness, swelling, warmth, or pus-like discharge. If the burn shows signs of infection or if it doesn't seem to be healing properly after a few days, seek medical attention for further evaluation and treatment."],
                "context_set": ""
              },
              {
                "tag": "Sun Protection",
                "patterns": ["Should I protect stage 2 burns from the sun?"],
                "responses": ["Yes, it's important to protect stage 2 burns from further sun exposure to prevent additional damage and discomfort. Apply a broad-spectrum sunscreen with a high SPF to the affected area when going outdoors, and cover the burn with clothing or a bandage for added protection."],
                "context_set": ""
              },
              {
                "tag": "Follow-Up Care",
                "patterns": ["Do I need follow-up care for stage 2 burns?"],
                "responses": ["While stage 2 burns typically heal on their own without complications, it's important to monitor the burn for signs of infection and to seek medical attention if needed. Follow any additional care instructions provided by a healthcare provider, and keep the burn clean and protected until it has fully healed."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Attention",
                "patterns": ["When should I seek medical attention for stage 2 burns?"],
                "responses": ["You should seek medical attention for stage 2 burns if they cover a large area of the body, if they are located on the face, hands, feet, groin, or major joints, if they are accompanied by severe pain, swelling, or signs of infection, or if you have concerns about the healing process."],
                "context_set": ""
              }, 
              {
                "tag": "Finger Break Basics",
                "patterns": ["What are the basics of a finger break?"],
                "responses": ["A finger break, also known as a fractured finger, occurs when one or more bones in the finger are broken or cracked. It can happen due to trauma, such as a direct blow to the finger or crushing injury. Symptoms may include pain, swelling, bruising, deformity, and difficulty moving the finger."],
                "context_set": ""
              },
              {
                "tag": "Symptoms of a Finger Break",
                "patterns": ["What are the symptoms of a finger break?"],
                "responses": ["Symptoms of a finger break may include pain, swelling, bruising, tenderness, deformity, and difficulty moving the finger. In some cases, there may be a visible break in the bone or the finger may appear crooked or misaligned."],
                "context_set": ""
              },
              {
                "tag": "Home Treatment for a Finger Break",
                "patterns": ["How can I treat a finger break at home?"],
                "responses": ["For a suspected finger break, it's important to immobilize the finger to prevent further injury. You can do this by splinting the injured finger to an adjacent finger using tape or a commercially available finger splint. Apply ice to reduce swelling and pain, and elevate the hand to minimize swelling."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Attention",
                "patterns": ["When should I seek medical attention for a finger break?"],
                "responses": ["You should seek medical attention for a suspected finger break if the finger appears deformed or misaligned, if there is severe pain or swelling, if you are unable to move the finger, or if there is an open wound or bone protruding through the skin. Prompt medical evaluation is important for proper diagnosis and treatment."],
                "context_set": ""
              },
              {
                "tag": "Diagnosis of a Finger Break",
                "patterns": ["How is a finger break diagnosed?"],
                "responses": ["A finger break is typically diagnosed based on a physical examination, medical history, and imaging studies such as X-rays. X-rays can help determine the location and severity of the fracture, as well as any associated injuries to the surrounding tissues."],
                "context_set": ""
              },
              {
                "tag": "Treatment Options",
                "patterns": ["What are the treatment options for a finger break?"],
                "responses": ["Treatment for a finger break depends on the severity and location of the fracture. In some cases, the finger may be splinted or placed in a cast to immobilize it while the bone heals. Severe fractures may require surgery to realign the bones and stabilize them with pins, screws, or plates."],
                "context_set": ""
              },
              {
                "tag": "Complications",
                "patterns": ["Are there any complications associated with a finger break?"],
                "responses": ["Complications of a finger break may include malunion or nonunion of the fracture (where the bones heal in a misaligned position or fail to heal), stiffness or decreased range of motion in the finger, nerve or blood vessel damage, and chronic pain or arthritis in the affected joint."],
                "context_set": ""
              },
              {
                "tag": "Recovery Time",
                "patterns": ["How long does it take to recover from a finger break?"],
                "responses": ["The recovery time for a finger break varies depending on the severity of the fracture and the treatment approach. Minor fractures may heal within a few weeks with proper immobilization and rehabilitation, while more severe fractures or those requiring surgery may take several months to fully heal."],
                "context_set": ""
              },
              {
                "tag": "Follow-Up Care",
                "patterns": ["Do I need follow-up care after a finger break?"],
                "responses": ["Yes, follow-up care is important after a finger break to monitor the healing process and ensure that the fracture is properly aligned. Your healthcare provider may recommend periodic X-rays to assess the progress of healing and may provide guidance on rehabilitation exercises to restore strength and mobility to the finger."],
                "context_set": ""
              },
              {
                "tag": "Preventing Finger Injuries",
                "patterns": ["How can I prevent finger breaks?"],
                "responses": ["To reduce the risk of finger breaks, wear protective gear such as gloves when engaging in activities that pose a risk of finger injury, such as sports or manual labor. Use caution when handling heavy objects or machinery, and avoid placing excessive stress on the fingers."],
                "context_set": ""
              }, 
              {
                "tag": "Chest Pain Basics",
                "patterns": ["What are the basics of chest pain?"],
                "responses": ["Chest pain is a common symptom that can range from mild discomfort to severe, crushing pain. It can be caused by a variety of factors, including heart problems, gastrointestinal issues, musculoskeletal problems, respiratory conditions, anxiety, or even panic attacks."],
                "context_set": ""
              },
              {
                "tag": "Causes of Chest Pain",
                "patterns": ["What can cause chest pain?"],
                "responses": ["Chest pain can be caused by various conditions, including heart-related issues such as angina, heart attack, or pericarditis; gastrointestinal problems like acid reflux or gallbladder disease; respiratory conditions such as pneumonia or pleurisy; musculoskeletal issues like muscle strain or costochondritis; anxiety or panic attacks; and other less common causes."],
                "context_set": ""
              },
              {
                "tag": "Symptoms Accompanying Chest Pain",
                "patterns": ["What symptoms may accompany chest pain?"],
                "responses": ["Symptoms that may accompany chest pain include shortness of breath, sweating, nausea or vomiting, dizziness or lightheadedness, palpitations or rapid heartbeat, and pain that radiates to the arms, back, neck, jaw, or abdomen. These additional symptoms can help indicate the cause and severity of the chest pain."],
                "context_set": ""
              },
              {
                "tag": "Evaluation of Chest Pain",
                "patterns": ["How is chest pain evaluated?"],
                "responses": ["The evaluation of chest pain typically involves a thorough medical history, physical examination, and diagnostic tests such as electrocardiogram (ECG), blood tests, chest X-ray, echocardiogram, stress test, or cardiac catheterization. These tests help determine the cause of the chest pain and whether it's related to a serious condition."],
                "context_set": ""
              },
              {
                "tag": "Home Management of Chest Pain",
                "patterns": ["How can I manage chest pain at home?"],
                "responses": ["If you experience chest pain, especially if it's severe or accompanied by other concerning symptoms, it's important to seek medical attention immediately. While awaiting medical help, you can try to stay calm, sit upright, take slow, deep breaths, and chew an aspirin if you have one and are not allergic to it."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Emergency Care",
                "patterns": ["When should I seek emergency care for chest pain?"],
                "responses": ["You should seek emergency medical attention immediately if you experience chest pain that is severe, persistent, or accompanied by symptoms such as shortness of breath, sweating, nausea or vomiting, dizziness, palpitations, or pain that radiates to the arms, back, neck, jaw, or abdomen. These could be signs of a heart attack or other life-threatening condition."],
                "context_set": ""
              },
              {
                "tag": "Non-Emergency Chest Pain",
                "patterns": ["What if my chest pain is not an emergency?"],
                "responses": ["If your chest pain is mild and not accompanied by other concerning symptoms, it's still important to follow up with a healthcare provider to determine the cause. Your provider can perform a thorough evaluation and recommend appropriate treatment or lifestyle changes to help manage the chest pain and prevent future episodes."],
                "context_set": ""
              },
              {
                "tag": "Preventing Chest Pain",
                "patterns": ["How can I prevent chest pain?"],
                "responses": ["To help prevent chest pain, it's important to maintain a healthy lifestyle, including regular exercise, a balanced diet, maintaining a healthy weight, managing stress, avoiding smoking and excessive alcohol consumption, and following any treatment plans recommended by your healthcare provider for underlying medical conditions."],
                "context_set": ""
              },
              {
                "tag": "Importance of Medical Evaluation",
                "patterns": ["Why is it important to seek medical evaluation for chest pain?"],
                "responses": ["Seeking medical evaluation for chest pain is crucial because it can help determine the underlying cause, whether it's related to a serious condition such as a heart attack or a less urgent issue. Early diagnosis and treatment can lead to better outcomes and may even save your life in the case of a heart-related emergency."],
                "context_set": ""
              },
              {
                "tag": "Anxiety and Chest Pain",
                "patterns": ["Can anxiety cause chest pain?"],
                "responses": ["Yes, anxiety and panic attacks can cause chest pain, often described as a sharp or stabbing sensation. This type of chest pain is usually not associated with heart problems but can be very distressing. However, it's still important to seek medical evaluation if you experience chest pain to rule out any serious underlying causes."],
                "context_set": ""
              }, 
              {
                "tag": "Imbalance Basics",
                "patterns": ["What are the basics of sudden imbalance?"],
                "responses": ["Sudden imbalance refers to a feeling of unsteadiness or difficulty maintaining equilibrium without any apparent cause. It can occur suddenly and may be accompanied by feelings of dizziness, lightheadedness, vertigo, or a sensation of spinning or tilting."],
                "context_set": ""
              },
              {
                "tag": "Causes of Sudden Imbalance",
                "patterns": ["What can cause sudden imbalance?"],
                "responses": ["Sudden imbalance can have various causes, including inner ear disorders such as vestibular neuritis or Meniere's disease, neurological conditions like stroke or transient ischemic attack (TIA), head injuries, medication side effects, dehydration, low blood pressure, or sudden changes in position such as getting up too quickly."],
                "context_set": ""
              },
              {
                "tag": "Symptoms Accompanying Sudden Imbalance",
                "patterns": ["What symptoms may accompany sudden imbalance?"],
                "responses": ["In addition to feeling unsteady or off-balance, sudden imbalance may be accompanied by symptoms such as dizziness, lightheadedness, vertigo (a spinning sensation), nausea, vomiting, blurred vision, confusion, or difficulty walking or standing."],
                "context_set": ""
              },
              {
                "tag": "Evaluation of Sudden Imbalance",
                "patterns": ["How is sudden imbalance evaluated?"],
                "responses": ["The evaluation of sudden imbalance typically involves a thorough medical history, physical examination, and may include diagnostic tests such as neurological assessments, vestibular function tests, blood tests, imaging studies (such as MRI or CT scans), or electroencephalogram (EEG) to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Home Management of Sudden Imbalance",
                "patterns": ["How can I manage sudden imbalance at home?"],
                "responses": ["If you experience sudden imbalance, it's important to sit or lie down in a safe place to prevent falls or injuries. Avoid sudden movements and take slow, deep breaths. Hydrate yourself with water and rest until the symptoms subside. If the symptoms persist or worsen, seek medical attention."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Attention",
                "patterns": ["When should I seek medical attention for sudden imbalance?"],
                "responses": ["You should seek medical attention for sudden imbalance if it is severe, persistent, or accompanied by other concerning symptoms such as severe headache, weakness or numbness in the limbs, difficulty speaking or understanding speech, loss of consciousness, or changes in vision."],
                "context_set": ""
              },
              {
                "tag": "Treatment Options",
                "patterns": ["What are the treatment options for sudden imbalance?"],
                "responses": ["Treatment for sudden imbalance depends on the underlying cause. It may include medications to manage symptoms such as dizziness or nausea, physical therapy to improve balance and coordination, lifestyle modifications, or surgical interventions in some cases, such as for inner ear disorders or certain neurological conditions."],
                "context_set": ""
              },
              {
                "tag": "Preventing Sudden Imbalance",
                "patterns": ["How can I prevent sudden imbalance?"],
                "responses": ["To help prevent sudden imbalance, maintain a healthy lifestyle, including regular exercise to improve balance and coordination, staying hydrated, avoiding sudden changes in position, and managing underlying health conditions such as high blood pressure or diabetes that can contribute to imbalance."],
                "context_set": ""
              },
              {
                "tag": "Impact on Daily Life",
                "patterns": ["How does sudden imbalance affect daily life?"],
                "responses": ["Sudden imbalance can significantly impact daily life, making it difficult to perform routine activities such as walking, driving, or even standing without feeling unsteady. It can also increase the risk of falls and injuries, leading to limitations in mobility and independence."],
                "context_set": ""
              },
              {
                "tag": "Follow-Up Care",
                "patterns": ["Do I need follow-up care after experiencing sudden imbalance?"],
                "responses": ["Yes, it's important to follow up with a healthcare provider after experiencing sudden imbalance to determine the underlying cause and receive appropriate treatment or management strategies. Your provider may recommend further tests, referrals to specialists, or adjustments to your treatment plan as needed."],
                "context_set": ""
              },  
              {
                "tag": "Cardiac Pain Basics",
                "patterns": ["What are the basics of cardiac pain?"],
                "responses": ["Cardiac pain, also known as chest pain of cardiac origin, is discomfort or pain felt in the chest that may be caused by a heart-related issue. It can range from mild to severe and may feel like pressure, squeezing, heaviness, tightness, or burning in the chest."],
                "context_set": ""
              },
              {
                "tag": "Causes of Cardiac Pain",
                "patterns": ["What can cause cardiac pain?"],
                "responses": ["Cardiac pain can be caused by various heart-related issues, including angina (stable or unstable), myocardial infarction (heart attack), pericarditis (inflammation of the pericardium), myocarditis (inflammation of the heart muscle), coronary artery spasm, or other conditions affecting the heart."],
                "context_set": ""
              },
              {
                "tag": "Symptoms Accompanying Cardiac Pain",
                "patterns": ["What symptoms may accompany cardiac pain?"],
                "responses": ["In addition to chest pain, cardiac pain may be accompanied by symptoms such as shortness of breath, sweating, nausea or vomiting, dizziness or lightheadedness, palpitations or rapid heartbeat, and pain that radiates to the arms, back, neck, jaw, or abdomen."],
                "context_set": ""
              },
              {
                "tag": "Evaluation of Cardiac Pain",
                "patterns": ["How is cardiac pain evaluated?"],
                "responses": ["The evaluation of cardiac pain typically involves a thorough medical history, physical examination, and diagnostic tests such as electrocardiogram (ECG or EKG), blood tests (such as cardiac enzymes), chest X-ray, echocardiogram, stress test, or cardiac catheterization to determine the underlying cause."],
                "context_set": ""
              },
              {
                "tag": "Home Management of Cardiac Pain",
                "patterns": ["How can I manage cardiac pain at home?"],
                "responses": ["If you experience cardiac pain, especially if it's severe or accompanied by other concerning symptoms, it's important to seek medical attention immediately. While awaiting medical help, you can try to stay calm, sit upright, take slow, deep breaths, and chew an aspirin if you have one and are not allergic to it."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Emergency Care",
                "patterns": ["When should I seek emergency care for cardiac pain?"],
                "responses": ["You should seek emergency medical attention immediately if you experience cardiac pain that is severe, persistent, or accompanied by symptoms such as shortness of breath, sweating, nausea or vomiting, dizziness, palpitations, or pain that radiates to the arms, back, neck, jaw, or abdomen. These could be signs of a heart attack or other life-threatening condition."],
                "context_set": ""
              },
              {
                "tag": "Non-Emergency Cardiac Pain",
                "patterns": ["What if my cardiac pain is not an emergency?"],
                "responses": ["If your cardiac pain is mild and not accompanied by other concerning symptoms, it's still important to follow up with a healthcare provider to determine the cause. Your provider can perform a thorough evaluation and recommend appropriate treatment or lifestyle changes to help manage the cardiac pain and prevent future episodes."],
                "context_set": ""
              },
              {
                "tag": "Preventing Cardiac Pain",
                "patterns": ["How can I prevent cardiac pain?"],
                "responses": ["To help prevent cardiac pain, maintain a healthy lifestyle, including regular exercise, a balanced diet, maintaining a healthy weight, managing stress, avoiding smoking and excessive alcohol consumption, and following any treatment plans recommended by your healthcare provider for underlying heart conditions."],
                "context_set": ""
              },
              {
                "tag": "Impact on Daily Life",
                "patterns": ["How does cardiac pain affect daily life?"],
                "responses": ["Cardiac pain can significantly impact daily life, making it difficult to perform routine activities such as walking, climbing stairs, or even resting comfortably. It can also cause anxiety, fear, and uncertainty about one's health, leading to limitations in mobility and quality of life."],
                "context_set": ""
              },
              {
                "tag": "Follow-Up Care",
                "patterns": ["Do I need follow-up care after experiencing cardiac pain?"],
                "responses": ["Yes, it's important to follow up with a healthcare provider after experiencing cardiac pain to determine the underlying cause and receive appropriate treatment or management strategies. Your provider may recommend further tests, referrals to specialists, or adjustments to your treatment plan as needed."],
                "context_set": ""
              }, 
              {
                "tag": "Headache Basics",
                "patterns": ["What are the basics of headaches?"],
                "responses": ["Headaches are a common symptom characterized by pain or discomfort in the head or neck region. They can vary in intensity, duration, and location, and may be caused by various factors such as stress, dehydration, lack of sleep, eye strain, sinus congestion, or underlying medical conditions."],
                "context_set": ""
              },
              {
                "tag": "Types of Headaches",
                "patterns": ["What are the different types of headaches?"],
                "responses": ["There are several types of headaches, including tension headaches, migraines, cluster headaches, sinus headaches, and rebound headaches. Tension headaches are the most common and are often described as a dull, aching pain that affects both sides of the head."],
                "context_set": ""
              },
              {
                "tag": "Causes of Headaches",
                "patterns": ["What can cause headaches?"],
                "responses": ["Headaches can be caused by various factors, including stress, muscle tension, dehydration, lack of sleep, eye strain, sinus congestion, hormonal changes, certain foods or food additives, caffeine withdrawal, alcohol consumption, or underlying medical conditions such as migraines or tension-type headaches."],
                "context_set": ""
              },
              {
                "tag": "Symptoms Accompanying Headaches",
                "patterns": ["What symptoms may accompany headaches?"],
                "responses": ["In addition to head pain, headaches may be accompanied by symptoms such as sensitivity to light or sound, nausea or vomiting, dizziness, fatigue, irritability, difficulty concentrating, or visual disturbances. The specific symptoms can vary depending on the type and cause of the headache."],
                "context_set": ""
              },
              {
                "tag": "Evaluation of Headaches",
                "patterns": ["How are headaches evaluated?"],
                "responses": ["The evaluation of headaches typically involves a thorough medical history, physical examination, and may include diagnostic tests such as imaging studies (such as MRI or CT scans), blood tests, or lumbar puncture to determine the underlying cause of the headaches and rule out serious conditions."],
                "context_set": ""
              },
              {
                "tag": "Home Management of Headaches",
                "patterns": ["How can I manage headaches at home?"],
                "responses": ["For mild headaches, you can try home remedies such as resting in a quiet, dark room, applying a cold or warm compress to the head or neck, staying hydrated, practicing relaxation techniques, or taking over-the-counter pain relievers. If headaches are severe or persistent, seek medical attention."],   
                "context_set": "" 
              }, 
              {
                "tag": "Cardiac Pain Overview",
                "patterns": ["What is cardiac pain?"],
                "responses": ["Cardiac pain, often felt as discomfort or pressure in the chest, can indicate underlying heart issues. It may also manifest as pain in the arms, back, neck, jaw, or abdomen."],
                "context_set": ""
              },
              {
                "tag": "Causes of Cardiac Pain",
                "patterns": ["What can cause cardiac pain?"],
                "responses": ["Cardiac pain can stem from various conditions like angina, heart attack, pericarditis, or myocarditis. These conditions affect the heart's function and blood flow, leading to pain."],
                "context_set": ""
              },
              {
                "tag": "Recognizing Symptoms",
                "patterns": ["What symptoms accompany cardiac pain?"],
                "responses": ["Symptoms accompanying cardiac pain may include shortness of breath, sweating, nausea, dizziness, palpitations, or pain radiating to other body parts. Recognizing these symptoms is crucial for prompt medical attention."],
                "context_set": ""
              },
              {
                "tag": "Urgency of Seeking Medical Help",
                "patterns": ["When should I seek medical help for cardiac pain?"],
                "responses": ["If you experience severe, persistent cardiac pain or symptoms like shortness of breath, seek emergency medical care immediately. It could be a sign of a heart attack or other serious heart conditions."],
                "context_set": ""
              },
              {
                "tag": "Evaluation and Diagnosis",
                "patterns": ["How is cardiac pain diagnosed?"],
                "responses": ["Diagnosis of cardiac pain involves a thorough medical history, physical examination, and diagnostic tests like ECG, blood tests, or imaging studies. These help determine the underlying cause and severity of the condition."],
                "context_set": ""
              },
              {
                "tag": "Home Care Measures",
                "patterns": ["What can I do at home for cardiac pain?"],
                "responses": ["While awaiting medical help, sit upright, take slow breaths, and avoid sudden movements. Chew an aspirin if recommended by a healthcare provider and not contraindicated for you."],
                "context_set": ""
              },
              {
                "tag": "Preventing Cardiac Pain",
                "patterns": ["How can I prevent cardiac pain?"],
                "responses": ["Maintaining a healthy lifestyle with regular exercise, a balanced diet, and stress management can reduce the risk of cardiac issues. It's crucial to follow any treatment plans prescribed by your healthcare provider."],
                "context_set": ""
              },
              {
                "tag": "Impact on Daily Life",
                "patterns": ["How does cardiac pain affect daily life?"],
                "responses": ["Cardiac pain can significantly affect daily activities and quality of life. It may lead to anxiety and uncertainty about health, impacting both physical and emotional well-being."],
                "context_set": ""
              },
              {
                "tag": "Follow-Up Care",
                "patterns": ["Do I need follow-up care after experiencing cardiac pain?"],
                "responses": ["After experiencing cardiac pain, it's essential to follow up with a healthcare provider for further evaluation and management. Additional tests or referrals may be necessary to monitor heart health and prevent future episodes."],
                "context_set": ""
              },
              {
                "tag": "Importance of Early Intervention",
                "patterns": ["Why is early intervention important for cardiac pain?"],
                "responses": ["Early intervention and proper management of cardiac pain can improve outcomes and prevent complications. Don't ignore symptoms or delay seeking medical help when experiencing cardiac-related discomfort."],
                "context_set": ""
              } ,
              {
                "tag": "Causes of Muscle Cramps",
                "patterns": ["What are some common causes of muscle cramps?"],
                "responses": ["Muscle cramps can be caused by various factors, such as dehydration, staying in one position for a long time, low levels of electrolytes like calcium or potassium, stress, poor circulation, compressed spinal nerves, certain medications, alcohol abuse, hypothyroidism, and kidney failure."],
                "context_set": ""
              },
              {
                "tag": "Symptoms of Muscle Cramps",
                "patterns": ["How can I recognize if I'm experiencing a muscle cramp?"],
                "responses": ["Muscle cramps often feel like a muscle contracting or tightening without reason. This sensation, sometimes referred to as a charley horse, is accompanied by hardness or bulging in the affected muscle. Common areas for muscle cramps include the abdomen, arms, feet, hamstrings, hands, quadriceps, and calves."],
                "context_set": ""
              },
              {
                "tag": "Treating Muscle Cramps",
                "patterns": ["What can I do to stop a muscle cramp?"],
                "responses": ["Several methods can help alleviate muscle cramps, including stretching the cramped muscle, massaging it, applying heat or cold packs, elevating the affected body part, and using over-the-counter pain relievers like ibuprofen or acetaminophen. In severe cases or for frequent cramps, consulting a doctor may be necessary for prescription muscle relaxers."],
                "context_set": ""
              },
              {
                "tag": "Duration of Muscle Cramps",
                "patterns": ["How long do muscle cramps typically last?"],
                "responses": ["In most cases, muscle cramps resolve within a few minutes or even seconds. However, if a cramp persists for an extended period, medical attention may be needed, especially if it's accompanied by intense pain, frequent occurrences, muscle weakness, or other concerning symptoms."],
                "context_set": ""
              },
              {
                "tag": "When to Seek Medical Help for Muscle Cramps",
                "patterns": ["When should I see a doctor about my muscle cramps?"],
                "responses": ["While muscle cramps are usually temporary and harmless, it's advisable to consult a doctor if you experience intense or persistent cramping, frequent occurrences, muscle weakness, changes in skin appearance, or if cramps interfere with your sleep. These could be signs of underlying issues related to circulation, nerves, metabolism, medications, or nutrition."],
                "context_set": ""
              },{
                "tag": "Ligament Anatomy",
                "patterns": ["What is a ligament?"],
                "responses": ["A ligament is a short band of tough, flexible tissue composed of numerous individual fibers. It connects bone to bone or bone to cartilage, primarily functioning to maintain bone alignment and prevent joints from moving beyond their intended range."]
              },
              {
                "tag": "Common Ligament Injuries",
                "patterns": ["How do ligament injuries typically occur?"],
                "responses": ["Ligament injuries, also known as sprains, often result from over-stressing a joint beyond its normal range. This frequently happens in sports activities when athletes twist, land awkwardly, or fall. Knee and ankle ligaments are most susceptible due to their constant activity and weight-bearing functions."]
              },
              {
                "tag": "Treatment Options for Ligament Injuries",
                "patterns": ["I have a ligament injurie"],
                "responses": ["Depending on the severity of the injury, various methods may be employed for ligament injury treatment. These can include rest, ice application, compression, elevation (RICE method), and if necessary, surgical repair by specialists such as Dr. Chris Clark and his team at Premier Spine and Sports Medicine."]
              },
              {
                "tag": "Rest as a Treatment for Ligament Injuries",
                "patterns": ["what to do if i have pain in ligament ?"],
                "responses": ["Rest is crucial in allowing an injured body part to recover by minimizing stress from activities. The duration of rest varies based on the injury, but it's essential to allocate sufficient time for the affected area to heal properly."]
              },
              {
                "tag": "Swelling Reduction Techniques for Ligament Injuries",
                "patterns": ["i feel pain in ligament "],
                "responses": ["Swelling reduction is vital in the initial treatment of ligament injuries. The RICE method, which stands for Rest, Ice, Compression, and Elevation, is commonly employed. Ice application provides immediate pain relief and limits swelling by constricting blood flow, while compression and elevation further aid in minimizing swelling and promoting recovery."]
              },{
                "tag": "Shortness of Breath",
                "patterns": ["I feel shortness in breath?"],
                "responses": ["Encourage the individual to rest. Exertion increases oxygen consumption, exacerbating the feeling of breathlessness. Similar to taking a break during a strenuous workout, resting can help alleviate shortness of breath until further assistance arrives."]
              },
              {
                "tag": "Comfortable Position for Shortness of Breath",
                "patterns": ["i can't breath properly"],
                "responses": ["Allow the individual to sit, stand, or lie down in the most comfortable position. Different people find different positions helpful. Some may benefit from raising their arms to expand the chest, while others may find relief in the 'tripod position,' leaning forward with hands or elbows on knees."]
              },
              {
                "tag": "Calling Emergency Services for Shortness of Breath",
                "patterns": ["not breathing "],
                "responses": ["If resting comfortably doesn't alleviate the shortness of breath within two or three minutes, it's advisable to call emergency services (911). Use your discretion, and if you believe the situation is severe, do not hesitate to call for immediate assistance."]
              },
              {
                "tag": "Use of Oxygen for Shortness of Breath",
                "patterns": ["How can oxygen be used to help with shortness of breath?"],
                "responses": ["If the individual has access to oxygen, it should be used as directed. Although prolonged oxygen use may have adverse effects, during episodes of shortness of breath, the victim should follow their doctor's instructions for oxygen use to alleviate symptoms."]
              },
              {
                "tag": "Treating Underlying Causes of Shortness of Breath",
                "patterns": ["What should be done to address the cause of shortness of breath?"],
                "responses": ["Identify and treat the underlying cause of shortness of breath. Various conditions can lead to this symptom, such as asthma, lung infections, or heart attacks. Treatment may involve administering appropriate medication, seeking medical attention, or calling for an ambulance, depending on the severity of the situation."]
              },{
                "tag": "Importance of Regulations",
                "patterns": ["Why are regulations important?"],
                "responses": ["Regulations are essential for maintaining order, safety, and fairness in society. They provide guidelines for behavior, protect public health and safety, and ensure compliance with ethical and legal standards."]
              },
              {
                "tag": "Government Regulations",
                "patterns": ["What role does the government play in implementing regulations?"],
                "responses": ["Governments enact and enforce regulations to protect the interests of their citizens, regulate industries, preserve the environment, and maintain social order. Regulatory agencies are often tasked with monitoring and enforcing compliance with these regulations."]
              },
              {
                "tag": "Business Regulations",
                "patterns": ["How do regulations affect businesses?"],
                "responses": ["Regulations impact businesses by setting standards for product safety, labor practices, environmental sustainability, and financial transparency. Compliance with regulations is essential for businesses to operate legally and maintain trust with customers and stakeholders."]
              },
              {
                "tag": "Environmental Regulations",
                "patterns": ["What are some examples of environmental regulations?"],
                "responses": ["Environmental regulations govern activities that impact the environment, such as pollution control, waste management, conservation of natural resources, and protection of endangered species. These regulations aim to minimize environmental damage and promote sustainable practices."]
              },
              {
                "tag": "Health and Safety Regulations",
                "patterns": ["How do health and safety regulations protect workers?"],
                "responses": ["Health and safety regulations set standards for workplace conditions, equipment, and practices to prevent accidents, injuries, and occupational illnesses. They require employers to provide a safe working environment and implement measures to minimize health risks."]
              },
              {
                "tag": "Financial Regulations",
                "patterns": ["What is the purpose of financial regulations?"],
                "responses": ["Financial regulations oversee the conduct of financial institutions, markets, and professionals to maintain stability, protect investors, prevent fraud, and ensure fair and transparent financial practices. They include regulations on banking, securities, insurance, and accounting."]
              },
              {
                "tag": "Consumer Protection Regulations",
                "patterns": ["How do consumer protection regulations benefit consumers?"],
                "responses": ["Consumer protection regulations safeguard consumers against unfair, deceptive, or harmful business practices. They ensure product safety, truthful advertising, fair pricing, and accessible recourse for consumer complaints. These regulations promote consumer confidence and trust in the marketplace."]
              },
              {
                "tag": "Data Protection Regulations",
                "patterns": ["What are data protection regulations?"],
                "responses": ["Data protection regulations govern the collection, use, storage, and sharing of personal data to safeguard individuals' privacy and prevent unauthorized access or misuse of their information. Examples include the European Union's GDPR and various national data protection laws."]
              },
              {
                "tag": "Transportation Regulations",
                "patterns": ["How do transportation regulations ensure safety and efficiency?"],
                "responses": ["Transportation regulations establish standards for vehicle safety, driver qualifications, road infrastructure, and transportation services to ensure the safety of passengers, pedestrians, and goods. They also promote efficiency, reliability, and environmental sustainability in transportation systems."]
              },
              {
                "tag": "Compliance with Regulations",
                "patterns": ["Why is compliance with regulations important?"],
                "responses": ["Compliance with regulations is essential for maintaining legal and ethical standards, avoiding penalties or fines, protecting public health and safety, and preserving trust and credibility. Non-compliance can result in legal liabilities, reputational damage, and financial losses."]
              },{
                "tag": "Headache",
                "patterns": [
                    "How do you relieve a headache?",
                    "What can I do for a headache?",
                    "Which remedies are effective for headaches?",
                    "How to alleviate headache pain?"
                ],
                "responses": [
                    "1) Stay Hydrated: Drink plenty of water throughout the day. 2) Rest: Lie down in a quiet, dark room and try to rest. 3) Apply Cold or Warm Compresses: Use a cold or warm compress on your forehead or neck. 4) Practice Relaxation Techniques: Try deep breathing, meditation, or progressive muscle relaxation. 5) Limit Caffeine and Alcohol: Reduce or avoid consumption. 6) Maintain Regular Sleep Patterns: Aim for 7-9 hours of quality sleep per night. 7) Manage Stress: Try exercise, yoga, or hobbies to reduce stress. 8) Identify and Avoid Triggers: Pay attention to factors that trigger your headaches and try to avoid them. 9) Consider Professional Help: Consult a healthcare provider if headaches are severe, frequent, or persistent."
                ],
                "context_set": ""
            },
            {
                "tag": "Cramps",
                "patterns": [
                    "How can I relieve cramps?",
                    "What should I do for cramps?",
                    "Which remedies work for cramps?",
                    "How to alleviate cramp pain?"
                ],
                "responses": [
                    "1) Apply Heat: Use a heating pad or take a warm bath to relax the muscles and relieve cramps. 2) Gentle Exercise: Light stretching or gentle exercise, such as walking, may help reduce cramp intensity. 3) Stay Hydrated: Drink plenty of water to prevent dehydration, which can contribute to cramping. 4) Massage: Gently massage the affected area to help relax tight muscles and ease cramp discomfort. 5) Over-the-Counter Pain Relievers: Consider taking non-prescription pain medications like ibuprofen or acetaminophen for pain relief. 6) Magnesium: Some studies suggest that magnesium supplements may help reduce the frequency and severity of muscle cramps, but consult with a healthcare provider before taking any supplements. 7) Potassium: Ensure you're getting enough potassium-rich foods in your diet, such as bananas, oranges, and sweet potatoes, as low potassium levels can contribute to muscle cramps. 8) Avoid Triggering Factors: Identify and avoid triggers such as dehydration, excessive exercise, or certain medications that may worsen cramps. 9) Relaxation Techniques: Practice relaxation techniques like deep breathing or meditation to help relax tense muscles and reduce cramp discomfort. 10) Consult a Healthcare Provider: If cramps are severe, frequent, or interfering with daily activities, it's advisable to seek medical advice for further evaluation and treatment."
                ],
                "context_set": ""
            }        
] }
